{
    "title": "City-State Society",
    "subtitle": "A Nation-State Society organized around a single dominant urban centre and its immediate hinterland.",
    "parentTitle": "Nation-State Society",
    "content": "A **city-state society** is a form of political organization centered around a single dominant urban center that exercises control over its surrounding territory and rural hinterland. This organizational structure represents one of humanity's earliest forms of complex political governance, where the city serves as both the economic hub and the seat of political power. Unlike modern nation-states that encompass vast territories with multiple urban centers, city-states are characterized by their compact geographical scope and the concentration of administrative, military, and economic functions within a single metropolitan area.\n\nHistorically, city-state societies emerged in various regions including ancient Mesopotamia (such as Ur and Babylon), classical Greece (Athens and Sparta), Renaissance Italy (Venice and Florence), and parts of medieval Europe. These societies typically developed in areas with favorable geographic conditions such as river valleys, coastal regions, or strategic trade routes that facilitated commerce and population concentration. The **political structure** of city-states often featured direct forms of governance where citizens could participate more actively in decision-making processes compared to larger territorial states, though the definition of citizenship was frequently restricted to a privileged class. ",
    "sections": [],
    "details": [],
    "relationships": [],
    "citations": [],
    "links": [
        {
            "url": "https://www.britannica.com/topic/city-state",
            "title": "City-state | Definition, History, & Modern Examples"
        },
        {
            "url": "https://www.worldhistory.org/city-state/",
            "title": "City-State - World History Encyclopedia"
        },
        {
            "url": "https://www.nationalgeographic.org/encyclopedia/city-state/",
            "title": "City-State - National Geographic Society"
        },
        {
            "url": "https://plato.stanford.edu/entries/polis/",
            "title": "The Greek Polis - Stanford Encyclopedia of Philosophy"
        },
        {
            "url": "https://www.thoughtco.com/what-is-a-city-state-195313",
            "title": "What Is a City-State? Definition and Modern Examples"
        }
    ]
}