[
    {
        "title": "look",
        "parentTitle": "English Lexical",
        "content": "/lʊk/\n(Pronunciation Key: /l/ as in 'love', /ʊ/ as in 'put', /k/ as in 'cat')\n\n1. To direct one's eyes towards something in order to perceive it visually.\n2. To appear or seem to be in a particular state or condition.\n3. An act of directing one's gaze; a brief visual inspection.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Perception, Appearance, Observation"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vi, Vt), Noun\nVerbs: base: look, past simple: looked, past participle: looked (regular)\nNouns: plural: looks"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'lōcian' (to look, behold, see), which shares roots with Old High German 'luogēn' (to look). The ultimate origin is uncertain but points towards a Proto-Germanic *lōkōną."
            },
            {
                "title": "Usage Examples",
                "content": "1. She looked intently at the intricate details of the painting.\n2. He always looks happy when he's playing with his dog.\n3. The police took a quick look at the evidence before proceeding."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Look up to someone': To admire or respect someone greatly.\n2. 'Look down on someone': To consider someone to be inferior or unworthy.\n3. 'Look out!': Used as a warning to be careful."
            }
        ]
    },
    {
        "title": "want",
        "parentTitle": "English Lexical",
        "content": "/wɒnt/\n(Pronunciation Key: /w/ as in 'water', /ɒ/ as in 'hot', /n/ as in 'net', /t/ as in 'top')\n\n1. To have a strong desire or yearning for something.\n2. To be lacking or deficient in something essential or desirable.\n3. A need or a strong desire for something; a state of lacking.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General (the second definition is less common in modern colloquial use)"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Desire, Need, Deficiency"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Noun\nVerbs: base: want, past simple: wanted, past participle: wanted (regular)\nNouns: plural: wants"
            },
            {
                "title": "Etymology",
                "content": "Derived from Old Norse 'vanta' (to lack, be wanting), which is connected to 'vanr' (lacking). It entered the English language around the 13th century, taking the place of older Old English terms for 'lack'."
            },
            {
                "title": "Usage Examples",
                "content": "1. I really want a vacation after this busy period.\n2. The old building wants a complete renovation to be habitable.\n3. There was a desperate want of medical supplies in the remote village.\n4. Her only want was a quiet evening at home."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'For want of': Because of a lack of something.\n2. 'Want in': To desire to participate or be included."
            }
        ]
    },
    {
        "title": "give",
        "parentTitle": "English Lexical",
        "content": "/ɡɪv/\n(Pronunciation Key: /ɡ/ as in 'go', /ɪ/ as in 'sit', /v/ as in 'van')\n\n1. To transfer possession of something to someone, often as a gift or payment.\n2. To provide or supply something, such as information, support, or a service.\n3. To yield to pressure or force; to collapse or break under strain.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Transfer, Provision, Concession"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi)\nVerbs: base: give, past simple: gave, past participle: given (irregular)"
            },
            {
                "title": "Etymology",
                "content": "Originates from Old English 'giefan' (to give, grant), which comes from Proto-Germanic '*geban' (to give). The ultimate root is Proto-Indo-European '*ghabh-' (to seize, take), whose meaning evolved to 'to give' within the Germanic languages."
            },
            {
                "title": "Usage Examples",
                "content": "1. She gave him a beautiful handcrafted necklace for their anniversary.\n2. The professor gave a detailed explanation of the complex theory to the students.\n3. The old wooden beams began to give under the weight of the snow.\n4. He finally gave in to his children's pleas for ice cream."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Give up': To stop trying; to surrender.\n2. 'Give away': To reveal a secret, or to donate something freely.\n3. 'Give it a go/try': To attempt something."
            }
        ]
    },
    {
        "title": "use",
        "parentTitle": "English Lexical",
        "content": "/juːz/ (verb), /juːs/ (noun)\n(Pronunciation Key: /j/ as in 'yes', /uː/ as in 'moon', /z/ as in 'zebra' for verb; /s/ as in 'snake' for noun)\n\n1. To employ something for a particular purpose or in a particular way.\n2. The act or instance of employing something for a specific purpose.\n3. The state of being able to employ or benefit from something.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Function, Application, Custom"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt), Noun\nVerbs: base: use, past simple: used, past participle: used (regular)\nNouns: plural: uses"
            },
            {
                "title": "Etymology",
                "content": "Derived from Old French 'user' (to use, employ), which in turn comes from Latin 'usare' (to use, make use of), a frequentative form of 'uti' (to use, employ). The noun form entered English from Old French 'us' (use, custom)."
            },
            {
                "title": "Usage Examples",
                "content": "1. Please use the appropriate safety equipment when working with these chemicals.\n2. He tried to use his charm to convince her, but it didn't work.\n3. The library encourages the proper use of its facilities by all patrons.\n4. After the accident, he gradually regained the use of his legs through physical therapy."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Used to': Accustomed to something, or indicating a past habitual action or state.\n2. 'Make use of': To employ or benefit from something available."
            }
        ]
    },
    {
        "title": "find",
        "parentTitle": "English Lexical",
        "content": "/faɪnd/\n(Pronunciation Key: /f/ as in 'fan', /aɪ/ as in 'my', /n/ as in 'net', /d/ as in 'dog')\n\n1. To discover something, either by chance or after a deliberate search.\n2. To perceive, realize, or experience something through observation or reflection.\n3. A valuable or interesting discovery, especially one made after searching.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Discovery, Perception, Acquisition"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Noun\nVerbs: base: find, past simple: found, past participle: found (irregular)\nNouns: plural: finds"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'findan' (to find, discover), stemming from Proto-Germanic '*finþanan' (to find, discover). The ultimate origin can be traced back to Proto-Indo-European '*pent-' (to tread, go, pass), suggesting the idea of 'to come upon' something by movement or exploration."
            },
            {
                "title": "Usage Examples",
                "content": "1. She was thrilled to find her grandmother's antique brooch hidden in the attic.\n2. I often find that exercising in the morning boosts my energy for the whole day.\n3. The archaeologists announced a significant find at the ancient burial site.\n4. After months of searching, they finally found the perfect house."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Find out': To discover information or a fact.\n2. 'Find one's feet': To become comfortable, confident, or established in a new situation.\n3. 'Find fault with': To criticize or complain about something."
            }
        ]
    },
    {
        "title": "tell",
        "parentTitle": "English Lexical",
        "content": "/tɛl/\n(Pronunciation Key: /t/ as in 'top', /ɛ/ as in 'bed', /l/ as in 'love')\n\n1. To communicate information, a story, or a message to someone verbally or in writing.\n2. To instruct or command someone to do something.\n3. To discern, distinguish, or determine something, especially a difference.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Communication, Instruction, Distinction"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi)\nVerbs: base: tell, past simple: told, past participle: told (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'tellan' (to count, reckon, relate), which stems from Proto-Germanic '*taljanan' (to count, calculate, tell). It is linguistically related to the word 'tale'."
            },
            {
                "title": "Usage Examples",
                "content": "1. Could you please tell me the way to the nearest train station?\n2. The coach told the players to practice their drills diligently every day.\n3. It's often difficult to tell the difference between artificial and real flowers.\n4. My grandmother loves to tell stories from her childhood."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Tell apart': To distinguish between two or more similar things or people.\n2. 'Tell on': To inform an authority figure about someone's misbehavior.\n3. 'To tell the truth': Used to introduce a truthful statement, often after some hesitation."
            }
        ]
    },
    {
        "title": "ask",
        "parentTitle": "English Lexical",
        "content": "/ɑːsk/\n(Pronunciation Key: /ɑː/ as in 'father', /s/ as in 'snake', /k/ as in 'cat')\n\n1. To put a question to someone in order to obtain information or an answer.\n2. To request something, typically a favor or a gift, from someone.\n3. To invite someone to an event, gathering, or to accompany one.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Inquiry, Request, Invitation"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi)\nVerbs: base: ask, past simple: asked, past participle: asked (regular)"
            },
            {
                "title": "Etymology",
                "content": "Originates from Old English 'āscian' (to ask, inquire, demand), which descends from Proto-Germanic '*aiskonan' (to ask, demand). Its deeper roots lie in Proto-Indo-European '*ais-' (to wish, desire)."
            },
            {
                "title": "Usage Examples",
                "content": "1. The student asked the teacher for clarification on the assignment.\n2. He always asks for extra cheese on his pizza.\n3. They asked their neighbors over for a barbecue last weekend.\n4. If you need help, don't hesitate to ask."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Ask for it': To provoke or deserve trouble or punishment.\n2. 'Ask around': To inquire among several people for information.\n3. 'Ask too much': To request something that is unreasonable or difficult to provide."
            }
        ]
    },
    {
        "title": "work",
        "parentTitle": "English Lexical",
        "content": "/wɜːrk/\n(Pronunciation Key: /w/ as in 'water', /ɜː/ as in 'bird', /r/ as in 'red', /k/ as in 'cat')\n\n1. To engage in physical or mental activity in order to achieve a purpose or result; to labor.\n2. To function or operate successfully, as a machine or a plan.\n3. The effort or activity involved in achieving a purpose or result, often for pay; a task or a job.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Labor, Function, Creation, Effort"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vi, Vt), Noun\nVerbs: base: work, past simple: worked, past participle: worked (regular)\nNouns: plural: works (can refer to a collection of creations, or a factory/site of production)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'weorcan' (to work, labor, perform), which comes from Proto-Germanic '*werkanan' (to work). The noun form originated from Old English 'weorc' (work, labor, deed), from Proto-Germanic '*werkan' (work)."
            },
            {
                "title": "Usage Examples",
                "content": "1. She works as a software engineer for a tech company.\n2. Despite its age, the antique clock still works perfectly.\n3. His latest work of art was highly praised by critics.\n4. After hours of hard work, they finally completed the project."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Work out': To exercise; also, to resolve a problem or situation successfully.\n2. 'Work up': To gradually develop a feeling or state.\n3. 'All in a day's work': Something difficult or unusual that is accepted as part of one's normal routine."
            }
        ]
    },
    {
        "title": "seem",
        "parentTitle": "English Lexical",
        "content": "/siːm/\n(Pronunciation Key: /s/ as in 'snake', /iː/ as in 'sheep', /m/ as in 'mouse')\n\n1. To appear to be something or to give the impression of being in a particular state.\n2. To be generally considered or judged to be something.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Appearance, Perception, Impression"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vi)\nVerbs: base: seem, past simple: seemed, past participle: seemed (regular)"
            },
            {
                "title": "Etymology",
                "content": "Derived from Old Norse 'sœma' (to conform, be fitting), which comes from Proto-Germanic '*samjan' (to conform, make fit). The sense of 'appear to be' developed later in the English language."
            },
            {
                "title": "Usage Examples",
                "content": "1. She seems a bit sad today; I wonder what's wrong.\n2. It seemed like a good idea at the time, but it turned out to be disastrous.\n3. The project seemed to be progressing smoothly, but then we hit a snag.\n4. He always seems to have all the answers."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Seem to be': To give the impression of being or existing in a certain way.\n2. 'It seems that...': A common introductory phrase indicating an observation or inference."
            }
        ]
    },
    {
        "title": "fee",
        "parentTitle": "English Lexical",
        "content": "/fiː/\n(Pronunciation Key: /f/ as in 'fan', /iː/ as in 'sheep')\n\n1. A payment made to a professional person or organization in exchange for advice, services, or rights.\n2. A fixed charge for a privilege, such as entry to an event or use of a facility.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General, often formal in professional or financial contexts"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Payment, Cost, Service, Finance"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Noun\nNouns: plural: fees"
            },
            {
                "title": "Etymology",
                "content": "From Old French 'fee', 'fieu' (feudal landholding, payment), which comes from Medieval Latin 'feudum' (fief, feudal land). Ultimately, its origins can be traced back to Proto-Germanic '*fehu' (cattle, property, money), connecting it to concepts of wealth and payment (as seen in 'pecuniary')."
            },
            {
                "title": "Usage Examples",
                "content": "1. The consultant charges a high fee for her expert advice.\n2. There is an annual membership fee to join the exclusive club.\n3. Before enrolling, check the tuition fees for the entire course.\n4. Many banks charge a small fee for ATM withdrawals from other banks."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Attorney's fees': The charges incurred for legal services from a lawyer.\n2. 'Flat fee': A fixed amount of payment, regardless of the work involved."
            }
        ]
    },
    {
        "title": "make",
        "parentTitle": "English Lexical",
        "content": "/meɪk/\n(Pronunciation Key: /m/ as in 'mat', /eɪ/ as in 'day', /k/ as in 'cat')\n\n1. To create, construct, or cause something to exist or happen.\n2. To compel or cause someone or something to do something.\n3. To amount to; to constitute or form.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Creation, Causation, Formation"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt), Noun\nVerbs: base: make, past simple: made, past participle: made (irregular)\nNouns: plural: makes (less common, often refers to a brand or type)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'macian' (to make, create, form, do), which comes from Proto-Germanic '*makōną' (to make, fit). Its ultimate origin is uncertain, but it might relate to Proto-Indo-European '*mag-' (to knead, press, fashion)."
            },
            {
                "title": "Usage Examples",
                "content": "1. She loves to make her own clothes from scratch.\n2. The sudden noise made the baby cry uncontrollably.\n3. Two plus two makes four in arithmetic.\n4. He made a promise to visit his grandmother every weekend."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Make up': To reconcile; to invent a story; to compensate for something.\n2. 'Make do': To manage with whatever is available, even if it's not ideal.\n3. 'Make sense': To be logical or understandable."
            }
        ]
    },
    {
        "title": "get",
        "parentTitle": "English Lexical",
        "content": "/ɡɛt/\n(Pronunciation Key: /ɡ/ as in 'go', /ɛ/ as in 'bed', /t/ as in 'top')\n\n1. To obtain, acquire, or receive something.\n2. To arrive at a place or reach a particular state.\n3. To understand or comprehend something.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General, highly versatile; can be informal in some contexts."
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Acquisition, Movement, Understanding"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi)\nVerbs: base: get, past simple: got, past participle: gotten (American English) / got (British English) (irregular)\nNote: 'Gotten' is the preferred past participle in American English, while 'got' is used in British English for the past participle, except in phrases like 'ill-gotten gains'."
            },
            {
                "title": "Etymology",
                "content": "From Old Norse 'geta' (to get, obtain, beget), which is connected to Old English 'gietan' (to grasp, reach). Its ultimate origin is Proto-Germanic '*getanan'."
            },
            {
                "title": "Usage Examples",
                "content": "1. Did you get the mail today?\n2. We need to get to the airport by 6 AM.\n3. I don't quite get what you're trying to say.\n4. She got a new job last week."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Get up': To rise from bed or a sitting position.\n2. 'Get along with': To have a friendly relationship with someone.\n3. 'Get over': To recover from an illness or a difficult experience."
            }
        ]
    },
    {
        "title": "go",
        "parentTitle": "English Lexical",
        "content": "/ɡoʊ/\n(Pronunciation Key: /ɡ/ as in 'go', /oʊ/ as in 'boat')\n\n1. To move from one place to another; to travel or proceed.\n2. To function or operate, often successfully.\n3. To pass into a particular state or condition.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Movement, State Change, Function"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vi)\nVerbs: base: go, past simple: went, past participle: gone (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'gān' (to go, walk, move), from Proto-Germanic '*gānan'. The past tense 'went' comes from the unrelated Old English verb 'wendan' (to turn, go, depart), which became associated with 'go' over time."
            },
            {
                "title": "Usage Examples",
                "content": "1. We decided to go to the beach for our vacation.\n2. The car wouldn't go because it ran out of gas.\n3. The milk will go sour if you leave it out of the fridge.\n4. Everything is going according to plan."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Go out': To leave one's home for social activity; for a light to stop shining.\n2. 'Go on': To continue; to happen.\n3. 'Let go': To release; to stop clinging to something."
            }
        ]
    },
    {
        "title": "know",
        "parentTitle": "English Lexical",
        "content": "/noʊ/\n(Pronunciation Key: /n/ as in 'net', /oʊ/ as in 'boat')\n\n1. To possess information, understanding, or skill through experience or education.\n2. To be familiar or acquainted with a person, place, or thing.\n3. To recognize or distinguish something.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Cognition, Awareness, Recognition"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi)\nVerbs: base: know, past simple: knew, past participle: known (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'cnāwan' (to know, perceive, understand), from Proto-Germanic '*knēwanan' (to know). This word is ultimately derived from Proto-Indo-European '*ǵneh₃-' (to know), which is also the root of words like 'gnosis' and 'recognize'."
            },
            {
                "title": "Usage Examples",
                "content": "1. I know the answer to that difficult question.\n2. Do you know anyone who can fix this leaky faucet?\n3. It's hard to know exactly what he's thinking sometimes.\n4. She knows how to speak three languages fluently."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Know by heart': To have memorized completely.\n2. 'Know-how': Practical knowledge or skill.\n3. 'Know the ropes': To be familiar with the procedures or details of a task."
            }
        ]
    },
    {
        "title": "take",
        "parentTitle": "English Lexical",
        "content": "/teɪk/\n(Pronunciation Key: /t/ as in 'top', /eɪ/ as in 'day', /k/ as in 'cat')\n\n1. To lay hold of something with hands or instruments; to seize or grasp.\n2. To carry or convey something or someone from one place to another.\n3. To accept, receive, or acquire something willingly or unwillingly.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Possession, Movement, Acceptance"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt)\nVerbs: base: take, past simple: took, past participle: taken (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old Norse 'taka' (to take, grasp, lay hold of), which supplanted the native Old English verb 'niman'. Its origins are in Proto-Germanic '*takaną' (to touch, grasp)."
            },
            {
                "title": "Usage Examples",
                "content": "1. Please take your belongings with you when you leave.\n2. She offered to take the children to the park this afternoon.\n3. I decided to take the job offer, even though it meant relocating.\n4. Don't take his comments personally; he didn't mean any harm."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Take off': To remove clothing; for an aircraft to leave the ground; to become successful.\n2. 'Take after': To resemble a parent or older relative.\n3. 'Take part in': To participate in an activity."
            }
        ]
    },
    {
        "title": "see",
        "parentTitle": "English Lexical",
        "content": "/siː/\n(Pronunciation Key: /s/ as in 'snake', /iː/ as in 'sheep')\n\n1. To perceive with the eyes; to observe or view.\n2. To understand or comprehend something.\n3. To meet or visit someone.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Perception, Understanding, Encounter"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi)\nVerbs: base: see, past simple: saw, past participle: seen (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'sēon' (to see, look, perceive), from Proto-Germanic '*sehwanan' (to see). Its ultimate origin is Proto-Indo-European '*sekʷ-' (to follow, see)."
            },
            {
                "title": "Usage Examples",
                "content": "1. Can you see the mountains from your window?\n2. I see what you mean; your point is valid.\n3. I'm going to see my doctor next week for a check-up.\n4. Let's see if we can find a solution to this problem."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'See eye to eye': To agree with someone.\n2. 'See through': To understand someone's true motives or intentions; to complete a task.\n3. 'See to it': To ensure something is done."
            }
        ]
    },
    {
        "title": "come",
        "parentTitle": "English Lexical",
        "content": "/kʌm/\n(Pronunciation Key: /k/ as in 'cat', /ʌ/ as in 'cup', /m/ as in 'mat')\n\n1. To move towards the speaker or a specified place or point.\n2. To arrive or appear.\n3. To reach a particular state or result.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Movement, Arrival, Development"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vi)\nVerbs: base: come, past simple: came, past participle: come (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'cuman' (to come, arrive, approach), from Proto-Germanic '*kwemanan' (to come). Its ultimate origin is Proto-Indo-European '*gʷem-' (to go, come)."
            },
            {
                "title": "Usage Examples",
                "content": "1. Please come here; I need your help.\n2. The train came into the station exactly on time.\n3. How did you come to that conclusion?\n4. The new flowers will come into bloom soon."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Come up with': To suggest or think of an idea or plan.\n2. 'Come across': To find or meet by chance; to appear in a certain way.\n3. 'Come true': For a wish or dream to become a reality."
            }
        ]
    },
    {
        "title": "think",
        "parentTitle": "English Lexical",
        "content": "/θɪŋk/\n(Pronunciation Key: /θ/ as in 'thin', /ɪ/ as in 'sit', /ŋk/ as in 'sink')\n\n1. To form or have an idea or opinion; to consider something.\n2. To use one's mind to reason, imagine, or remember.\n3. To believe or suppose something to be true.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Cognition, Opinion, Belief"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vi, Vt)\nVerbs: base: think, past simple: thought, past participle: thought (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'þencan' (to think, consider, imagine), from Proto-Germanic '*þankjanan' (to think). This is related to 'þeccan' (to seem, appear), highlighting an older connection between thought and appearance."
            },
            {
                "title": "Usage Examples",
                "content": "1. I need to think about your offer before I give an answer.\n2. What do you think about the new policy?\n3. I think it's going to rain later today.\n4. He spent hours thinking about the solution to the puzzle."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Think outside the box': To think creatively and unconventionally.\n2. 'Think twice': To consider something carefully before acting.\n3. 'Think big': To have ambitious ideas or plans."
            }
        ]
    },
    {
        "title": "say",
        "parentTitle": "English Lexical",
        "content": "/seɪ/\n(Pronunciation Key: /s/ as in 'snake', /eɪ/ as in 'day')\n\n1. To utter words; to express something verbally.\n2. To state or declare something as a fact or opinion.\n3. To recite or perform something, like a prayer or a poem.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Communication, Expression, Declaration"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Noun\nVerbs: base: say, past simple: said, past participle: said (irregular)\nNouns: plural: says (rare, usually 'what someone says')"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'secgan' (to say, speak, tell), from Proto-Germanic '*sagjanan' (to say). Its ultimate origin is Proto-Indo-European '*sekʷ-' (to utter, say)."
            },
            {
                "title": "Usage Examples",
                "content": "1. She said hello as she walked past.\n2. The report says that the economy is improving.\n3. He always says his prayers before going to bed.\n4. What did you say your name was?"
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'That is to say': In other words; to explain something more clearly.\n2. 'Say no more': Used to indicate that one understands without further explanation.\n3. 'Easier said than done': Used when something sounds simple but is difficult to achieve."
            }
        ]
    },
    {
        "title": "mean",
        "parentTitle": "English Lexical",
        "content": "/miːn/\n(Pronunciation Key: /m/ as in 'mat', /iː/ as in 'sheep', /n/ as in 'net')\n\n1. To intend to convey, indicate, or refer to a particular thing; to signify.\n2. To intend to do something; to have a purpose.\n3. (Adjective) Unkind, malicious, or unfair in behavior.\n4. (Noun) The average or middle point.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General (adjective can be informal)"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Meaning, Intention, Behavior (Adjective), Statistics (Noun)"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Adjective, Noun\nVerbs: base: mean, past simple: meant, past participle: meant (irregular)\nAdjectives: comparative: meaner, superlative: meanest\nNouns: plural: means (often used with a plural sense, e.g., 'by all means')"
            },
            {
                "title": "Etymology",
                "content": "Verb: From Old English 'mænan' (to mean, intend, signify), from Proto-Germanic '*mainjanan'. Adjective: From Old English 'gemæne' (common, general), from Proto-Germanic '*gamainiz' (common, shared), relating to Proto-Indo-European '*moini-' (common, communal). The noun 'mean' (average) comes from Old French 'meien' (middle), from Latin 'medianus'."
            },
            {
                "title": "Usage Examples",
                "content": "1. What does this word mean in this context?\n2. I didn't mean to offend you with my comment.\n3. Don't be so mean to your little brother!\n4. The statistical analysis showed the mean score was 75."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'By all means': Certainly; by any necessary means.\n2. 'Mean well': To have good intentions, even if the result is not good.\n3. 'What do you mean?': A common question asking for clarification."
            }
        ]
    },
    {
        "title": "tell",
        "parentTitle": "English Lexical",
        "content": "/tɛl/\n(Pronunciation Key: /t/ as in 'top', /ɛ/ as in 'bed', /l/ as in 'love')\n\n1. To communicate information, a story, or a message to someone verbally or in writing.\n2. To instruct or command someone to do something.\n3. To discern, distinguish, or determine something, especially a difference.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Communication, Instruction, Distinction"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi)\nVerbs: base: tell, past simple: told, past participle: told (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'tellan' (to count, reckon, relate), which stems from Proto-Germanic '*taljanan' (to count, calculate, tell). It is linguistically related to the word 'tale'."
            },
            {
                "title": "Usage Examples",
                "content": "1. Could you please tell me the way to the nearest train station?\n2. The teacher told the students to sit down quietly before the lesson began.\n3. It's often difficult to tell the difference between these two similar shades of blue.\n4. My grandmother loves to tell stories from her childhood every time we visit."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Tell apart': To distinguish between two or more similar things or people.\n2. 'Tell on': To inform an authority figure about someone's misbehavior, often in a negative sense.\n3. 'To tell the truth': Used to introduce a truthful statement, often implying honesty or frankness."
            }
        ]
    },
    {
        "title": "put",
        "parentTitle": "English Lexical",
        "content": "/pʊt/\n(Pronunciation Key: /p/ as in 'pot', /ʊ/ as in 'put', /t/ as in 'top')\n\n1. To move something to a specific place or position.\n2. To express something in words; to state or articulate.\n3. To subject someone or something to a particular action or state.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Placement, Expression, Imposition"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt)\nVerbs: base: put, past simple: put, past participle: put (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'putian' (to push, thrust, put), which is of uncertain origin but possibly related to Proto-Germanic '*pūtōną'. The modern sense of 'to place' developed later."
            },
            {
                "title": "Usage Examples",
                "content": "1. Please put the book on the shelf when you're done.\n2. She put her thoughts into a concise email to the team.\n3. The company decided to put the new product on hold for now.\n4. He put a lot of effort into preparing for the exam."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Put off': To postpone; to discourage or repel.\n2. 'Put up with': To tolerate or endure something unpleasant.\n3. 'Put out': To extinguish a fire; to inconvenience someone."
            }
        ]
    },
    {
        "title": "mean",
        "parentTitle": "English Lexical",
        "content": "/miːn/\n(Pronunciation Key: /m/ as in 'mat', /iː/ as in 'sheep', /n/ as in 'net')\n\n1. To intend to convey, indicate, or refer to a particular thing; to signify.\n2. To intend to do something; to have a purpose.\n3. (Adjective) Unkind, malicious, or unfair in behavior.\n4. (Noun) The average or middle point.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General (adjective can be informal)"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Meaning, Intention, Behavior (Adjective), Statistics (Noun)"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Adjective, Noun\nVerbs: base: mean, past simple: meant, past participle: meant (irregular)\nAdjectives: comparative: meaner, superlative: meanest\nNouns: plural: means (often used with a plural sense, e.g., 'by all means')"
            },
            {
                "title": "Etymology",
                "content": "Verb: From Old English 'mænan' (to mean, intend, signify), from Proto-Germanic '*mainjanan'. Adjective: From Old English 'gemæne' (common, general), from Proto-Germanic '*gamainiz' (common, shared), relating to Proto-Indo-European '*moini-' (common, communal). The noun 'mean' (average) comes from Old French 'meien' (middle), from Latin 'medianus'."
            },
            {
                "title": "Usage Examples",
                "content": "1. What does this symbol mean on the map?\n2. I didn't mean to interrupt your conversation earlier.\n3. It was really mean of him to say those hurtful things.\n4. We calculated the arithmetic mean of all the test scores."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'By all means': Certainly; by any necessary method.\n2. 'Mean well': To have good intentions, even if the outcome is not ideal.\n3. 'What do you mean?': A common phrase used to ask for clarification or explanation."
            }
        ]
    },
    {
        "title": "keep",
        "parentTitle": "English Lexical",
        "content": "/kiːp/\n(Pronunciation Key: /k/ as in 'cat', /iː/ as in 'sheep', /p/ as in 'pot')\n\n1. To have or retain possession of something; to hold onto.\n2. To continue to be in a specified state, condition, or activity.\n3. To store or maintain something in a particular place or condition.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Retention, Continuity, Maintenance"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi)\nVerbs: base: keep, past simple: kept, past participle: kept (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'cēpan' (to seize, take, keep, observe), which is of uncertain origin, possibly related to Proto-Germanic '*kōpijaną'."
            },
            {
                "title": "Usage Examples",
                "content": "1. You can keep the change; I don't need it.\n2. She tries to keep fit by exercising every day.\n3. Please keep these documents in a safe place.\n4. He kept talking even after the bell rang."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Keep on': To continue doing something.\n2. 'Keep up with': To stay at the same pace or level as someone or something.\n3. 'Keep in mind': To remember or consider something."
            }
        ]
    },
    {
        "title": "let",
        "parentTitle": "English Lexical",
        "content": "/lɛt/\n(Pronunciation Key: /l/ as in 'love', /ɛ/ as in 'bed', /t/ as in 'top')\n\n1. To allow or permit someone to do something; to give permission.\n2. To cause something to be or remain in a specified state.\n3. (Archaic/Literary) To lease or rent out property.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General (third definition is archaic/literary)"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Permission, Causation, Rental"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt)\nVerbs: base: let, past simple: let, past participle: let (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'lǣtan' (to let, allow, permit, cause to be), from Proto-Germanic '*lētanan' (to let, leave). This is related to the word 'late'."
            },
            {
                "title": "Usage Examples",
                "content": "1. My parents let me stay out late on weekends.\n2. Let the door remain open for some fresh air.\n3. The landlord decided to let out the spare room.\n4. Don't let fear stop you from pursuing your dreams."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Let go': To release one's grip; to stop holding onto something.\n2. 'Let down': To disappoint someone; to lower something.\n3. 'Let alone': Not to mention; much less."
            }
        ]
    },
    {
        "title": "help",
        "parentTitle": "English Lexical",
        "content": "/hɛlp/\n(Pronunciation Key: /h/ as in 'hat', /ɛ/ as in 'bed', /l/ as in 'love', /p/ as in 'pot')\n\n1. To make it easier or possible for someone to do something by offering assistance.\n2. To improve a situation or condition.\n3. The act of assisting or contributing to an improvement.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Assistance, Improvement, Aid"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Noun\nVerbs: base: help, past simple: helped, past participle: helped (regular)\nNouns: plural: helps (less common, usually refers to instances of help)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'helpan' (to help, aid, assist), from Proto-Germanic '*helpanan' (to help). Its ultimate origin is Proto-Indo-European '*kelb-'."
            },
            {
                "title": "Usage Examples",
                "content": "1. Can you help me carry these groceries inside?\n2. This new medication really helps with my allergies.\n3. Your quick thinking was a great help in resolving the crisis.\n4. He offered to help his neighbor with the garden work."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Help out': To assist someone, often in a difficult situation.\n2. 'Can't help but': Unable to avoid doing something.\n3. 'So help me God': A solemn oath, emphasizing sincerity."
            }
        ]
    },
    {
        "title": "talk",
        "parentTitle": "English Lexical",
        "content": "/tɔːk/\n(Pronunciation Key: /t/ as in 'top', /ɔː/ as in 'bought', /k/ as in 'cat')\n\n1. To communicate by speaking; to utter words.\n2. To have a conversation or discussion with someone.\n3. A conversation or discussion.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Communication, Conversation, Discourse"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vi, Vt), Noun\nVerbs: base: talk, past simple: talked, past participle: talked (regular)\nNouns: plural: talks"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'talian' (to recount, tell, compute), related to 'tell'. The sense of 'speaking' developed later. It is possibly derived from Proto-Germanic '*talōną' (to count, relate)."
            },
            {
                "title": "Usage Examples",
                "content": "1. He likes to talk for hours on end about philosophy.\n2. We need to talk about your performance at work.\n3. The two leaders held peace talks to resolve the conflict.\n4. She often talks to herself when she's stressed."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Talk shop': To discuss work-related topics outside of work.\n2. 'Talk big': To boast or exaggerate.\n3. 'Talk sense': To speak rationally and reasonably."
            }
        ]
    },
    {
        "title": "start",
        "parentTitle": "English Lexical",
        "content": "/stɑːrt/\n(Pronunciation Key: /s/ as in 'snake', /t/ as in 'top', /ɑː/ as in 'father', /r/ as in 'red', /t/ as in 'top')\n\n1. To begin an action, operation, or process; to commence.\n2. To cause something to begin or operate.\n3. The point or moment at which something begins.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Beginning, Initiation, Commencement"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Noun\nVerbs: base: start, past simple: started, past participle: started (regular)\nNouns: plural: starts"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'styrtan' (to leap up, move quickly, startle), which is of Germanic origin. The sense of 'to begin' developed from the idea of setting out or springing forth."
            },
            {
                "title": "Usage Examples",
                "content": "1. The race will start at 10 AM sharp.\n2. He couldn't start the car because the battery was dead.\n3. The start of a new school year always brings excitement.\n4. They decided to start a new business venture together."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Start over': To begin again from the beginning.\n2. 'Start from scratch': To begin from nothing, without any previous preparation.\n3. 'To start with': As a first point or consideration."
            }
        ]
    },
    {
        "title": "run",
        "parentTitle": "English Lexical",
        "content": "/rʌn/\n(Pronunciation Key: /r/ as in 'red', /ʌ/ as in 'cup', /n/ as in 'net')\n\n1. To move at a speed faster than walking, using one's legs.\n2. To operate or function, often continuously.\n3. To manage or control an organization or system.\n4. A period of running; an act of running.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Movement, Operation, Management"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vi, Vt), Noun\nVerbs: base: run, past simple: ran, past participle: run (irregular)\nNouns: plural: runs"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'rinnan', 'irnan' (to run, flow, go), from Proto-Germanic '*rinnaną'. The 'u' sound in modern English reflects a Northern dialect influence."
            },
            {
                "title": "Usage Examples",
                "content": "1. She loves to run marathons in her free time.\n2. The machine runs on electricity, not batteries.\n3. He runs a successful software company with over 100 employees.\n4. We went for a quick run before breakfast this morning."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Run out of': To exhaust one's supply of something.\n2. 'Run into': To meet someone unexpectedly; to collide with something.\n3. 'Run low on': To have a small amount of something remaining."
            }
        ]
    },
    {
        "title": "hold",
        "parentTitle": "English Lexical",
        "content": "/hoʊld/\n(Pronunciation Key: /h/ as in 'hat', /oʊ/ as in 'boat', /l/ as in 'love', /d/ as in 'dog')\n\n1. To grasp, carry, or support something with one's hands or arms.\n2. To keep or retain something in a particular position or state.\n3. To organize or conduct an event or meeting.\n4. The act of grasping or keeping something; a grip.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Retention, Support, Organization"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Noun\nVerbs: base: hold, past simple: held, past participle: held (irregular)\nNouns: plural: holds"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'haldan', 'healdan' (to hold, possess, keep), from Proto-Germanic '*haldanan' (to hold, keep). Its ultimate origin is Proto-Indo-European '*kel-' (to drive, push, impel), with the sense evolving to 'to hold back'."
            },
            {
                "title": "Usage Examples",
                "content": "1. Please hold my hand as we cross the street.\n2. Can you hold the door open for me, please?\n3. The company will hold its annual conference next month.\n4. She had a firm hold on the steering wheel."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Hold on': To wait; to maintain a grip.\n2. 'Hold back': To restrain oneself; to prevent something from advancing.\n3. 'Hold true': To remain valid or accurate."
            }
        ]
    },
    {
        "title": "turn",
        "parentTitle": "English Lexical",
        "content": "/tɜːrn/\n(Pronunciation Key: /t/ as in 'top', /ɜː/ as in 'bird', /r/ as in 'red', /n/ as in 'net')\n\n1. To move in a circular direction around a central point or axis.\n2. To change direction or orientation.\n3. To change into a different state, form, or quality.\n4. An act of turning; a change of direction or opportunity.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Rotation, Change, Direction"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Noun\nVerbs: base: turn, past simple: turned, past participle: turned (regular)\nNouns: plural: turns"
            },
            {
                "title": "Etymology",
                "content": "From Old French 'torner' (to turn, change, alter), from Latin 'tornare' (to turn in a lathe, turn), derived from 'tornus' (lathe, turning tool). The word ultimately relates to the idea of a circular movement."
            },
            {
                "title": "Usage Examples",
                "content": "1. The earth turns on its axis once every 24 hours.\n2. Turn left at the next intersection to reach the library.\n3. The leaves turn golden brown in autumn.\n4. It's your turn to choose the movie tonight."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Turn down': To refuse an offer; to reduce the volume or intensity.\n2. 'Turn up': To arrive unexpectedly; to increase the volume or intensity.\n3. 'Turn a blind eye': To deliberately ignore something undesirable."
            }
        ]
    },
    {
        "title": "system",
        "parentTitle": "English Lexical",
        "content": "/ˈsɪstəm/\n(Pronunciation Key: /ˈsɪstəm/ - primary stress on the first syllable; /s/ as in 'snake', /ɪ/ as in 'sit', /s/ as in 'snake', /t/ as in 'top', /ə/ as in 'about', /m/ as in 'mat')\n\n1. A set of connected things or parts forming a complex whole.\n2. A set of principles or procedures according to which something is done; an organized scheme or method.\n3. A body or group of related substances or organs that function together.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General, often technical or academic"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Structure, Organization, Method, Biology, Technology"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Noun\nNouns: plural: systems"
            },
            {
                "title": "Etymology",
                "content": "From Late Latin 'systēma' (an organized whole, a compound), from Greek 'systēma' (a whole compounded of parts, a body). This traces back to Greek 'synistanai' (to stand together, combine), from 'syn-' (together) + 'histanai' (to cause to stand)."
            },
            {
                "title": "Usage Examples",
                "content": "1. The circulatory system is responsible for pumping blood throughout the body.\n2. The new computer system was difficult to learn at first.\n3. Their production system is incredibly efficient and minimizes waste.\n4. The legal system is designed to uphold justice and enforce laws."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Work the system': To manipulate rules or procedures to one's advantage.\n2. 'Get out of one's system': To get rid of a strong emotion or need by expressing it."
            }
        ]
    },
    {
        "title": "feel",
        "parentTitle": "English Lexical",
        "content": "/fiːl/\n(Pronunciation Key: /f/ as in 'fan', /iː/ as in 'sheep', /l/ as in 'love')\n\n1. To perceive through the sense of touch.\n2. To experience an emotion or a physical sensation.\n3. To believe or have an opinion about something.\n4. A sensation, especially a physical one; an emotional state.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Sensation, Emotion, Perception, Opinion"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Noun\nVerbs: base: feel, past simple: felt, past participle: felt (irregular)\nNouns: plural: feels (less common, usually refers to sensations or emotional vibes)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'fēlan' (to feel, perceive, touch), from Proto-Germanic '*fōlijanan' (to feel, perceive). Its ultimate origin is uncertain but possibly related to Proto-Indo-European '*pal-' (to touch, feel, shake)."
            },
            {
                "title": "Usage Examples",
                "content": "1. I can feel the soft texture of the velvet blanket.\n2. She feels very happy about her promotion at work.\n3. I feel that he's being dishonest about the situation.\n4. The unexpected cold snap gave me a strange feel in my bones."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Feel out': To discreetly try to discover someone's opinion or intentions.\n2. 'Feel up to': To feel well enough or strong enough to do something.\n3. 'Feel blue': To feel sad or depressed."
            }
        ]
    },
    {
        "title": "try",
        "parentTitle": "English Lexical",
        "content": "/traɪ/\n(Pronunciation Key: /t/ as in 'top', /r/ as in 'red', /aɪ/ as in 'my')\n\n1. To make an effort or attempt to do something.\n2. To test or experiment with something to see if it works or is suitable.\n3. To put a person on trial in a court of law.\n4. An attempt or an effort.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Effort, Experimentation, Legal"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Noun\nVerbs: base: try, past simple: tried, past participle: tried (regular)\nNouns: plural: tries"
            },
            {
                "title": "Etymology",
                "content": "From Old French 'trier' (to sort out, sift, select), which may be of Gaulish origin. The sense of 'attempting' or 'testing' developed from the idea of putting something to the test."
            },
            {
                "title": "Usage Examples",
                "content": "1. You should try to finish your homework before watching TV.\n2. I decided to try the new restaurant down the street.\n3. The suspect will be tried for theft next month.\n4. After several tries, he finally managed to open the stubborn jar."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Try on': To put on clothing to see if it fits.\n2. 'Try out': To test something; to audition for a role.\n3. 'Give it a try': To make an attempt."
            }
        ]
    },
    {
        "title": "leave",
        "parentTitle": "English Lexical",
        "content": "/liːv/\n(Pronunciation Key: /l/ as in 'love', /iː/ as in 'sheep', /v/ as in 'van')\n\n1. To go away from a place; to depart.\n2. To let something remain behind; to not take something with one.\n3. To allow something to be or remain in a specified state or condition.\n4. Permission to be absent from work or duty; a period of absence.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Departure, Abandonment, Permission"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vi, Vt), Noun\nVerbs: base: leave, past simple: left, past participle: left (irregular)\nNouns: plural: leaves (for noun sense 4)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'lǣfan' (to leave, bequeath, allow to remain), from Proto-Germanic '*laibjanan' (to leave, remain). Related to 'live' (in the sense of remaining alive)."
            },
            {
                "title": "Usage Examples",
                "content": "1. We need to leave for the airport in an hour.\n2. Don't leave your keys on the table; you might forget them.\n3. Please leave the door open a crack for the cat.\n4. She was granted two weeks of annual leave from her job."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Leave out': To omit or exclude something.\n2. 'Leave well enough alone': To not interfere with something that is already satisfactory.\n3. 'Leave someone in the lurch': To abandon someone in a difficult situation."
            }
        ]
    },
    {
        "title": "call",
        "parentTitle": "English Lexical",
        "content": "/kɔːl/\n(Pronunciation Key: /k/ as in 'cat', /ɔː/ as in 'bought', /l/ as in 'love')\n\n1. To shout or cry out to attract attention or to summon someone.\n2. To make a telephone call to someone.\n3. To name or label something or someone.\n4. An act of calling; a shout or a telephone communication.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Communication, Naming, Summons"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Noun\nVerbs: base: call, past simple: called, past participle: called (regular)\nNouns: plural: calls"
            },
            {
                "title": "Etymology",
                "content": "From Old Norse 'kalla' (to call, shout, summon, name), which displaced the native Old English 'ceallian'. It is of Proto-Germanic origin, '*kallōną'."
            },
            {
                "title": "Usage Examples",
                "content": "1. She had to call out her friend's name to get her attention.\n2. I'll call you later this evening to confirm our plans.\n3. They decided to call their new puppy 'Buddy'.\n4. We received an urgent call from the client this morning."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Call off': To cancel an event or action.\n2. 'Call it a day/night': To stop working or doing something for the rest of the day/night.\n3. 'Call for': To require or demand something."
            }
        ]
    },
    {
        "title": "need",
        "parentTitle": "English Lexical",
        "content": "/niːd/\n(Pronunciation Key: /n/ as in 'net', /iː/ as in 'sheep', /d/ as in 'dog')\n\n1. To require something because it is essential or very important, rather than just desirable.\n2. To be in want of something.\n3. A requirement for something essential or important.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Necessity, Requirement, Want"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Modal), Noun\nVerbs: base: need, past simple: needed, past participle: needed (regular)\nNouns: plural: needs"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'nēadian' (to compel, force), and Old English 'nēod' (necessity, duty, desire). Both trace back to Proto-Germanic '*naudiz' (need, distress)."
            },
            {
                "title": "Usage Examples",
                "content": "1. I need to buy some groceries for dinner tonight.\n2. The plants need watering every other day to thrive.\n3. My primary need right now is a good night's sleep.\n4. Do you need any help with that heavy box?"
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'In need of': Requiring assistance or something specific.\n2. 'Meet a need': To satisfy a requirement or demand.\n3. 'No need to': Used to say that something is unnecessary."
            }
        ]
    },
    {
        "title": "feel",
        "parentTitle": "English Lexical",
        "content": "/fiːl/\n(Pronunciation Key: /f/ as in 'fan', /iː/ as in 'sheep', /l/ as in 'love')\n\n1. To perceive through the sense of touch.\n2. To experience an emotion or a physical sensation.\n3. To believe or have an opinion about something.\n4. A sensation, especially a physical one; an emotional state.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Sensation, Emotion, Perception, Opinion"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Noun\nVerbs: base: feel, past simple: felt, past participle: felt (irregular)\nNouns: plural: feels (less common, usually refers to sensations or emotional vibes)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'fēlan' (to feel, perceive, touch), from Proto-Germanic '*fōlijanan' (to feel, perceive). Its ultimate origin is uncertain but possibly related to Proto-Indo-European '*pal-' (to touch, feel, shake)."
            },
            {
                "title": "Usage Examples",
                "content": "1. I can feel the soft texture of the velvet blanket with my fingertips.\n2. She feels very happy about her promotion at work and is celebrating.\n3. I feel that he's being dishonest about the situation, based on his evasive answers.\n4. The unexpected cold snap gave me a strange feel, like winter was coming early."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Feel out': To discreetly try to discover someone's opinion or intentions before acting.\n2. 'Feel up to': To feel well enough or strong enough to perform a task or activity.\n3. 'Feel blue': To feel sad, melancholy, or depressed."
            }
        ]
    },
    {
        "title": "become",
        "parentTitle": "English Lexical",
        "content": "/bɪˈkʌm/\n(Pronunciation Key: /b/ as in 'bat', /ɪ/ as in 'sit', /k/ as in 'cat', /ʌ/ as in 'cup', /m/ as in 'mat')\n\n1. To come to be; to turn into or grow into a new state, form, or condition.\n2. To be appropriate or suitable for someone or something.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Transformation, Suitability, Growth"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vi, Vt)\nVerbs: base: become, past simple: became, past participle: become (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'becuman' (to come to, arrive, happen, befall), from Proto-Germanic '*bikwemanan' (to come around, come to, meet). The sense of 'to grow into' or 'to turn into' developed from the idea of something arriving at a new state."
            },
            {
                "title": "Usage Examples",
                "content": "1. He wants to become a doctor when he grows up.\n2. The caterpillar will soon become a beautiful butterfly.\n3. That dress becomes you; it really suits your style.\n4. It's important to become more aware of environmental issues."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Become of': What has happened to someone or something.\n2. 'Become known': To be recognized or discovered by many people."
            }
        ]
    },
    {
        "title": "put",
        "parentTitle": "English Lexical",
        "content": "/pʊt/\n(Pronunciation Key: /p/ as in 'pot', /ʊ/ as in 'put', /t/ as in 'top')\n\n1. To move something to a specific location or arrangement.\n2. To express thoughts, ideas, or feelings in written or spoken words.\n3. To impose a condition or responsibility upon someone or something.\n4. To cause someone or something to be in a particular state.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Placement, Expression, Imposition, State Change"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt)\nVerbs: base: put, past simple: put, past participle: put (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'putian' (to push, thrust, put). Its origin is somewhat uncertain but is likely from Proto-Germanic '*pūtōną', signifying a pushing or thrusting action, from which the modern sense of 'to place' evolved."
            },
            {
                "title": "Usage Examples",
                "content": "1. Please put your dirty clothes in the hamper, not on the floor.\n2. She found it difficult to put her complex emotions into simple words.\n3. The manager decided to put a new rule into effect starting next week.\n4. Don't put yourself in danger by walking alone at night."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Put off': To postpone an event or task; also, to discourage or repel someone.\n2. 'Put up with': To tolerate or endure something unpleasant without complaining.\n3. 'Put out': To extinguish a fire; to inconvenience someone; to publish something."
            }
        ]
    },
    {
        "title": "show",
        "parentTitle": "English Lexical",
        "content": "/ʃoʊ/\n(Pronunciation Key: /ʃ/ as in 'she', /oʊ/ as in 'boat')\n\n1. To make something visible or clear; to present for observation.\n2. To demonstrate a quality, emotion, or capability.\n3. To guide or direct someone to a particular place.\n4. A public exhibition or display; a performance.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Display, Demonstration, Guidance, Performance"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi), Noun\nVerbs: base: show, past simple: showed, past participle: shown/showed (irregular, 'shown' is more common for past participle)\nNouns: plural: shows"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'scēawian' (to look at, behold, see), from Proto-Germanic '*skauwōną' (to look at, see). The meaning evolved from 'to look at' to 'to cause to be seen'."
            },
            {
                "title": "Usage Examples",
                "content": "1. She showed me her new painting with pride.\n2. His actions showed a clear lack of respect for authority.\n3. Could you please show me the way to the nearest exit?\n4. We bought tickets to see a live music show tonight."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Show off': To display one's abilities or possessions in an arrogant way.\n2. 'Show up': To arrive at a place; to be noticeable.\n3. 'Show of hands': A vote or indication of opinion by raising hands."
            }
        ]
    },
    {
        "title": "hear",
        "parentTitle": "English Lexical",
        "content": "/hɪər/\n(Pronunciation Key: /h/ as in 'hat', /ɪə/ as in 'near', /r/ as in 'red')\n\n1. To perceive sound with the ear.\n2. To be told or informed of something; to learn news.\n3. To listen to or attend to something.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Perception, Information, Listening"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vt, Vi)\nVerbs: base: hear, past simple: heard, past participle: heard (irregular)"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'hīeran' (to hear, listen, obey), from Proto-Germanic '*hauzijanan' (to hear). Its ultimate origin is Proto-Indo-European '*h₂kows-' (to hear)."
            },
            {
                "title": "Usage Examples",
                "content": "1. I can hear the birds singing outside my window.\n2. Did you hear about the new policy changes at work?\n3. The judge refused to hear the defendant's appeal.\n4. Please speak up, I can't hear you very well."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Hear out': To listen to someone fully without interrupting.\n2. 'Hear, hear!': Used to express agreement with what someone has just said.\n3. 'Haven't heard from': Not to have received communication from someone for a period."
            }
        ]
    },
    {
        "title": "play",
        "parentTitle": "English Lexical",
        "content": "/pleɪ/\n(Pronunciation Key: /p/ as in 'pot', /l/ as in 'love', /eɪ/ as in 'day')\n\n1. To engage in activity for enjoyment and recreation, especially by children.\n2. To take part in a game or sport.\n3. To operate a musical instrument or reproduce recorded music.\n4. A dramatic performance; a theatrical work.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Recreation, Games, Music, Performance"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vi, Vt), Noun\nVerbs: base: play, past simple: played, past participle: played (regular)\nNouns: plural: plays"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'plegian' (to play, sport, move quickly), which is of uncertain origin, possibly from Proto-Germanic '*pleganan'. The sense of 'performing music' developed later."
            },
            {
                "title": "Usage Examples",
                "content": "1. The children love to play in the park every afternoon.\n2. He plays soccer for his school team.\n3. Could you please play my favorite song on the guitar?\n4. We went to see a fantastic play at the local theater."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Play fair': To act justly and according to rules.\n2. 'Play it by ear': To improvise or decide how to deal with a situation as it develops.\n3. 'Play hard to get': To pretend to be unavailable or uninterested to increase one's desirability."
            }
        ]
    },
    {
        "title": "run",
        "parentTitle": "English Lexical",
        "content": "/rʌn/\n(Pronunciation Key: /r/ as in 'red', /ʌ/ as in 'cup', /n/ as in 'net')\n\n1. To move at a speed faster than walking, using one's legs.\n2. To operate or function, often continuously.\n3. To manage or control an organization or system.\n4. A period of running; an act of running; a sustained effort or sequence.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Movement, Operation, Management, Sequence"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vi, Vt), Noun\nVerbs: base: run, past simple: ran, past participle: run (irregular)\nNouns: plural: runs"
            },
            {
                "title": "Etymology",
                "content": "From Old English 'rinnan', 'irnan' (to run, flow, go), from Proto-Germanic '*rinnaną'. The change in the vowel sound for 'run' in modern English (from 'i' to 'u') is likely due to influence from northern dialects."
            },
            {
                "title": "Usage Examples",
                "content": "1. The athlete trained every day to run the marathon.\n2. Make sure the water runs continuously while you're flushing the pipes.\n3. She runs a successful non-profit organization that helps homeless animals.\n4. He scored a home run in the final inning, winning the game for his team."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Run out of': To exhaust one's supply of something; to no longer have something available.\n2. 'Run into': To meet someone unexpectedly; to encounter a problem or obstacle.\n3. 'Run down': To be in poor condition due to lack of maintenance; to criticize someone."
            }
        ]
    },
    {
        "title": "move",
        "parentTitle": "English Lexical",
        "content": "/muːv/\n(Pronunciation Key: /m/ as in 'mat', /uː/ as in 'moon', /v/ as in 'van')\n\n1. To change position or place; to cause to change position.\n2. To affect someone emotionally or to prompt them to action.\n3. To make progress or take action.\n4. An act of moving; a change of position or residence.",
        "details": [
            {
                "label": "Region",
                "type": "text",
                "value": "Common English"
            },
            {
                "label": "Style",
                "type": "text",
                "value": "General"
            },
            {
                "label": "Semantic Fields",
                "type": "text",
                "value": "Motion, Emotion, Progress, Action"
            },
            {
                "label": "Frequency",
                "type": "text",
                "value": "Very common"
            }
        ],
        "sections": [
            {
                "title": "Grammatical Information",
                "content": "Part(s) of speech: Verb (Vi, Vt), Noun\nVerbs: base: move, past simple: moved, past participle: moved (regular)\nNouns: plural: moves"
            },
            {
                "title": "Etymology",
                "content": "From Old French 'movoir' (to move, stir), from Latin 'movēre' (to move, stir, set in motion). This is related to Proto-Indo-European '*meue-' (to push away)."
            },
            {
                "title": "Usage Examples",
                "content": "1. The chess player moved his knight to a strategic square.\n2. The emotional story moved the audience to tears.\n3. We need to move forward with this plan if we want to meet the deadline.\n4. His latest dance move impressed everyone at the party."
            },
            {
                "title": "Idioms and Phrases",
                "content": "1. 'Move on': To leave a place; to continue with something else; to recover from an emotional experience.\n2. 'Move heaven and earth': To do everything possible to achieve something.\n3. 'Make a move': To take action; to begin to leave."
            }
        ]
    }
]