{
  "title": "Stargate: The Ark of Truth",
  "parentTitle": "Stargate",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    }
  ],
  "content": "Stargate: The Ark of Truth is a 2008 American military science fiction film written and directed by Robert C. Cooper. It serves as a sequel to the television series Stargate SG-1 and stars its regular cast. The film picks up after the SG-1 series finale, but happens before the Stargate Atlantis third season finale.\n\nThe Ark of Truth was released direct-to-video on March 11, 2008, by 20th Century Fox Home Entertainment. The Sci-Fi Channel premiered the film on television in the United States on March 27, 2009.\n\nIt is the first of two Stargate SG-1 direct-to-video films, the second one being Stargate: Continuum.",
  "sections": [
    {
      "title": "Plot",
      "content": "While digging on Dakara, SG-1 discovers a box that they believe contains the Ark of Truth, but before they can open it, Ori soldiers arrive, led by Tomin. Daniel tricks them into opening the box, but it is revealed to be a fake. When Tomin is ordered by a Prior to kill them, he refuses, and Mitchell kills the Prior, whose powers were being blocked by the Anti-Prior device. Shocked at the death of their Prior, the Ori soldiers surrender with Tomin returning to Earth with SG-1 where he resides at the SGC for a time.\n\nBack on Earth, General Landry and Mitchell meet James Marrick, an IOA representative sent to interrogate Tomin, because the original IOA representative, Richard Woolsey, is now working for the Atlantis Expedition. When Daniel Jackson realizes that the Ark is still in the Ori galaxy, Marrick is assigned to accompany them on board the Odyssey through the Supergate. In the Ori galaxy, a member of the anti-Ori resistance tells the team that according to legend, the Ark is on Celestis, the Ori capital. When SG-1 beams down to the planet, Marrick activates the Asgard computer core which alerts the Ori to the ship's location.\n\nUpon being alerted by Major Kevin Marks of what is going on, Mitchell and Carter beam back to the Odyssey and discover that Marrick has used the core to build a Replicator, intending to plant it on an Ori ship and let it spread to their entire fleet. When Mitchell attempts to destroy it with an anti-Replicator Gun, the replicator escapes, and Marrick reveals that the IOA removed that weakness from the design, although conventional weapons are sufficient to destroy individual replicators. Marrick implies that a shutdown code has been included as a failsafe, but claims he does not know what it is. He is placed in the ship's brig and falls victim to the Replicators, when they make their way into the brig, resulting in Marrick becoming a Human/Replicator hybrid. With several Ori ships approaching, Mitchell attempts to beam Daniel, Teal'c, Vala, and Tomin up from the planet, but the replicator takes over the system and keeps Mitchell from doing so. With no other option, the Odyssey jumps to hyperspace to escape, leaving the others on the planet.\n\nDaniel finds the Ark in a set of catacombs, and after several ground tremors, brings it to the surface. When the team emerges, they are ambushed by Ori warriors, and Teal'c is shot in the back while the others are captured. When they are brought to the city, Vala discovers that the Ori were indeed killed by the Sangraal during the events of The Shroud. Adria has ascended and taken over all of their power. Teal'c, who has been walking toward the city of Celestis since he was shot, collapses due to his wound within sight of the city. He is subsequently revived by Morgan le Fay and continues on to free Daniel. Morgan then arrives in Daniel's cell (initially in the guise of Merlin) and tells him if he can expose one Prior to the Ark, the others will be turned by a link in their staffs. This will weaken Adria enough for Morgan to stalemate her.\n\nIn the meantime, a Prior arrives on Earth, offering a last chance to convert to Origin. When General Landry refuses to even listen to him, the Apollo detects a fleet of Ori motherships waiting on the edge of the Solar System. On the Odyssey, Marrick is attacked by Replicators who infest his body. In the ensuing battle, Mitchell is able to briefly disable the Replicator connection to Marrick's brain, who then informs Mitchell the shut down code for the Replicators is on the other side of the crystal used to create them. Mitchell activates an explosive charge which kills Marrick. Mitchell informs Carter, who activates the shut-down command, deactivating the Replicators.\n\nWhen the Ark is activated and opened, the Doci is caught by the beam and made to see that the Ori are not gods and spreads this belief to all of the Priors in the Ori galaxy and through them their followers. With Adria now in a weakened state, Morgan is able to engage her in an eternal battle. SG-1 exposes the Prior on Earth to the Ark, transmitting the knowledge about the Ori to all of the Priors in the Milky Way, and thus turning all known Priors in the Universe.\n\nIn the aftermath, Tomin departs for the Ori galaxy as the new leader of his people, he and Vala agreeing that, while the Ori were liars, Origin itself has a worthwhile message. Tomin asks Vala to come with him, but Vala apologizes and says that she feels her place is with the SGC. Over Daniel's objections the Ark is taken to Area 51 for study while SG-1 later prepare for another new mission through the Stargate."
    },
    {
      "title": "Cast",
      "content": "\n * Ben Browder as Lieutenant Colonel Cameron Mitchell\n * Amanda Tapping as Lieutenant Colonel Samantha Carter\n * Christopher Judge as Teal'c\n * Michael Shanks as Dr. Daniel Jackson\n * Beau Bridges as Major General Henry “Hank” Landry\n * Claudia Black as Vala Mal Doran\n * Currie Graham as James Marrick\n * Morena Baccarin as Adria\n * Tim Guinee as Tomin\n * Julian Sands as Doci\n * Sarah Strange as Morgan le Fay\n * Michael Beach as Colonel Abe Ellis\n * Gary Jones as Chief Master Sergeant Walter Harriman\n * Martin Christopher as Major Kevin Marks\n * Chris Gauthier as Hertis\n * Eric Breker as Colonel Reynolds\n * Matthew Walker as Merlin\n * Fabrice Grover as Amelius\n * Spencer Maybee as Captain Binder"
    },
    {
      "title": "Production",
      "content": "This movie is the conclusion of Stargate SG-1 Ori arc, which began in the season nine episode \"Avalon\". Stargate: The Ark of Truth is the story that Cooper originally planned as a five- or six-episode arc to begin at the end of Season Ten and beginning of Season Eleven, but the series was canceled by the Sci-Fi Channel in August 2006. The intended ending for the Tenth Season was to introduce the concept of the Ark of Truth, an artifact for which SG-1 is searching. As the story progresses, SG-1 would learn that this device is in the Ori galaxy and could be helpful in diverting the Ori warriors from their crusade. The Odyssey would have brought them through the Supergate to the Ori galaxy. However, the Sci Fi Channel wanted the series to be concluded, and the producers neither had the time nor the will to do that and went with the idea of what would become \"Unending\", the SG-1 series finale. The movie's storyline picks up after \"Unending\", but takes place before the fourth season of Stargate Atlantis.\n\nAccording to Robert C. Cooper, the film had higher production values than episodes of the television series. The production budget was $7 million. The film was shot in a 16:9 aspect ratio on 35mm film. Joel Goldsmith produced an orchestral score for the film, rather than a synthetic score as he did for episodes of the series.\n\nIn addition to wrapping up the Ori storyline, this film was also intended as a transition into an ongoing series of films centered around the SG-1 characters. Certain scenes were shot concurrently with that of the second film, Stargate: Continuum. According to the DVD commentary, a tease leading into that film was planned to be included at the end of Stargate: The Ark of Truth, but was ultimately dropped as it was felt that this film had \"too many endings.\"\n\nThe movie went into production in April 2007."
    },
    {
      "title": "Release",
      "content": "A pre-release (workprint) version of the film with unfinished special effects, no credits and recorded in cropped 16:9 was leaked onto the Internet in mid-December 2007."
    },
    {
      "title": "Home media",
      "content": "The Ark of Truth was released as a Region 1 DVD release on March 11, 2008. Sky One broadcast the film on March 24, 2008, to be followed by the Region 2 DVD release on April 14, 2008. The DVD was released in Australia on April 9, 2008. The DVD includes an audio commentary with Robert C. Cooper, Peter Woeste and Christopher Judge, a 30-minute behind-the-scenes program, highlights from the 2007 Comic-Con Stargate panel and a nine-minute summary of the Ori storyline from seasons nine and 10.\n\nThe DVD release of Stargate:The Ark of Truth in the U.S. earned MGM/Fox US $1.59 million in rentals in the first week after the release, and another US $1.38 million in rentals in the second week. In its third week it earned US $1.19 million in rentals totaling US $4.16 million. The DVD has also earned US $9.0 million in sales."
    }
  ]
}