{
  "title": "Stargate: Continuum",
  "parentTitle": "Stargate",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    }
  ],
  "content": "Stargate: Continuum is a 2008 American military science fiction film directed by Martin Wood and written by Brad Wright. It is the second sequel to the television series Stargate SG-1, following The Ark of Truth (2008). The film stars the main cast of the series' last season, with the return of Richard Dean Anderson as Jack O'Neill.\n\nThe film is a time-travel adventure in which Ba'al travels back to 1939 to create an alternate timeline in which Earth never establishes their Stargate Program, and to take control of the Goa'uld Empire. As the only people to remember the truth, the SG-1 team attempts to reinstate the original timeline.\n\nContinuum was released direct-to-video on July 29, 2008, by 20th Century Fox Home Entertainment. The Sci-Fi Channel premiered the film on television in the United States on April 3, 2009.",
  "sections": [
    {
      "title": "Plot",
      "content": "SG-1 and Jack O'Neill attend a Tok'ra extraction ceremony for Ba'al, the last of the Goa'uld System Lords. Ba'al claims, however, that he is merely the last clone and that the real Ba'al has a fail-safe plan. The real Ba'al travels back in time to 1939 Earth and massacres the crew of the Achilles, the ship carrying the Stargate to the United States. The captain of the Achilles lives long enough to drop the bomb Ba'al left overboard and keep the ship from being destroyed. In the present, people and objects start disappearing, including Vala Mal Doran and Teal'c. Jack is killed by the clone, but Samantha Carter, Daniel Jackson and Cameron Mitchell reach the Stargate. They are surprised to emerge inside the derelict Achilles, which has drifted to the Arctic — Ba'al's actions have created a timeline in which the Stargate Program never happened. After escaping from the sinking Achilles, they are rescued by a team led by Colonel Jack O'Neill. Although General Landry believes their story (after intensive interrogation), they are denied permission to change the timeline. In the alternate timeline, Daniel is still trying to convince people about his theories of the pyramids, Carter died in a space shuttle accident and Mitchell does not exist at all because his grandfather was the Achilles captain. The three are forced by the authorities to lead separate lives, with no contact allowed between them.\n\nA year passes, and SG-1 is called back into action when Goa'uld scoutships appear. Ba'al has brought the other System Lords under his control and now stands ready to conquer Earth, with Qetesh, still residing in Vala's body, as his queen and Teal'c as his First Prime. SG-1 is brought to President Henry Hayes and General George Hammond, who inform them that, based on SG-1's accounts, they have recovered the Antarctic Stargate and are excavating the Antarctic Ancient outpost to reach the weapon that saved Earth in the original timeline. SG-1 is sent in F-15s to McMurdo Station to gate to Proclarush Taonas, another Ancient outpost, to retrieve a Zero Point Module to power the Antarctic outpost.\n\nAbove Earth, Ba'al's armada arrives. To the displeasure of his subordinates, the other System Lords, Ba'al announces that he will treat the Tau'ri relatively leniently. Suspicious about Ba'al's thorough knowledge of Earth, Qetesh betrays him and forces him to tell her everything. She orders the destruction of McMurdo and the Ancient outpost in Ba'al's name, but she kills Ba'al when Teal'c discovers what she is doing. As Teal'c escapes to an Al'kesh, Qetesh orders the fleet to bombard Earth, while she goes to secure Ba'al's time machine.\n\nWhen the Goa'uld destroy the Antarctic Stargate, SG-1 is rerouted to Russia, as the Russians had retrieved the Achilles' Stargate from the ocean floor. Teal'c arrives at the facility as well, seeking to use the Stargate to reach the time machine before Qetesh. The two sides agree to a truce and get to Ba'al's time machine: an underground supercomputer connected to hundreds of satellites that monitor solar flares from various stars that could intersect a wormhole created by the Stargate; the flares are necessary for time travel. SG-1 must wait for the right flare in order to journey to the right time, but when Qetesh's troops attack, they are forced to dial the Stargate to the year 1929 - ten years before their desired target date. Sam and Daniel are killed in the firefight, and only Mitchell passes through the Stargate. Teal'c, mortally wounded, blows himself and Qetesh up. After a decade of waiting, Mitchell stows away on the Achilles and kills Ba'al and his troops when they come aboard through the Stargate.\n\nIn the now-restored timeline, SG-1, completely unaware of the previous events, watch the extraction proceed without incident. On Earth, Daniel wonders what Ba'al meant by his fail-safe."
    },
    {
      "title": "Cast",
      "content": "\n\n\n * Ben Browder as Colonel Cameron \"Cam\" Mitchell and Mitchell's grandfather, the captain of the Achilles\n * Amanda Tapping as Colonel Samantha \"Sam\" Carter\n * Christopher Judge as Teal'c\n * Michael Shanks as Dr. Daniel Jackson\n * Claudia Black as Vala Mal Doran and Qetesh\n * Beau Bridges as Major General Henry \"Hank\" Landry\n * Richard Dean Anderson as Major General (& Colonel) Jonathan \"Jack\" O'Neill\n * Cliff Simon as Ba'al\n * Peter Williams as Apophis\n * Jacqueline Samuda as Nirrti\n * Don S. Davis as Lieutenant General George Hammond\n * William Devane as President Henry Hayes"
    },
    {
      "title": "Production",
      "content": "Stargate: Continuum was written by Brad Wright and directed by Martin Wood. Some scenes for this film were already shot at the end of March 2007, but the original start date was set for May 22, 2007 at Vancouver's Bridge Studios. The production budget was US$7 million (equivalent to about $M in ). Due to the postponement of this film until the 5th season of Stargate Atlantis was airing, there is a continuity error with Carter and Mitchell's rank. In the ending credits they are listed as lieutenant colonels. However, when they fly the F-15s they are each wearing the rank of colonel. This is due to the fact that during filming producers realized that the film would probably be released after Carter had been promoted on Atlantis. In the season 5 premiere of that show, Sam, already a colonel, leaves Atlantis to attend the extraction, thus setting this film about a year after Stargate: The Ark of Truth.\n\nThe original draft for the film started with a view of the Tok'ra city, but Brad Wright eventually decided that the film should start in Stargate Command (SGC) to show what SG-1 represented. When writing lines for the character Jack O'Neill, Wright tried to write lines that felt \"natural\" and not \"forced,\" saying it was of major importance. Many recurring characters from the series Stargate SG-1 were included to make old fans feel more \"welcome\" to the new film. The unnamed Captain of the Achilles' dead body was originally supposed to be revealed when SG-1 travelled back to Earth; Wright commented on the case, calling it \"gross\". Richard Dean Anderson was not supposed to appear at the start of the film, where he was killed. According to Wright, he was only set to appear in the alternate timeline in Antarctica because that's what Wright \"asked him to do.\"\n\nDue to a scheduling conflict, actor Michael Shanks was unavailable to shoot the scenes in the Arctic. However, Jackson was on the boat with Cameron Mitchell and Samantha Carter in the preceding scenes. In order to make his disappearance plausible, Wright decided that Jackson would develop frostbite after stepping in water and be unable to continue with the others. When commenting on the dialogue scenes, Wright commented that scenes like that would be \"cut off\" because of the time constraints in the Stargate SG-1 and Atlantis episodes, and further commented that they could keep these scenes since the film is \"longer\" than the episodes.\n\nThe film includes scenes filmed at the U.S. Navy's Applied Physics Laboratory Ice Station in the Arctic, 200 nmi north of Prudhoe Bay, Alaska. These scenes feature Richard Dean Anderson, Amanda Tapping and Ben Browder. They were filmed from March 23 to 29, 2007. The film also features USS Alexandria (SSN-757). The Arctic filming included scenes shot on the ice, scenes shot with the Alexandria as a backdrop, scenes shot on board the Alexandria, and shots of the Alexandria surfacing and submerging. Because of the minimal facilities, the Arctic scenes were filmed with only the three actors and a four-man crew. Director Martin Wood worked as an extra in one scene (as \"Major Wood\"), as did another member of the film crew. The captain of the Alexandria, Cmdr. Mike Bernacchi, and members of her crew played themselves. Barry L. Campbell, head of operations at the San Diego–based U.S. Navy Arctic Submarine Laboratory, who had arranged the opportunity to film in Arctic, also appeared as a seaman. Writer Brad Wright also had a cameo appearance, as an F-15 pilot.\n\nThe film is dedicated to the memory of Paul McCann and Anthony Huntrod, who lost their lives during an accident under the ice cap on the submarine HMS Tireless (S88) at the time of filming. The film took 19 days to shoot, plus five days of shooting in the Arctic (they were there for seven days). Continuum was placed in the Guinness World Records in the category for farthest north film shoot. This film also contained the final scenes filmed by actor Don S. Davis who died on June 28, 2008, about one month before the film's release. He was later honored in Stargate Universe by having the ship named for his character George Hammond commanded by Samantha Carter."
    },
    {
      "title": "Release",
      "content": "The film premiered at San Diego Comic-Con on July 25, 2008, attended by the cast. The film was released on both DVD and Blu-ray Disc on July 29, 2008. The film was also released on August 6, 2008 in Australia and was released in the United Kingdom on August 18, 2008 after being broadcast on the British TV channel, Sky1 on August 12. On its debut in the United Kingdom and Ireland Stargate: Continuum received 543,000 viewers, placing the film first in the top ten broadcasts for Sky One. The film would go on to gross over US$8 million in the United States. The film premiered on Sci-Fi Channel in the US on April 3, 2009."
    },
    {
      "title": "Critical response",
      "content": "A reviewer for Sky1 called the film a \"thoroughly enjoyable romp.\" Nix from Sci Fi Cool said in his review, \"it ends exactly the same way that most, if not all, SG1 episodes usually end: It leaves you satisfied, and wanting more.\" Reviewer Christopher Monfette of IGN gave the film 7 out of 10 and said it was a decent film, but ultimately did not meet the \"level of great science fiction\". Don Houston from DVD Talk commented that the \"budget was too low\" for the writers to \"support the ideas at hand\". Mark Wilson from About.com said the film was just another way for the producers to return to some of their favorite characters, but concluded that it was a \"solid\" film. Darren Sumner and David Read from GateWorld called it a \"great movie\", and said it was even better than Stargate: The Ark of Truth. Dean Winkelspecht said it was \"one of the better direct-to-video\" releases that year.\n\nStargate: Continuum won the High-Def Disc Awards 2008 category for Best Nontheatrical Blu-ray. The film was nominated for 6 Constellation Awards in 2008, the results were announced on July 11, 2009. The film won one award out of six nominations. Claudia Black received the award for \"Best Female Performance in a 2008 Science Fiction Film, TV Movie, or Mini-Series\" for her portrayal of Vala Mal Doran. The film was also nominated for a total of 11 Leo Awards in 2009. The results were announced on May 8 and 9, 2009, the film won three awards: Brad Wright won in the category \"Best Screenwriting in a Feature Length Drama\", Michael Shanks won \"Lead Performance by a Male in a Feature Length Drama\" for his portrayal of Daniel Jackson and the three production crew members Paul Sharpe, Iain Pattison and Graeme Hughes won \"Best Overall Sound in a Feature Length Drama\".\n\nThe two Stargate direct-to-DVD movies to date, Stargate: Continuum and Stargate: The Ark of Truth, were re-released in the United States as a Double-Pack DVD on March 3, 2009; the Double-Pack is also available on Blu-ray. A third Stargate SG-1 film to follow Continuum has been permanently shelved. If made, it would have reportedly centered on the character of Jack O'Neill and would be titled Stargate: Revolution."
    },
    {
      "title": "Accolades",
      "content": "In 2009, Stargate: Continuum was nominated for 11 Leo awards and won three of them."
    }
  ]
}