{
  "title": "Stargate Infinity",
  "parentTitle": "Stargate",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Created By",
      "value": "Eric Lewald\n\nMichael Maliani"
    },
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "France United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    },
    {
      "type": "number",
      "label": "No. of Seasons",
      "value": 1
    },
    {
      "type": "number",
      "label": "No. of Episodes",
      "value": 26
    }
  ],
  "content": "Stargate Infinity, often abbreviated as SGI or just Infinity, is an animated science fiction television series co-produced by Les Studios Tex S.A.R.L. and DIC Entertainment Corporation, in association with MGM Television Entertainment as part of Metro-Goldwyn-Mayer's (MGM) Stargate franchise, but is not considered official Stargate canon. The show was created by Eric Lewald and Michael Maliani, as a spin-off series of Stargate SG-1, which was created by Brad Wright and Jonathan Glassner in 1997 after the release of the original film, Stargate (1994) by Dean Devlin and Roland Emmerich. The animation had a low viewership rating and poor reception; it was cancelled after just one season.\n\nThe story arc of Stargate Infinity follows Gus Bonner being framed for opening the Stargate for alien enemies in a future version of Stargate Command (SGC). Bonner escapes with a group of fresh recruits through the Stargate. The team cannot return to Earth before they have cleared their names. The show was cancelled before any of its major plots could be resolved. The story unfolds when the members of the team encounter different alien races from other planets.",
  "sections": [
    {
      "title": "Series overview",
      "content": "The executive producers for the show were Andy Heyward and co-creator Michael Maliani. Will Meugniot was supervising director, and as of the series' cancellation, only three directors directed the 26-episode series. Mike Piccirillo wrote the music which he and Jean-Michel Guirao performed. The show often featured an educational comment or summary about the moral lessons learned during the course of an episode.\n\nThe writers and producers of Stargate SG-1 and the main canon of the Stargate franchise were not involved with Infinity, and neither MGM, the production teams nor the fans of Stargate consider Infinity to be an official part of the Stargate universe. According to Stargate SG-1 co-creator Brad Wright, the animated series should not be considered official Stargate canon, as he said that he was not involved in the production."
    },
    {
      "title": "Cast and characters",
      "content": "Stargate Infinity is set 30 years into the future and follows Gus Bonner and his team. Bonner's team was created after he was framed for a crime he did not commit. He escaped from Stargate Command (SGC) after the hostile alien race Tlak'kahn attacked the SGC to steal a mysterious alien chrysalis that was recently unearthed in Egypt. Together with his team, Gus escapes through the Stargate with the chrysalis. From that point forward they go visit planet to planet until they find the evidence to clear their names while learning about the unique cultures in the galaxy, so that they can one day return to Earth. The story arc was never resolved because of low viewership ratings and the show was cancelled in 2003.\n * (voiced by Dale Wilson) – a former SG team veteran who was framed for disobeying orders and sending his men into an ambush, resulting in many of his soldiers dying or critically wounded. After the Tlak'kahn attack the facility, Gus escapes and leads a team of youngsters through the Gate to clear their names and prevent the Tlak'kahn from tormenting other sentient lives.\n * (voiced by Tifanie Christun) – Gus Bonner's niece, an SGC recruit first seen in the Gate room when the hostile alien race Tlak'kahn attacks the SGC to find the chrysalis. She thinks Gus is a traitor for opening the Stargate for the Tlak'kahn, and frequent confronts him about it, despite his denying any involvement in it.\n * (voiced by Bettina Bush) – a Native American who has different visions which helps the team to get out of harm's way. She has a telepathic connection with Draga, and could feel it when she is moved or in harm's way. She escaped with the others through the Stargate during the attack.\n * (voiced by Mark Hildreth) – a sarcastic youngster who recently graduated from the academy and a member of Bonner's team. He escapes with him through the Stargate with the chrysalis in order to get it out of harm's way. He tends to flirt with any beautiful female being he sees and provides comic relief in the series.\n * (voiced by Kathleen Barr) – an alien newborn who emerges from the chrysalis. Draga is a being that is believed to have been an Ancient. She is born in the first episode and has strange, possibly unlimited powers over which she has little control. In one episode, the team visited a race of aliens who resembled her, but treated those of their race who couldn't fly like nonentities. She was given the chance to learn more, but realised she belonged with her friends. Draga is very curious and kind and often seems childlike in her innocence although this diminished noticeably throughout the series.\n * (voiced by Cusse Mankuma) – a friendly half-alien and an SGC cadet. He can fix anything with whatever is lying around. He joins the others to rescue the chrysalis. There are theories that he might in fact be the true Ancient, but due to the series cancelling before any real plot change occurred, this was never confirmed.\n * (voiced by Mark Acheson) – a violent alien commander who is the leader of the Tlak'kahn. He is allied to the shapeshifter Nephestis to capture alien creatures for reasons unknown. He obeys Nephestis's request to kill the Stargate crew in order to keep them from exposing both of their plans.\n * (voiced by Mackenzie Gray) – a Tlak'kahn warrior and subordinate to Da'Kyll.\n * (voiced by Lee Tockar) – a manipulative, treacherous shapeshifter who primarily takes the form of a Stargate high-ranking member by the name of Arnold Grimes. He is the one responsible for framing Gus Bonner of disobeying orders and leading his men to an ambush that killed them. He is also the one who closed the Stargate's access to Earth so that he could secure his plan, and sent Da'Kyll out to hunt them down."
    },
    {
      "title": "Broadcast",
      "content": "Stargate Infinity premiered in September 2002 as part of 4Kids Entertainment’s FoxBox Saturday morning line-up on Fox, where it aired until March 2003. The series would eventually be one of the launching programmes on the Syndicated DIC Kids Network E/I block, and would later air on the Cookie Jar Toons block on This TV until September 25, 2011.\n\nIn the show's home country of France, the series originally premiered on Disney Channel on March 8, 2003 and later aired on M6's M6 Kid block on August 30.\n\nMetro-Goldwyn Mayer handles the rights of the show internationally (except in French territories), while WildBrain handles North America and French territories rights."
    },
    {
      "title": "Home releases",
      "content": "In October 2003, Sterling Entertainment released a VHS/DVD called \"The Adventure Begins\", which contains the episodes \"Decision\", \"Double Duty\" and \"The Best World\", with \"Who Are You?\" as a DVD exclusive episode. The DVD was reissued by NCircle Entertainment in 2007. In May 2008, Shout! Factory released the complete series on a four-disc boxset, containing all 26 episodes and bonus features.\n\n20th Century Fox Home Entertainment and MGM Home Entertainment released a DVD set on August 13, 2007 in the United Kingdom. This DVD, despite being called \"Volume 1\", contains all 26 episodes of the series, with English, Italian and German audio.\n\nAs of 2018, Stargate Infinity has yet to be released on DVD in Region 4, namely Oceania and Latin America.\n\nThe series was released onto Amazon Prime Video in some European territories in 2023 as part of their MGM channel."
    },
    {
      "title": "Reception",
      "content": "Due to its lack of popularity, the series went under the radar, and was cancelled before any of its story arcs could be resolved. The show was of low budget, which was constantly noted by the media."
    }
  ]
}