{
  "title": "Stargate Origins",
  "parentTitle": "Stargate",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Created By",
      "value": "Mark Ilvedson\nJustin Michael Terry"
    },
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    },
    {
      "type": "number",
      "label": "No. of Seasons",
      "value": 1
    },
    {
      "type": "number",
      "label": "No. of Episodes",
      "value": 10
    }
  ],
  "content": "Stargate Origins (abbreviated as SGO) is an American science fiction adventure web miniseries created and written by Mark Ilvedson and Justin Michael Terry, part of the Stargate franchise. It premiered with the first three episodes on February 15, 2018 on MGM's Stargate Command subscription service, and concluded with the release of the last three episodes on March 8, 2018.\n\nThe program is a prequel to the other works in the franchise, taking place in 1939, some decades before the events of the 1994 Stargate film and its subsequent sequel series. It follows a young Catherine Langford (a minor character from the 1994 film and Stargate SG-1), who goes through the Stargate in a quest to save her father.\n\nThe series was announced on July 20, 2017 at the 2017 San Diego Comic-Con as part of Stargate SG-1's 20th anniversary celebration. It consists of ten episodes, each 10 minutes in length. The episodes were concatenated together into a 104-minute-long standalone film, a \"Feature Cut\" entitled Stargate Origins: Catherine. That film was released on June 19, 2018 on digital retail outlets around the world in SD, HD, and 4K formats.",
  "sections": [
    {
      "title": "Plot",
      "content": "A young Catherine Langford embarks on an adventure to unlock the mystery of the Stargate. In 1938, Catherine and her father examine the gate at a warehouse near Giza. Nazi cultist Wilhelm Brücke arrives with his team and takes them hostage. He reveals that he knows how to use the gate, and forces Professor Langford to go through the gate with them. Catherine overpowers her guard and seeks the help of her friends Captain James Beal and Wasif, an Egyptian serving in the British army, convincing them to go through the gate with her to rescue her father.\n\nThey arrive in a temple, in a desert on planet Abydos. It is controlled by Aset, a demi-god, who was resurrected by Ra, but is now rebelling against him. There, they fight with Aset's female guard Serqet before meeting a young native named Kasuf. Catherine tries to activate the Stargate to return home, but lacks the right combination of symbols on the dial-up device. Brücke shows Aset a Nazi propaganda film and makes a deal with her that he will take powerful metal, named Naquadah, back to Earth in exchange for thousands of slaves, \"undesirables\" to the Nazi regime, for her fight to overthrow Ra. Aset alienates the local tribesmen, her faithful servants and demands one of them fight Brücke's soldier, Stefan to death to \"prove their worth\". After Stefan is close to defeat, Brücke kills him and the local man fighting him. This causes Eva, Brücke's camera operator, to question the morality of her boss.\n\nBefriended by the native tribesmen, Catherine is taken to a hidden cave and shown the symbols which activate the stargate from that end. Encouraged by Langford who has been interpreting, Aset breaks with Brücke, who is killed by Eva, takes pity on Langford and Catherine, and wipes their memories. She also brainwashes Kasuf to return to his people as their new leader and Catherine to assemble a team of people who will return to the planet and overthrow Ra. Ra, informed by Serqet about Aset's defiance (including her illegal harcesis child), arrives, sends Serqet to capture Catherine and her father, brainwashes Wasif and his Abydonian friend Motawk to become his guards, and destroys the temple together with Aset. Captain Beal activates the Stargate and sends both Professor Langford and Catherine back home, but is killed by Serqet.\n\nBack on Earth and having no memory of their adventures since before the Nazis arrived, Langford and Catherine wrap up their investigation of the Stargate as the US takes possession of it. Catherine wonders about the nugget of strange metal in her possession and knows she'll be dealing with the Stargate again."
    },
    {
      "title": "Cast",
      "content": "\n * Ellie Gall as Catherine Langford\n * Connor Trinneer as Professor Paul Langford, father of Catherine and the man who found the Stargate at a dig at Giza.\n * Aylam Orian as Dr. Wilhelm Brücke, the high-ranking Nazi officer, occultist and series main antagonist.\n * Philip Alexander as Captain James Beal, British officer stationed in Egypt.\n * Shvan Aladdin as Wasif, a native Egyptian and a lieutenant in the British army.\n * Daniel Rashid as Kasuf\n * Salome Azizi as Aset\n * Michelle Jubilee Gonzalez as Serqet\n * Sarah Navratil as Eva Reinhardt\n * Tonatiuh as Motawk\n * Derek Chariton as Heinrich\n * Justin Michael Terry as Gunter\n * Lincoln Werner Hoppe as Stefan\n * Ghadir Mounib as Renisenb"
    },
    {
      "title": "Production",
      "content": "Stargate Origins series of 10 episodes was announced by MGM at ComiCon July 2017 in conjunction with the new streaming service, Stargate Command, that the series' broadcast home. The series would feature the Catherine Langford character and would be produced by MGM's Digital Group and New Form, who would also handle development and production. Filming was planned to start in August 2017. By August 2018, MGM's Digital Group had formed United Artists Digital Studios to produce shows such as Stargate Origins."
    },
    {
      "title": "Episodes",
      "content": "The first three episodes were released on Stargate Command streaming service on February 15, 2018, while the last three debuted on March 8, 2018.\n\nIn March 2018, a \"Feature Cut\" of the series was announced, which would compile all episodes into a feature-length film. This feature-length film was titled Stargate Origins: Catherine (2018)."
    }
  ]
}