{
  "title": "Star Trek: Discovery",
  "parentTitle": "Star Trek",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Created By",
      "value": "Bryan Fuller\n\nAlex Kurtzman"
    },
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    },
    {
      "type": "number",
      "label": "No. of Seasons",
      "value": 5
    },
    {
      "type": "number",
      "label": "No. of Episodes",
      "value": 65
    }
  ],
  "content": "Star Trek: Discovery is an American science fiction television series created by Bryan Fuller and Alex Kurtzman for the streaming service CBS All Access (later rebranded as Paramount+). It is the seventh Star Trek series and was released from 2017 to 2024. The series follows the crew of the starship Discovery beginning a decade before Star Trek: The Original Series in the 23rd century. At the end of the second season, they travel to the 32nd century which is the setting for subsequent seasons.\n\nSonequa Martin-Green stars as Michael Burnham, a science specialist on Discovery who eventually becomes captain. Doug Jones, Shazad Latif, Anthony Rapp, Mary Wiseman, Jason Isaacs, Wilson Cruz, Anson Mount, David Ajala, Rachael Ancheril, Blu del Barrio, Tig Notaro, and Callum Keith Rennie also have starring roles across the five seasons.\n\nThe series was announced in November 2015 as the first Star Trek series since Star Trek: Enterprise concluded in 2005. It was produced by CBS Studios in association with Secret Hideout and Roddenberry Entertainment. Fuller was initially set as showrunner but left due to creative differences with CBS. He was replaced by Gretchen J. Berg and Aaron Harberts, with producing support from Akiva Goldsman for the first season. Berg and Harberts were fired by CBS during production on the second season. Kurtzman took over as showrunner and was joined by Michelle Paradise starting with the third season. Discovery features more serialized storytelling than previous Star Trek series but became more episodic in later seasons. Filming took place at Pinewood Toronto Studios in Toronto, Canada, and existing franchise designs were reinvented with modern techniques and visual effects.\n\nStar Trek: Discovery premiered on September 24, 2017, on CBS and CBS All Access. The rest of the 15-episode first season was released weekly on All Access until February 2018. The 14-episode second season was released on All Access from January to April 2019, and the 13-episode third season ran from October 2020 to January 2021. The 13-episode fourth season was released on Paramount+ from November 2021 to March 2022, and the 10-episode fifth and final season was released from April to May 2024.\n\nThe series' release led to record subscriptions for CBS All Access and it became the most viewed original series on both All Access and Paramount+. It has received positive reviews from critics, who highlighted Martin-Green's performance and the time-jump to the 32nd century, as well as numerous accolades including two Primetime Creative Arts Emmy Awards for its prosthetic makeup and visual effects. The series began an expansion of the Star Trek franchise, including the companion shorts series Star Trek: Short Treks, spin-off series Star Trek: Strange New Worlds, and spin-off film Star Trek: Section 31. Various tie-in media and two official aftershows have also been produced based on the series.",
  "sections": [
    {
      "title": "Premise",
      "content": "The series begins around ten years before the events of Star Trek: The Original Series, when Commander Michael Burnham's actions start a war between the United Federation of Planets and the Klingon Empire. She is court-martialed, stripped of rank, and reassigned to the USS Discovery, which has a unique means of propulsion called the \"Spore Drive\". After an adventure in the Mirror Universe, Discovery helps end the Klingon war. In the second season they investigate seven mysterious signals and a strange figure known as the \"Red Angel\", and fight off a rogue artificial intelligence. This conflict ends with the Discovery traveling to the 32nd century, more than 900 years into their future.\n\nThe USS Discovery finds the Federation fragmented in the future, and investigates the cause of a cataclysmic event known as the \"Burn\" in the third season. Burnham is promoted to captain of Discovery at the end of the season, and in the fourth season the crew helps rebuild the Federation while facing a space anomaly created by unknown aliens that causes destruction across the galaxy. In the fifth season, the Discovery goes on a galactic adventure to find a mysterious ancient power that other dangerous groups are also searching for."
    },
    {
      "title": "Cast and characters",
      "content": "A science specialist on the USS Discovery who is promoted to captain at the end of the third season. Burnham is a human who was raised following Vulcan culture and traditions by Sarek, making her the adopted sister of well-known Star Trek character Spock; the reason Spock does not mention Burnham in other Star Trek media is explained in the second season. A non-captain protagonist was chosen to give the series a different perspective from previous Star Trek series, but the writers always knew that she would become captain eventually. Despite her logic-based Vulcan upbringing, Burnham has a rebellious side that she retains even as she becomes more vulnerable throughout the series. Co-creator Bryan Fuller chose to give the character a traditionally male name as he had also done with the female leads on three of his previous series. First officer of the USS Discovery who becomes captain for the third season. Saru is the first Kelpien to enter Starfleet. A new species created for Discovery, Kelpiens were hunted as prey on their home planet and thus evolved the ability to sense the coming of danger. Prosthetics are used to portray Saru, and initially took more than three hours to apply to Jones each day of filming. Jones based Saru's walk on that of a supermodel, out of necessity due to the boots he wore to portray the character's hooved feet. The producers compared Saru to the characters Spock and Data from previous Star Trek series. Voq, an albino Klingon, undergoes extensive surgery to pose as the human Ash Tyler. He becomes chief of security for Discovery, and starts a relationship with Burnham. Voq's accent is Arabic-inspired, and Latif tried to maintain a \"pharyngealness\" to Tyler's American accent. To conceal from the audience that Voq and Tyler were played by the same actor, Latif was credited under the pseudonym \"Javid Iqbal\" for some of his appearances as Voq in the first season. For the second season, Latif felt he was playing a third character that melded Voq and Tyler in a similar way to Bruce Banner and the Hulk in Marvel Comics. Chief engineer aboard Discovery and a science officer specializing in astromycology (the study of fungi in space) who developed Discovery's experimental organic propulsion system (the \"Spore Drive\"). The character is inspired by a real-life mycologist of the same name. He is the first openly gay character in a Star Trek series. Rapp acknowledged that Hikaru Sulu is portrayed as gay in the film Star Trek Beyond (2016), calling that a \"nice nod\", but said the series would actually explore Stamets and his partner \"in conversation, in our living quarters; you get to see our relationship over time, treated as any other relationship would be treated\". An ensign aboard Discovery who works under Stamets and is initially Burnham's roommate. The character was intended to represent people at the bottom of the Starfleet hierarchy, and season one co-showrunner Aaron Harberts said she was the \"soul\" of the series. She is temporarily promoted to first officer by Saru in the third season, and chooses to leave the ship in the fourth to become a teacher at Starfleet Academy. Captain of the Discovery in the first season who was described as a \"brilliant military tactician\". Isaacs said the character was \"probably more fucked up than any of\" the previously seen Star Trek captains. He plays the character with a slight southern U.S. accent, and initially ad-libbed the catchphrase \"git'r done\" before the writers pointed out that it was already widely used and copyrighted by Larry the Cable Guy. Medical officer aboard Discovery and Stamets' husband. Cruz said portraying the first openly gay couple in Star Trek was \"a long time coming\" and praised the subtle way that the series explored their relationship. The character is killed in the first season, but returns from the dead in the second and subsequently goes through post-traumatic growth. He becomes an advocate for the mental health of the crew in the third season. Captain of the Enterprise who takes temporary command of the Discovery in the second season. Mount described Pike as \"very by-the-book\" and a good person, while executive producers Heather Kadin and Alex Kurtzman said he was the opposite of Lorca with \"enough confidence and authority to apologize when he is wrong\". Mount did not try to imitate original Pike actor Jeffrey Hunter's performance from The Original Series. The first person that Burnham meets in the 32nd century, Book helps introduce the third season's new future setting. He is a \"courier\", an independent trader, and becomes a love interest for Burnham that the writers hoped would bring out new sides to her character in contrast to her tumultuous relationship with Ash Tyler in the previous seasons. The producers took inspiration from Star Wars character Han Solo for Book, especially for his costumes. The character has a pet cat named Grudge who is portrayed by two Maine Coons, Leeu and Durban. They are 40 in long and weigh 18 lb. A former Enterprise crewmember who becomes chief of security for Discovery in the second season. Nhan leaves the ship in the third season during the 32nd century. A human bonded with a Trill symbiont. Adira is the first openly non-binary character to feature in a Star Trek series, and the writers worked with del Barrio and LGBTQ media monitoring organization GLAAD when developing the character due to there being no non-binary writers on the series. Adira and their transgender boyfriend Gray (portrayed by Ian Alexander) form a \"family unit\" with Stamets and Culber in later seasons. An engineer who joins Discovery in the second season. Notaro was a long-time friend of Kurtzman's when he asked her to join the series as comedic relief. The character was originally called Denise Reno, but she was able to change the name and chose \"Jett\" for singer Joan Jett. To accommodate Notaro's busy schedule of stand-up comedy and other projects, she filmed her scenes from different episodes at the same time. A war-time Starfleet captain struggling to adjust to peace. Rayner is a Kellerun, a species that previously only appeared in the Star Trek: Deep Space Nine episode \"Armageddon Game\".\n * Sonequa Martin-Green as Michael Burnham:\n * Doug Jones as Saru:\n * Shazad Latif as Voq / Ash Tyler (seasons 1–2):\n * Anthony Rapp as Paul Stamets:\n * Mary Wiseman as Sylvia Tilly:\n * Jason Isaacs as Gabriel Lorca (season 1):\n * Wilson Cruz as Hugh Culber:\n * Anson Mount as Christopher Pike (season 2):\n * David Ajala as Cleveland \"Book\" Booker (seasons 3–5):\n * Rachael Ancheril as Nhan (seasons 2–5):\n * Blu del Barrio as Adira Tal (seasons 3–5):\n * Tig Notaro as Jett Reno (seasons 2–5):\n * Callum Keith Rennie as Rayner (season 5):"
    },
    {
      "title": "Announcement",
      "content": "On November 2, 2015, CBS announced that a new Star Trek television series would premiere in January 2017, \"on the heels\" of the 50th anniversary of Star Trek: The Original Series in 2016. This was the first Star Trek series since Star Trek: Enterprise concluded in 2005, and the first series to be developed specifically for the CBS All Access streaming service. Alex Kurtzman, co-writer of the films Star Trek (2009) and Star Trek Into Darkness (2013), and Heather Kadin were set as executive producers. The January 2017 date was the earliest that CBS could release a new Star Trek series after an agreement the company made when it split from Viacom in 2005. Showtime, Netflix, and Amazon Video all offered \"a lot of money\" for the rights to stream the series, but after heavily investing in the new All Access service CBS believed that a returning Star Trek could be \"the franchise that really puts All Access on the map\". In January 2016, CBS president Glenn Geller said the network would broadcast the first episode but was not creatively involved in the series, saying, \"It really is for All Access.\""
    },
    {
      "title": "Bryan Fuller",
      "content": "After beginning his career writing for the series Star Trek: Deep Space Nine and Star Trek: Voyager, Bryan Fuller was announced as the new series' showrunner and co-creator alongside Kurtzman in February 2016. Nicholas Meyer, co-writer and director of Star Trek II: The Wrath of Khan (1982) and Star Trek VI: The Undiscovered Country (1991), also joined the series as a consulting producer. In March, Rod Roddenberry (the son of Star Trek creator Gene Roddenberry) and Trevor Roth of Roddenberry Entertainment also joined the series as executive producers. Fuller said working with people previously involved with Star Trek was \"really about making sure that we maintain authenticity\", and said Meyer—who is widely considered to have made the best Star Trek film in The Wrath of Khan—brought \"a clarity and a cleanliness to the storytelling\".\n\nFuller had publicly called for Star Trek to return to television for years, particularly because of its impact on minority groups, as he explained, \"I couldn't stop thinking about how many black people were inspired by seeing Nichelle Nichols on the bridge of a ship. I couldn't stop thinking about how many Asian people were inspired by seeing George Takei and feeling that gave them hope for their place in the future. I wanted to be part of that representation for a new era.\" When Fuller first met with CBS about the series, the company did not have a plan for what it would be. He proposed an anthology series, with each season being a standalone, serialized story set in a different era. This would begin with a prequel to The Original Series, followed by stories set during The Original Series, during Star Trek: The Next Generation, and then \"beyond to a time in Trek that's never been seen before\". Fuller compared this to what American Horror Story did for horror, and described the proposal as a platform for \"a universe of Trek shows\". CBS instead suggested he create a single serialized series to see how that performed.\n\nFuller began further developing the concept of a prequel to The Original Series. He announced in June 2016 that the first season would consist of 13 episodes, though he would prefer to produce 10 episodes a season moving forward. A month later, Fuller announced the series' title, Star Trek: Discovery, and revealed that it would be set in the \"Prime Timeline\" which includes the previous Star Trek series but not the modern reboot films such as Star Trek, Into Darkness, and Star Trek Beyond (2016). This was to keep the concurrent series and films separate, so \"we don't have to track anything [happening in the films] and they don't have to track what we're doing\". Also in July, CBS Studios International licensed the series to Netflix for release outside the United States and Canada, a \"blockbuster\" deal that paid for the series' entire budget (around US$6–7 million per episode at that time). During pre-production on the series, Fuller and CBS had disagreements on its direction. The production began to overrun its per-episode budget and was falling behind schedule due to Fuller supervising all aspects of the series while also showrunning another new series, American Gods. This caused frustration among CBS executives who felt Fuller should be focused on having Discovery ready for release in January 2017.\n\nBy August 2016, Fuller had hired Gretchen J. Berg and Aaron Harberts, whom he worked with on Pushing Daisies, to serve as co-showrunners with him. A month later, he and Kurtzman asked CBS to delay the series' release so they could meet the high expectations for it, and the studio pushed the premiere back to May 2017. At the end of October, CBS asked Fuller to step down as showrunner, and announced a restructuring of the production: Berg and Harberts were made sole showrunners, working from a broad story arc and overall mythology established by Fuller; Kurtzman and Fuller would continue as executive producers, but with Fuller moving his attention fully to American Gods; and Akiva Goldsman would join as a supporting producer similar to the role he held on Fringe alongside Kurtzman. CBS said they were still happy with Fuller's creative direction for the series, but some elements that came from him, including designs and \"more heavily allegorical and complex story\" points, were soon dropped. Fuller later confirmed that he was no longer involved with the series."
    },
    {
      "title": "Gretchen J. Berg and Aaron Harberts",
      "content": "With production set to begin in January 2017, \"careful deliberation\" was going into the series' production value and effects. Ted Sullivan joined as supervising writing producer, and CBS Interactive president Marc DeBevoise revealed that the episode order had been expanded to 15 episodes. In June, CBS announced a new premiere date of September 24, 2017, and Kurtzman said he had discussed future seasons with Fuller before the latter's departure. Kurtzman promised that the series' \"set-up, character, big ideas, [and] the big movement of the season\" were all true to Fuller's original plans. In August, Goldsman said future seasons would have a \"hybridized [anthology] approach\" with each season having its own story arc and a mixture of new and familiar characters. Kurtzman added that the success of Discovery could lead to other new Star Trek series.\n\nBy the end of August 2017, Berg and Harberts had developed a road map for a second season and the beginnings of one for a third. It was also revealed that an average episode of the first season had cost US$8–8.5 million, making it one of the most expensive television series ever made. This exceeded the original Netflix deal, but CBS still considered the series paid for due to the number of new CBS All Access subscribers that it was expected to draw. After the series premiere, Kurtzman said the producers wanted to avoid announcing release dates for future seasons due to the external pressure caused by delaying the first season's premiere after it was announced. Despite this, he hoped a second season would be available in early 2019. The second season was officially ordered in October 2017, and consists of 13 episodes. Goldsman did not return for the season after clashing with the series' writing staff, while Meyer was not asked to return for the second season. In June 2018, when production on the second season was underway, CBS fired Berg and Harberts. This was due to the first episode of the season going significantly over budget, as well as alleged abusive behavior by the pair directed at the other writers. Kurtzman was made showrunner and was set to \"regroup\" the writers room."
    },
    {
      "title": "Alex Kurtzman and Michelle Paradise",
      "content": "After Kurtzman took over, the second season was on track for a January 2019 premiere. There was enough of a delay in production that CBS extended the season's episode count to 14 as a way to amortize the cost of the delays. In February 2019, shortly after the season premiere, the series was renewed for a third season with writer Michelle Paradise promoted to co-showrunner alongside Kurtzman. In October 2019, Kurtzman said the third season would consist of 13 episodes. Active development on a fourth season had begun by January 2020, and it was officially announced in October. Also in October, Kurtzman was asked how long he intended for Discovery to continue, especially with other streaming series being cancelled during the COVID-19 pandemic, and said there were \"years and years left on Discovery\". He noted the precedent of several previous Star Trek series running for seven seasons each. A 10-episode fifth season was ordered in January 2022. Paramount announced in March 2023 that the season would be the last for the series, which came as a surprise to the cast and crew who expected to make at least one or two more seasons. The decision came amid cost cutting for Paramount's streaming content. The season's ending was updated so it could better serve as a series finale."
    },
    {
      "title": "Writing",
      "content": "The series' writers room is based at Kurtzman's Secret Hideout offices in Santa Monica. The titular ship was named after Discovery One from 2001: A Space Odyssey, NASA's Space Shuttle Discovery, and \"the sense of discovery... what [that] means to Star Trek audiences who have been promised a future by Gene Roddenberry where we come together as a planet and seek new worlds and new alien races to explore and understand\".\n\nFuller wanted to differentiate Discovery from previous Star Trek series by taking advantage of the streaming format of All Access and telling a single serialized story across the entire first season, inspired by the general change in television to tell those kinds of stories rather than the \"new destination-based adventure each week\" format mostly used in previous Star Trek series. Fuller had been one of several writers during the 1990s pushing for Deep Space Nine and Voyager to move towards this style. The producers wanted to build towards Roddenberry's Star Trek ideals and show that \"you can't simply be accepting and tolerant without working for it\", and chose to ignore Roddenberry's longstanding rule that Starfleet crew members not have significant conflict with one another.\n\nFuller saw the series as a bridge between Star Trek: Enterprise and The Original Series—which are set over a century apart—but set much closer to the latter to allow Discovery to use the latter's iconic designs and costumes; the series ultimately moved away from those designs after Fuller's departure. The first season tells the story of the Federation-Klingon cold war that had been mentioned in Star Trek before but not depicted on screen. The season finishes with the end of the war, which allowed the writers to move beyond Fuller's established storyline. The second season has a more episodic structure than the first, though it still tells a single serialized story, and it introduces more elements from The Original Series including the USS Enterprise and its crew. A goal of the showrunners for the season was to \"cement Discovery firmly in the timeline\" by reconciling some of the apparent continuity errors from the first season, such as why Discovery characters and more advanced technology are not mentioned in The Original Series or other previous Star Trek media. They achieved this by having Discovery and its crew travel over 900 years into the future at the end of the season which Kurtzman compared to the new timeline created for the film Star Trek to avoid established continuity.\n\nKurtzman felt the jump to the future had opened up new variables and storytelling opportunities that were preventing the series from feeling stale and confirmed that the series would remain in the 32nd century for the rest of its run. Discussing what makes Discovery unique among Star Trek series, Paradise said it was the mixture of serialized storytelling and a focus on action, adventure, and visual effects. She noted that Discovery could feel separate from the rest of the franchise following the time jump to the future but explained that the writers were always looking for ways to connect the series back to past Star Trek media to prevent this. Beginning with the third season, astrophysicist Erin Macdonald joined the series and wider Star Trek franchise as a science advisor. Macdonald said each series was on a \"spectrum of science to fiction\" and Discovery was \"way more on the science side\", so to ensure scientific accuracy Macdonald became involved in all aspects of the series from developing plots with the writers room to reviewing that graphics and visual effects were correct in post-production."
    },
    {
      "title": "Casting",
      "content": "By June 2016, Fuller had met with several actors and said the series would \"carry on what Star Trek does best\" by hiring a progressive, diverse cast, with Kadin confirming that the series would feature minority, female, and LGBTQ characters. In August, Fuller said the series would star a lieutenant commander, to be played by a non-white actress, rather than a captain like previous Star Trek series. He also said Discovery would include more alien characters than other Star Trek series, and would feature at least one openly gay character. Fuller, who is gay himself, had been determined to see this happen since receiving hate mail while working on Voyager when a character on that show was rumored to be coming out as gay. Fuller discussed the series' casting with Mae Jemison, the first black woman in space who made a cameo appearance in an episode of The Next Generation. He anticipated casting announcements in October, but none had been made by the end of that month. The majority of the series main characters were believed to have been cast by then, but no actress had been cast for the series' lead role. This was a source of \"internal stress\" at CBS. Several African American and Latina actresses were being looked at for the role, with CBS preferring a \"fresh face\" over an established star. The cast was believed to include a female admiral, a male Klingon captain, a male admiral, a male adviser, and a British male doctor, with one of those male leads played by an openly gay actor.\n\nDoug Jones and Anthony Rapp were revealed to have been cast in November 2016, respectively as science officers Saru and Stamets. Saru is a Kelpien, an alien race created for the series, while Stamets is the first Star Trek character to be conceived and announced as gay. Sonequa Martin-Green was cast in the lead role in December, when Shazad Latif was cast as the Klingon Kol. In March 2017, Jason Isaacs was cast as Captain Lorca of the USS Discovery, and Mary Wiseman joined as Tilly, a cadet. In April, Martin-Green's casting was officially confirmed and her character's name was revealed to be Michael Burnham. At the end of that month, Latif was recast to the role of Starfleet Lieutenant Tyler. The series reveals that Tyler is the undercover persona of the Klingon Voq, who is initially credited as being portrayed by the invented actor Javid Iqbal to hide the fact that Latif portrays both Voq and Tyler.\n\nRapp revealed in July 2017 that Wilson Cruz, whom Rapp had previously worked with on the musical Rent, would portray Stamets' love interest Hugh Culber. The character is killed off during the first season, which was criticized by some as following the \"bury your gays\" trope, but the executive producers immediately released a statement with Cruz and LGBTQ media monitoring organization GLAAD saying the relationship between Culber and Stamets would continue to be explored. Cruz was subsequently promoted from his recurring guest role to the series' main cast for the second season, in which Culber is brought back to life. After the first season concluded with the Discovery receiving a distress call from the USS Enterprise, specifically from Captain Christopher Pike, Harberts expressed interest in exploring that character; Anson Mount was cast in the role in April 2018, and stars for the second season.\n\nCasting had begun by June 2019 for the new role of Adira, a non-binary character described as \"incredibly intelligent and self-confident\" with the potential to become a recurring guest throughout the third season. The next month, David Ajala joined the cast as new series regular Cleveland \"Book\" Booker for the third season. Rachael Ancheril is also credited as starring for her appearances in the season, reprising her recurring guest role as Nhan from the second season. She is written out of the series in the third season's fifth episode. In September 2020, non-binary newcomer Blu del Barrio was revealed to be portraying Adira, the first explicitly non-binary character within the Star Trek franchise. They were promoted to the series' main cast in the fourth season along with recurring guest star Tig Notaro as Jett Reno. Callum Keith Rennie joined the fifth season as Rayner, a war-time Starfleet captain."
    },
    {
      "title": "Design",
      "content": "Fuller wanted to take advantage of modern effects, production design, and makeup to establish a new look for the series and franchise that previous Star Trek media was unable to achieve. Mark Worthington and Todd Cherniawsky served as initial production designers for the series, and Suttirat Anne Larlarb was hired as costume designer. Glenn Hetrick and Neville Page of Alchemy Studios provided prosthetics and armor, with Page having previously designed for the rebooted Star Trek films. Mario Moreira served as prop master for the series, with seven art directors, over nine illustrators, more than thirty-five set designers, and over four hundred and fifty painters, carpenters, sculptors, model makers, welders, set dressers, and prop builders all hired for the first season. The designers consulted with the Jet Propulsion Laboratory for scientific accuracy. Tamara Deverell took over as production designer during production on the first season, but left after the second. She was replaced by Phillip Barker, who was able to approach the third season as a fresh start due to the new time period. Barker helped develop the new 32nd century technology as part of his design process. Doug McCullough took over as production designer for the fourth season.\n\nFuller had wanted the series' uniforms to reflect the primary colors of The Original Series, but this was discarded after his departure, when Larlarb also left the series. Gersha Phillips took over as costume designer. Fabric for the series' Starfleet uniforms was custom-dyed in Switzerland, and was a navy blue specifically mixed for the production. Gold or silver embellishments denoted divisions, while medical officers wear a \"hospital white\" variant of the uniform. The captain's uniform is the standard navy blue but with additional gold piping on the shoulders. Phillips attempted to create costumes with no seams using \"No Sew\" bonding techniques such as glue and tape, but the producers rejected this because they wanted to see more details in the costumes. Starfleet insignia badges were molded from silicon bronze, and then polished and plated by a jeweler to create custom colors for the series: gold for command, silver for sciences and medical, and copper for operations. Phillips was able to revisit the colorful uniforms from The Original Series with the introduction of the USS Enterprise in the second season, applying the colors of those original costumes to the design of Discovery uniforms. She was also able to revisit her \"No Sew\" approach for the future Starfleet uniforms in the third season. These are mostly gray, with divisions represented by a colored stripe, but once the crew of Discovery started wearing these costumes the producers realised that they clashed with the Discovery's existing gray hallway sets. Phillips designed new uniforms for the fourth season that use the same primary colors as The Next Generation, with red for command, gold for operations, and blue for science. Medical officers still wear white uniforms.\n\nVeteran Star Trek designer John Eaves designed starships for the series with Scott Schneider, and based the USS Discovery on an unused Ralph McQuarrie design for the Enterprise from the unproduced film Star Trek: Planet of the Titans. Fuller compared McQuarrie's design to 1970s Lamborghinis and cars from the James Bond franchise. Sets for the Discovery's interiors were described as a \"tangle of corridors and rooms\", and were designed to look like they could believably fit inside the ship. The graphics used for the Starfleet computer systems were designed to be believably more advanced than modern technology, but to also honor the look and feel of the designs used in previous series. These were updated for the third season to reflect the more advanced future technology, when programmable matter was integrated into the Discovery design.\n\nThe opening title sequence was created by Prologue using 2D motion graphics. The sequence depicts elements from throughout the history of Star Trek—such as phasers, communicators, and the Vulcan salute—and deconstructs them. Prologue creative director Ana Criado said the producers wanted the sequence to be unlike any previous Star Trek titles sequences. A blueprint theme was decided to acknowledge that the series is a prequel, \"literally deconstructing Trek iconography\". The sequence was originally in black-and-white, but Criado said this was too \"cold\" and was replaced with a Renaissance-inspired sepia look \"to make it look like we are designing everything from scratch\". The sequence was updated for each season. The third season introduces a new logo for the series to reflect its move to the far future and move away from the Klingon-inspired initial logo."
    },
    {
      "title": "Filming",
      "content": "Star Trek: Discovery is filmed at Pinewood Toronto Studios, taking advantage of multiple soundstages at the studio including the largest one in North America. Filming for the series also takes place on location around Ontario, Canada, including at the Aga Khan Museum in Toronto to portray the Vulcan Science Academy, the Hilton Falls and Kelso Conservation Areas, the Scarborough Bluffs, the Stelco steel plant in Hamilton, and the disused Kingston Penitentiary. The series spent more than CA$257 million (US$202 million) in Ontario, and created more than 4,000 jobs for local crew, in just its first two seasons. Location filming for the series also took place outside of North America, with some filming in Jordan for the series premiere, and in Iceland for the first two episodes of the third season.\n\nKurtzman felt the visual style of the series had to \"justify being on a premium cable service\", and the producers worked closely with first episode director David Semel to make the series look as cinematic as possible. They took inspiration from the wide scope of Star Trek: The Motion Picture (1979), including using a 2:1 aspect ratio, as well as from the modern Star Trek films directed by J. J. Abrams. The cinematographers wanted to emphasize on-set lighting sources to create a more realistic look and distance the series from the \"stage\" feel of The Original Series. The lighting on set could be controlled, including changing their color for when the ship goes into alert mode. Harberts said that the cinematographers wanted the series to have a \"Rembrandt texture\". For the second season, Kurtzman chose to use anamorphic lenses with a 2.39:1 aspect ratio to \"immediately [convey] a sense of scope and scale\". He hoped that if the series was projected in a theater it would appear indistinguishable from a feature film. Frequent Star Trek director Jonathan Frakes said the series' producing director, Olatunde Osunsanmi, encouraged all of the directors to \"express ourselves visually in as exciting a way as possible\", with Frakes describing the series' directing style as \"shoot to thrill\".\n\nParamount+ constructed a video wall to allow for virtual production on the fourth season as well as the spin-off series Star Trek: Strange New Worlds, utilizing technology similar to the StageCraft system that was developed for the Disney+ series The Mandalorian. The new virtual set was built in Toronto by visual effects company Pixomondo, and features a 270-degree, 70 ft by 30 ft horseshoe-shaped LED volume with additional LED panels in the ceiling to aid with lighting. The technology uses the game engine software Unreal Engine to display computer-generated backgrounds on the LED screens in real-time during filming. Visual effects supervisor Jason Zimmerman noted that this was especially useful for creating the planets that are visited in the series since location shooting was limited on the fourth season by the COVID-19 pandemic."
    },
    {
      "title": "Visual effects",
      "content": "Visual effects producers were hired to begin work on the series during the initial writing period, with Fuller explaining that they wanted to develop distinct looks for classic Star Trek effects such as digitally-augmented alien species and transporter beams. Pixomondo is the primary visual effects vendor for the series, with other vendors including Spin VFX, Ghost VFX, Mackevision, Crafty Apes, DNEG, The Mill, and FX3X, as well as visual effects supervisor Jason Zimmerman's in-house team at CBS Studios. Visual effects shots for each episode on Discovery typically take eight-to-ten months to complete, and include fully digital environments such as the shuttle bay of Discovery, digital extensions of sets, shots of the Discovery and other starships, digital creatures, holograms, and 32nd century technology such as programmable matter."
    },
    {
      "title": "Music",
      "content": "Several composers auditioned for the series, including Charles Henri Avelange, and Fil Eisler whose audition music was used for the series' first teaser. Cliff Eidelman and Austin Wintory were also considered for the role, before Jeff Russo was announced as composer for the series in July 2017. Russo wanted the show's main theme to embody the ideals of Star Trek and \"a commonality in people\" by only using chords that have a common note, with a melody then added over the top. The theme is bookended by elements of the original Star Trek theme by Alexander Courage. Russo acknowledged that not all existing Star Trek fans were going to appreciate the new theme, but felt that regardless of how it compared to previous themes in the franchise it still accurately represented this series. Russo recorded the series' score with a 60-piece orchestra, initially at the Eastwood Scoring Stage at Warner Bros. Studios in California. Due to the COVID-19 pandemic, musicians for the third season were recorded individually and their performances combined.\n\nIndividual soundtrack albums for the two chapters of the first season were respectively released on December 15, 2017, and April 6, 2018. A soundtrack album for the second season was released on July 19, 2019, for the third on April 16, 2021, for the fourth on August 26, 2022, and for the fifth on October 18, 2024."
    },
    {
      "title": "Release",
      "content": "The first episode of Star Trek: Discovery aired in a \"preview broadcast\" on CBS in the United States and was made available with the second episode on CBS All Access. The rest of the series' episodes for the first three seasons were released weekly on All Access. CBS Studios International licensed the series to Bell Media for broadcast in Canada, and to Netflix for another 188 countries. In Canada, the premiere was simulcast with CBS on both the CTV Television Network and on the specialty channel CTV Sci-Fi Channel before being streamed on Crave; it was also broadcast in French on the specialty channel Z. Subsequent episodes were released through CTV Sci-Fi, Z, and Crave, with CTV Sci-Fi airing each episode 30 minutes before it streamed on All Access. In the other countries, Netflix released each episode of the first three seasons for streaming within 24 hours of its U.S. debut. This agreement also saw Bell Media and Netflix acquire all previous Star Trek series to stream and broadcast at the time.\n\nIn September 2020, ViacomCBS announced that CBS All Access would be expanded and rebranded as Paramount+ in March 2021. Existing episodes of Discovery first three seasons remained on Paramount+ along with future seasons of the series. On November 2, 2021, a home media box set collecting the first three seasons was released, with more than eight hours of special features including behind-the-scenes featurettes, deleted and extended scenes, audio commentaries, and gag reels. On November 17, two days before the fourth season's international debut, ViacomCBS announced that it had bought back the international streaming rights to Discovery from Netflix effective immediately. The deal was for an undisclosed amount of money that was reported to be in the six-figure range, and meant that Netflix would no longer contribute to the series' budget as it had been doing since the original international licensing deal in July 2016. Because of the new deal, the fourth season was set be streamed in countries outside of North America on Paramount+ once the service was available there some time in 2022. Following backlash from international fans, ViacomCBS made the season available internationally through several avenues. In August 2023, Star Trek content was removed from Crave and Discovery began streaming on Paramount+ in Canada. The series would continue to be broadcast on CTV Sci-Fi and be available on CTV.ca and the CTV app."
    },
    {
      "title": "Viewership",
      "content": "According to Nielsen Media Research, the CBS broadcast of the first episode was watched by a \"decent\" audience of 9.5 million viewers. The premiere of the series led to record subscriptions for CBS All Access, with the service having its biggest day of signups, as well as its biggest week and month of signups thanks to the series. According to \"app analytics specialist\" App Annie, the premiere of the series also caused the number of downloads of the All Access mobile app to more than double, with revenue from the app for CBS doubling compared to the average in-app revenue during the previous 30 days. Increased subscribers for All Access was given as one of the reasons behind the series' second and third season renewals. Audience demand analytics company Parrot Analytics estimates streaming viewership based on global \"demand expressions\", with the \"desire, engagement, and viewership weighted by importance\". In the company's list of the top 20 most in-demand streaming series of 2020, Discovery was ranked 12th and was the highest ranked All Access series for the year.\n\nIn the first week of Paramount+'s launch in March 2021, JustWatch, a guide to streaming content with access to data from more than 20 million users around the world, estimated that Star Trek: Discovery was the most in-demand series on the new service. In December 2021, Paramount+ revealed that Discovery was the most watched series on the streaming service for its inaugural year. Parrot Analytics listed the series as the 15th most in-demand streaming series of 2021, the only Paramount+ series in their top 20 list for the year."
    },
    {
      "title": "Critical response",
      "content": "<section begin=Response /><section end=Response />\n\nStar Trek: Discovery has an 85% approval rating on the review aggregator website Rotten Tomatoes, while Metacritic, which uses a weighted average, has assigned a score of 73 out of 100 based on reviews from 41 critics, indicating \"generally favorable reviews\".\n\nFor the first season, Rotten Tomatoes reported an 83% approval score with an average rating of 7.05/10 based on 374 reviews. The website's critical consensus reads, \"Although it takes an episode to achieve liftoff, Star Trek: Discovery delivers a solid franchise installment for the next generation—boldly led by the charismatic Sonequa Martin-Green.\" Metacritic assigned a score of 72 out of 100 based on reviews from 20 critics, indicating \"generally favorable reviews\".\n\nRotten Tomatoes reported an 81% approval score for the second season, with an average rating of 7.35/10 based on 209 reviews. The website's critical consensus reads, \"The second season of Discovery successfully—if stubbornly—cleans up the problematic storylines of Trek past while still effectively dramatizing new takes on the lore.\" Metacritic assigned a score of 72 out of 100 based on reviews from 10 critics, indicating \"generally favorable reviews\".\n\nRotten Tomatoes reported a 91% approval score for the third season, with an average rating of 7.7/10 based on 35 reviews. The website's critical consensus reads, \"With less canonical baggage and a welcome dose of character development, Discovery continues to forge its own path and is narratively all the better for it.\" Metacritic assigned a score of 75 out of 100 based on reviews from 8 critics, indicating \"generally favorable reviews\".\n\nFor the fourth season, Rotten Tomatoes reported an 88% approval score with an average rating of 8.1/10 based on 17 reviews. The website's critical consensus reads, \"Michael Burnham finally comes into her own—and so does Discovery—in a confident fourth season that embraces the series' more heartfelt take on the Star Trek mythos.\"\n\nFor the fifth season, Rotten Tomatoes reported an 80% approval score with an average rating of 6.7/10 based on 20 reviews. The website's critical consensus reads, \"Lightening up just in time for one last voyage, Star Trek: Discovery concludes with a quest that sends this particular crew off in rousing fashion.\""
    },
    {
      "title": "Accolades",
      "content": "In June 2020, Kareem Abdul-Jabbar named Star Trek: Discovery as one of the six best \"morale-boosting TV dramas for people of color\" for being the most consciously diverse Star Trek series and for featuring people of color as role models. The second, third, and fourth seasons all received the ReFrame Stamp, which is awarded by the gender equity coalition ReFrame as a \"mark of distinction\" for film and television projects that are proven to have gender-balanced hiring, with stamps being awarded to projects that hire female-identifying people, especially those of color, in four out of eight critical areas of their production."
    },
    {
      "title": "Lawsuit",
      "content": "In August 2018, video game developer Anas Abdin announced that he would sue CBS for allegedly copying elements of his unreleased video game Tardigrades, including large tardigrades that help humans travel through the universe instantly, and similar characters. The lawsuit was dismissed by Judge Lorna G. Schofield in September 2019, finding that the series and video game were not \"substantially similar as a matter of law\", and that the only similarities were the space setting and the use of alien tardigrades. Abdin appealed this dismissal, but the US Court of Appeals for the Second Circuit upheld Schofield's decision in August 2020."
    },
    {
      "title": "Publishing",
      "content": "In September 2016, Discovery writer Kirsten Beyer announced that CBS was working with IDW Publishing and Simon & Schuster to produce more content revolving around the setting of the series, starting with at least one novel and a comic book. Beyer, the writer of many Star Trek: Voyager novels, explained that she would work with fellow Star Trek novelist David Mack and Star Trek comic writer Mike Johnson to ensure that all media \"are coming from the same place\". The release of the books and comics was set to coincide with the series' premiere. Mack described writing around the continuity of Discovery as \"tricky to get right\", as the time period is \"light on detail and almost unique within the Star Trek continuity. That made it a challenge to represent that era faithfully while also staying true to the new elements being introduced\" in the series. Beyer explained in August 2017 that the novels and comics would tell stories that the series did not have time to address but that enhanced the overall story for fans, though they would not be required reading to understand the series. She said the writers of the tie-in works and the series' writers room would work together to not contradict each other, but if an idea was developed for the series that did not work with something established in a tie-in then the series would take priority."
    },
    {
      "title": "Video games",
      "content": "By August 2017, hours of Discovery-based content was set to be added to the video game Star Trek Timelines, including introducing Michael Burnham and Saru as new crew members for the game and new ships from the show, Federation and otherwise. A month-long \"Mega-Event\" based on the series was run in the game to coincide with the series' premiere. In July 2018, a tie-in for the game Star Trek Online was announced titled Age of Discovery. Set during the first season of the series, the event introduces a story set on the USS Glenn and includes the character Sylvia Tilly. Wiseman returned to voice the character. Other elements inspired by the series included new starship and Klingon designs. In January 2020, Martin-Green was set to voice Burnham for Star Trek Online's \"Legacy\" expansion celebrating 10 years of the game."
    },
    {
      "title": "After Trek",
      "content": "CBS announced an official aftershow series for Discovery in 2017. Titled After Trek, it is similar to AMC's Talking Dead, a companion to The Walking Dead, and was hosted by Matt Mira. The series aired after each episode of Discovery, and featured a rotating panel of guests including cast and crew members from Discovery, former Star Trek actors, and celebrity Trekkies. It was produced by Embassy Row and Roddenberry Entertainment."
    },
    {
      "title": "The Ready Room",
      "content": "CBS announced in June 2018 that After Trek would be re-imagined for the second season of Discovery. It was replaced with a new interview-style aftershow named The Ready Room, hosted by Naomi Kyle, which streamed weekly on Facebook Live. Star Trek: The Next Generation actor Wil Wheaton took over as host of The Ready Room for Discovery with its third season."
    },
    {
      "title": "Franchise expansion and spin-offs",
      "content": "In June 2018, after becoming sole showrunner of Discovery, Kurtzman signed a five-year overall deal with CBS Television Studios to expand the Star Trek franchise beyond Discovery to several new series, miniseries, and animated series. Kurtzman wanted to \"open this world up\" and create multiple series set in the same universe but with their own distinct identities, an approach that he compared to the Marvel Cinematic Universe (MCU). He added that he would \"weigh in meaningfully and significantly at all the critical junctures\" for each new series. CBS and Kurtzman began referring to the expanded franchise as the \"Star Trek Universe\" at the 2019 San Diego Comic-Con, and monthly meetings with the showrunners of each new series were being held by April 2021 to allow coordination between the different series and ensure that \"they're not stepping on each other's toes\", according to Kurtzman.\n\nIn addition to Picard, Lower Decks, Prodigy, and Starfleet Academy, the expanded franchise includes several direct spin-offs from Star Trek: Discovery:"
    },
    {
      "title": "Star Trek: Short Treks",
      "content": "Kurtzman announced in July 2018 that a companion series of shorts would be released between the seasons of Discovery to \"deliver closed-ended stories while revealing clues about what's to come in future Star Trek: Discovery episodes. They'll also introduce audiences to new characters who may inhabit the larger world of Star Trek.\""
    },
    {
      "title": "Star Trek: Strange New Worlds",
      "content": "After Mount left Discovery following the second-season finale, fans began calling for him to reprise his role of Christopher Pike in a spin-off set on the USS Enterprise, alongside Rebecca Romijn as Number One and Ethan Peck as Spock. Kurtzman confirmed that development on such a series had begun in January 2020, and Paramount+ ordered the spin-off, titled Star Trek: Strange New Worlds, in May 2020."
    },
    {
      "title": "Star Trek: Section 31",
      "content": "By November 2018, Michelle Yeoh was in talks with CBS to star in a spin-off series as her character Philippa Georgiou which would feature the secretive organization Section 31. In April 2023, Paramount+ announced that the project was moving forward as a streaming \"event film\". Yeoh was reprising her role in the film, which was written by Craig Sweeny and directed by Olatunde Osunsanmi."
    }
  ]
}