{
  "title": "Star Trek: Deep Space Nine",
  "parentTitle": "Star Trek",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Created By",
      "value": "Rick Berman\n\nMichael Piller"
    },
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    },
    {
      "type": "number",
      "label": "No. of Seasons",
      "value": 7
    },
    {
      "type": "number",
      "label": "No. of Episodes",
      "value": 176
    }
  ],
  "content": "Star Trek: Deep Space Nine (DS9) is an American science-fiction television series created by Rick Berman and Michael Piller. The fourth series in the Star Trek media franchise, it originally aired in syndication from January 3, 1993, to June 2, 1999, spanning 176 episodes over seven seasons. Set in the 24th century, when Earth is part of a United Federation of Planets, its narrative is centered on the eponymous space station Deep Space Nine, located adjacent to a wormhole connecting Federation territory to the Gamma Quadrant on the far side of the Milky Way galaxy.\n\nFollowing the success of Star Trek: The Next Generation, Paramount Pictures commissioned a new series set in the Star Trek fictional universe. In creating Deep Space Nine, Berman and Piller drew upon plot elements introduced in The Next Generation, namely the conflict between two species, the Cardassians and the Bajorans. Deep Space Nine was the first Star Trek series to be created without the direct involvement of franchise creator Gene Roddenberry, the first set on a space station rather than a traveling starship, and the first to have an African American as its central character: Starfleet Commander, later Captain, Benjamin Sisko (played by Avery Brooks).\n\nChanges were made to the series throughout its seven-year run. In the third season, the starship USS Defiant was introduced to enable more stories away from the space station. The fourth added Worf (Michael Dorn), a character who originated on The Next Generation, to the main cast. The final three seasons deal with a story arc, that of the war between the Federation and an invading Gamma Quadrant power, the Dominion. Although not as popular as The Next Generation, Deep Space Nine was critically well received. Following the success of Deep Space Nine, Paramount commissioned Berman, Piller, and Jeri Taylor to produce Star Trek: Voyager, which began in 1995. During Deep Space Nine run, various episode novelizations and tie-in video games were produced. After the show ended, various novels and comics continued the adventures of the crew.",
  "sections": [
    {
      "title": "Premise",
      "content": "The main setting of Deep Space Nine is a space station near the planet Bajor, built by the imperialistic Cardassians during their long, brutal occupation of Bajor. After liberating themselves through a guerrilla war, the Bajorans invite the United Federation of Planets to jointly administer the station. The station is renamed Deep Space Nine, and a Starfleet and Bajoran crew is assigned to manage it, led by Commander Benjamin Sisko.\n\nShortly after his arrival, Sisko discovers a stable wormhole in Bajoran space between the Alpha Quadrant and the unexplored Gamma Quadrant, and the station is moved near the wormhole's entrance. The wormhole is the home of powerful, noncorporeal aliens whom the Bajorans worship as \"the Prophets\". Sisko is revered by the Bajorans as the Prophets' \"Emissary\"; although he is initially uncomfortable with being a religious figure, he gradually grows to accept his role.\n\nDeep Space Nine and Bajor quickly become a center for exploration, interstellar trade, political maneuvering, and finally open conflict. Threats come not only from Cardassians, Klingons, and Romulans from the Alpha Quadrant, but also later from the Dominion, a powerful empire in the Gamma Quadrant ruled by a species of shapeshifters. The starship USS Defiant is assigned to help protect the station. When the Dominion and the Cardassians take up arms against the Federation and its allies starting in the fifth season, Deep Space Nine becomes a key Federation base in the Dominion War.\n\nAccording to co-creator Berman, he and Tiller considered setting the new series on a colony planet, but they decided a space station would appeal more to viewers, and would save the money required for a land-based show's on-location shooting. They did not want the show set aboard a starship because Star Trek: The Next Generation was still in production, and in Berman's words, it \"seemed ridiculous to have two shows—two casts of characters—that were off going where no man has gone before\".\n\nWhile its predecessors tended to restore the status quo ante at the end of each episode, allowing out-of-order viewing, DS9 contains story arcs that span episodes and seasons. One installment often builds upon earlier ones, with several cliffhanger endings. Michael Piller considered this one of the series' best qualities, allowing repercussions of past episodes to influence future events and forcing characters to \"learn that actions have consequences.\" This trend was especially noticeable toward the series finale, by which time the show was intentionally scripted as a serial.\n\nUnlike Star Trek: The Next Generation, interpersonal conflicts were prominently featured in DS9. This was at the suggestion of Star Trek: The Next Generation's writers, many of whom also wrote for DS9, who said that Roddenberry's prohibition of conflicts within the crew restricted their ability to write compelling dramatic stories. In Piller's words, \"People who come from different places — honorable, noble people — will naturally have conflicts\". The series took a more cynical view of human nature and the United Federation of Planets than the utopian vision presented in The Next Generation, and unlike its predecessor, it featured main characters who were not from the Federation and could offer an alternative perspective."
    },
    {
      "title": "Recurring characters",
      "content": "The series' setting — a space station rather than a starship — fostered a rich assortment of recurring characters. It was not unusual for secondary characters to play as much of a role in an episode as the regular cast, if not more. For example, \"The Wire\" focused principally on the recurring character Elim Garak, while in \"It's Only a Paper Moon\", the central characters were Nog and Vic Fontaine, with the regular characters in supporting roles.\n\nSeveral Cardassian characters figure prominently in DS9, particularly Gul Dukat, a senior member of the Cardassian military involved in the occupation of Bajor, played by Marc Alaimo. A complex character, Dukat undergoes several transformations before ultimately resolving as a profoundly evil character, and Sisko's archenemy, by the show's conclusion. A StarTrek.com article about Star Trek's greatest villains described Gul Dukat as \"possibly the most complex and fully- [sic]developed bad guy in Star Trek history\".\n\nElim Garak, portrayed by Andrew Robinson, is the only Cardassian who remains on the space station when the Federation and the Bajorans take over. Although he maintains that he is merely a simple tailor, Garak is a former agent of the Obsidian Order, the feared Cardassian secret police; his skills and contacts on Cardassia prove invaluable on several occasions, and he becomes a pivotal figure in the war with the Dominion.\n\nDamar (Casey Biggs) is introduced in the fourth season as an aide to Gul Dukat, and he rises in stature as Dukat regains prominence. He becomes the leader of the Cardassian Union when Dukat has an emotional breakdown, but dissatisfied with Cardassia's relationship with the Dominion, Damar forms and leads an insurgency against the Dominion, playing a vital role in its eventual defeat.\n\nJeffrey Combs has stated that he had auditioned for the role of William Riker on Star Trek: The Next Generation, but when Jonathan Frakes (who won the part) later directed the DS9 episode \"Meridian\", he recommended Combs for a part. Combs made his Star Trek and DS9 debut as a one-episode alien named Tiron, before being cast as two recurring characters, the Ferengi Brunt and the Vorta Weyoun. He went on to appear in 31 episodes of DS9. In \"The Dogs of War\", he became one of the few Star Trek actors to play two unrelated roles (Brunt and Weyoun) in the same episode. He would later play the recurring role of Shran on Star Trek: Enterprise.\n\nIn addition to Quark and his brother Rom (Max Grodénchik), several other Ferengi had recurring roles, including their shrewd mother Ishka (Andrea Martin, later Cecily Adams), who eventually engineers a social revolution on Ferenginar; Rom's son Nog (Aron Eisenberg), the first Ferengi to join Starfleet; and Grand Nagus Zek (Wallace Shawn), the Ferengi leader. The Bajoran character Leeta (Chase Masterson), who works at Quark's bar and later marries Rom, is sometimes involved in the Ferengi storyline.\n\nThe Klingon Empire plays a significant role in DS9. Aside from Worf, recurring Klingon characters include Chancellor Gowron (Robert O'Reilly), leader of the Empire, who was introduced on The Next Generation, and General Martok (J. G. Hertzler), a leader of the Klingon forces in the Dominion War, who succeeds Gowron as Chancellor when Gowron is killed by Worf late in the series. Kor, a Klingon character from Star Trek: The Original Series, appears in three DS9 episodes; one of them, \"Blood Oath\", unites Kor with two other Klingons from the original series: Koloth and Kang. John Colicos, William Campbell, and Michael Ansara reprised their original series roles.\n\nMorn is a minor character who is a fixture in Quark's establishment, sitting at the bar over the course of seven years. It became a running joke that though the other characters remark on how talkative and funny he is, he never speaks a word on camera. Morn did have a line in the script for pilot episode \"Emissary\", but it was cut due to run-time considerations, after which the creators conceived the joke that he never talks."
    },
    {
      "title": "Season overview",
      "content": "Star Trek: Deep Space Nine ran for seven seasons, from 1993 to 1999. The first season started half-way through the typical broadcast season running from fall to spring, and had fewer episodes than typical Star Trek runs."
    },
    {
      "title": "Plot elements",
      "content": "Major plotlines focus on several key Star Trek cultures, especially interactions between the Bajorans, Cardassians, Ferengi, Klingons, and the Federation. Each of these cultures is represented by major characters in the main or recurring cast.\n\nMajor arcs revolve around Bajor's recovery from Cardassian occupation; the Maquis, a rebellious Federation splinter group; and the Dominion, a hostile imperial power from the other side of the galaxy. The war between the Dominion and the Federation spans the show's last two seasons, after tensions between the two gradually increase from the beginning of the third season. Throughout the series, loyalties and alliances change repeatedly: pacts with the Cardassians are made, broken, and remade; a short war with the Klingons flares up and is settled; Bajor grows into political stability; and formerly neutral powers are drawn into conflict."
    },
    {
      "title": "Bajor",
      "content": "In the first episode, Starfleet Commander Benjamin Sisko arrives at Deep Space Nine, a space station formerly operated by the Cardassians during their oppressive occupation of the planet Bajor. He is assigned to run the station jointly with the newly liberated Bajorans as they recover from the Cardassian occupation, to help pave the way for Bajor's entry into the Federation. Sisko and Jadzia Dax stumble upon a wormhole leading to the distant Gamma Quadrant, and discover that it is inhabited by beings not bound by normal space and time. To the strongly religious people of Bajor, the wormhole aliens are their gods (the Bajoran Prophets), and the wormhole itself is the long-prophesied Celestial Temple. Sisko is hailed as the Emissary of the Prophets, through whom the Prophets act.\n\nBajor's politics and religion, and Sisko's status within it, provide the basis for long-lasting story arcs. Early seasons show Bajor reckoning with the aftermath of occupation and establishing itself as a democracy. Meanwhile, Sisko initially considers his role as a religious icon with discomfort and skepticism, striving to keep his role as station commander distinct from any religious obligations that the Bajorans try to place on him. Later, he becomes more accepting of his role and, by the end of the series, he openly embraces it. He is often called upon to choose between his role as Emissary and his duties to Starfleet, as when he persuades the Bajorans to withdraw their application for Federation membership after receiving a vision from the Prophets. The political and religious implications of Sisko's status for Bajor and its spiritual leaders (most notably, Winn Adami) provide a central arc that lasts until the end of the series."
    },
    {
      "title": "The Maquis",
      "content": "The station crew early on contends with a resistance group known as the Maquis. Rooted in the events of The Next Generation episode \"Journey's End\", in which Native American settlers refuse to leave when their planet is given to Cardassia as part of a treaty, the Maquis are an example of the show's exploration of darker themes; its members are Federation citizens who take up arms against Cardassia in defense of their homes, and some, such as Calvin Hudson, a long-time friend of Sisko's, and Michael Eddington, who defects while serving aboard the station, are Starfleet officers. The show's critique of traditional Star Trek themes can be seen in episodes such as \"For the Cause\", in which Eddington compares the Federation to the implacable alien hive mind known as the Borg: \"At least [the Borg] tell you about their plans for assimilation. You assimilate people and they don't even know it.\""
    },
    {
      "title": "The Dominion War",
      "content": "The second-season episode \"Rules of Acquisition\" marks the first mention of the Dominion, a ruthless empire in the Gamma Quadrant, though they are not fully introduced until the second-season finale, \"The Jem'Hadar\". It is led by \"the Founders\", a race of shape-shifting Changelings, the same species as DS9's security chief, Odo. They were once persecuted by non-shapeshifters (whom they call \"solids\") and they seek to impose \"order\" upon any who could potentially harm them, which includes nearly all solids. The Founders have created or genetically modified races to serve them: their sly diplomats and administrators, the Vorta, and their fearless shock troops, the Jem'Hadar. These races worship the Founders as gods.\n\nAt the start of DS9's third season (\"The Search\"), with the threat of a Dominion attack looming from the other side of the wormhole, the USS Defiant, a prototype warship, is stationed at Deep Space Nine, providing an avenue for plot lines away from the station. With the third season, writers from the now-completed The Next Generation began to write regularly for DS9.\n\nIn the show's middle seasons, the Dominion foments discord to weaken the Alpha Quadrant powers, manipulating the Klingons into war with the Cardassians, and almost inciting a coup d'état on Earth. In the fifth-season episode \"By Inferno's Light\", the Dominion annexes Cardassia, and goes to war with the other major powers of the Alpha Quadrant in the season finale \"Call to Arms\". The Dominion War tests Starfleet's commitment to its ethics; when the formerly neutral Romulans are persuaded to ally themselves with the Federation (\"In the Pale Moonlight\"), it occurs only through criminal and duplicitous acts on Sisko's part. This provides an example of the moral ambiguity prevalent in DS9 in comparison to the other Star Trek series."
    },
    {
      "title": "Section 31",
      "content": "Another example of DS9's darker nature is the introduction of Section 31, a secret organization dedicated to preserving the Federation way of life at any cost. This shadowy group, introduced in \"Inquisition\", justifies its unlawful, unilateral tactics by claiming that it is essential to the continued existence of the Federation. Section 31 features prominently in several episodes of the Dominion War arc, especially as it is revealed that it attempted a genocide of the Founders."
    },
    {
      "title": "The Ferengi",
      "content": "In DS9, the Ferengi are no longer an enemy of the Federation, but rather an economic power whose political neutrality is mostly respected. Several episodes explore their capitalistic nature, while others delve into the race's sexist social norms. Unlike their depiction in Star Trek: The Next Generation, where they were generally portrayed as sexist buffoons, in DS9, they received a more complex depiction. Some Ferengi characters seek life paths outside the pursuit of profit, such as Nog, who becomes the first Ferengi to join Starfleet; others attempt to reform Ferengi society from within, such as Ishka, who leads a women's-rights revolution on the Ferengi homeworld, and Rom, who leads a strike against unfair working conditions in Quark's bar."
    },
    {
      "title": "The Mirror Universe",
      "content": "Several episodes of DS9 explore the Mirror Universe, first introduced in the Star Trek: The Original Series episode \"Mirror, Mirror\". In the second-season episode \"Crossover\", Kira and Dr. Bashir are accidentally sent to the Mirror Universe and discover that it is dominated by a ruthless Klingon–Cardassian alliance and Terrans (humans) are slaves. Over the course of four Mirror Universe episodes of DS9, the Terran workers form a resistance movement and eventually liberate themselves (\"Through the Looking Glass\", \"Shattered Mirror\", \"Resurrection\", and \"The Emperor's New Cloak\")."
    },
    {
      "title": "Production",
      "content": "The series was created by Rick Berman and Michael Piller at the request of Brandon Tartikoff and was produced by Paramount Television. The original Star Trek series had been pitched as the science-fiction equivalent to television Westerns such as Wagon Train, and DS9 was instead analogous to shows like The Rifleman, featuring a town or trading post right on the edge of the frontier. As overall head of Star Trek production, Berman served as executive producer for the entire series. Piller initially served as second executive producer and showrunner, but left the series in 1995 to manage Star Trek: Voyager. Writer Ira Steven Behr was promoted by Berman to replace Piller as showrunner and held that role for the remainder of the series. In addition to Berman, Piller, and Behr, key writers included Robert Hewitt Wolfe, Ronald D. Moore, Peter Allan Fields, Bradley Thompson, David Weddle, Hans Beimler, and René Echevarria.\n\nSeveral actors also directed episodes, including Avery Brooks, who directed and starred in the critically acclaimed episode \"Far Beyond the Stars\".\n\nDS9 was the first television series in the Star Trek franchise to use computer-generated imagery (CGI) for exterior space shots. Although a few other television series, such as Babylon 5, were using CGI exclusively to avoid the high expense of model photography, the Star Trek franchise continued to primarily use physical models for exterior space shots because producers decided models provided more realism. DS9 continued using models where needed, such as the fourth-season premiere and the alternate-universe episode \"Shattered Mirror\". During the battle sequences between the Federation and Klingon fleets, the effects department used Playmates toys, Ertl model kits, and Hallmark Bird-of-Prey Christmas ornaments in the background to keep production costs down.\n\nThe USS Defiant was the first full-fledged starship in the Star Trek franchise to have a CGI model used in regular production. It was first built and animated by VisionArt, which was responsible for the morphing of Odo. The CGI Defiant was featured heavily in the fourth-season episode \"Starship Down\", where it battled a CGI Jem'Hadar ship in a CGI gas giant's atmosphere.\n\nThe series started using Foundation Imaging and Digital Muse in 1997 (seasons 6 and 7) for its effects as part of the ongoing storyline of the Dominion occupation of the station. The station itself remained a physical model throughout the series' seven-year run, except for the final scene of the series. In October 2006, the physical model of the station was sold for $132,000 in an auction at Christie's auction house in New York City.\n\nThe opening sequence was likewise modified in the fourth season, most notably by the introduction of CGI inserts of construction work being performed on the station's exterior by suited maintenance crews, and more docking and launching activity by ships, along with subtle colored wisps of nebulae added to the background starfield. Accordingly, the solo trumpet (preceded by a solo French horn) featured prominently in the main theme by Dennis McCarthy to accentuate the isolation of the outpost was augmented by a chorus of brass as the station attained a more bustling atmosphere following the presence of the wormhole.\n\nThe digital effects were rendered in standard definition and while the series could be released in a high-definition format, the studio preferred recreating the visual effects, rather than upscaling them."
    },
    {
      "title": "Episodes",
      "content": "Overall, 176 episodes of Star Trek: Deep Space Nine were produced, with an average run time of 43 minutes each. Geek.com calculated 126 hours of total viewing time for the series.\n\nThe show debuted in January 1993 with the double episode \"Emissary\", half-way through the sixth season of The Next Generation. This is the first time that two Star Trek franchise series aired concurrently, which continued until DS9 ended in 1999, except for late 1994, when Next Generation ended and DS9 was alone on the air. The next year, though, Star Trek: Voyager aired on the then-new United Paramount Network (UPN) so once again two shows from the franchise aired.\n\nThe most acclaimed episodes of DS9 include: \"In the Pale Moonlight\", in which Sisko wrestles with compromising his ethics to win the Dominion War; \"The Visitor\", in which an elderly Jake Sisko tries desperately to undo the loss of his father; and \"Far Beyond the Stars\", in which Sisko has a vision of himself as a writer coping with racism in 20th-century New York."
    },
    {
      "title": "Reception",
      "content": "Although DS9's ratings remained solid, it was never as successful as the syndicated Star Trek: The Next Generation. One factor was the minimal promotion for DS9, as Paramount focused its efforts on its flagship network series Star Trek: Voyager."
    },
    {
      "title": "Critical reception",
      "content": "DS9 was well received by critics, with TV Guide describing it as \"the best acted, written, produced, and altogether finest\" Star Trek series. Though debuting in the shadow of The Next Generation, DS9 achieved a considerable level of success in its own right. According to a press release through Newswire on April 7, 1999, it was the #1 syndicated show in the United States for adults 18–49 and 25–54. The characters of DS9 were featured on the cover of TV Guide ten times during its run, including several \"special issue\" editions in which a set of four versions with different covers was printed.\n\nThe series was bestowed with a number of award nominations and awards. DS9 earned 31 Emmy Award nominations during its run, including for makeup, cinematography, art direction, special effects, hairstyling, music (direction and composition), and costumes. Of these, it won two for makeup (for \"Captive Pursuit\" and \"Distant Voices\"), one for special visual effects (for \"Emissary\"), and one for its main title theme music (by composer Dennis McCarthy). DS9 was also nominated for two Hugo Awards in the category of Best Dramatic Presentation for \"The Visitor\" and \"Trials and Tribble-ations\".\n\nDeep Space Nine drew praise from African-American, Latino, and other minority viewers for its handling of the minority characters, particularly the Sisko family members. In addition, actor Alexander Siddig (who portrayed Dr. Bashir) expressed his enthusiasm for the fact that he, with his English accent, unusual screen name at the time of casting (Siddig El Fadil), and North African heritage, was a main character on a prominent television series, despite not being as easily racially identifiable to audiences as many other TV actors and characters were at the time.\n\nAndrew J. Robinson commented on DS9 not being as popular as its predecessors: \"It's not the most popular because it's the most morally ambiguous... Whenever you have characters who are gray rather than black and white... Although they are more interesting, they are more difficult for people to get a handle on. I loved DS9 because they were gray because the characters were not easily definable, but that's not for everybody\".\n\nAuthor Terry J. Erdmann commented: \"DS9 was never as popular as its two predecessors, although it arguably was a more critically acclaimed series\". In 2018, IndieWire ranked Star Trek: Deep Space Nine as the third-best science-fiction show set in outer space, while placing Star Trek (1966–1969) in eighth place and Star Trek: The Next Generation (1987–1994) in 12th place among other shows in this genre, including 18 overall.\n\nIn 2016, The Washington Post called the Dominion war arc possibly the \"richest narrative\" of the Star Trek universe, though the arc's only standout episode is \"In the Pale Moonlight\", which it ranked the fourth-best episode of all Star Trek for highlighting the moral confusion and compromises that can occur during war. In 2016, the Los Angeles Times ranked DS9 third of all Star Trek films and TV series. In 2017, Vulture ranked it the best live-action Star Trek television show. In 2019, Popular Mechanics ranked it the 16th-best science-fiction television show ever. In 2021, Variety ranked it ninth among Star Trek film and television series. In 2021, Empire ranked it the 46th-greatest television show ever, saying its seasons-long character and story arcs make it good for binge-watching."
    },
    {
      "title": "Former cast members and staff",
      "content": "In a 2007 interview with If Magazine, George Takei, who had played the character Hikaru Sulu in The Original Series, criticized DS9 for being the polar opposite of Gene Roddenberry's philosophy and vision of the future. Writer D. C. Fontana thought that as a World War II veteran Roddenberry would have appreciated the show and its dark themes. Bjo Trimble, one of the major forces behind the letter-writing campaign that helped renew The Original Series for its third season, commented that she thought Roddenberry would have \"come to like DS9, had he lived to see it\", and that \"the only reason there were not full battles in early Star Trek is lack of funds to pull it off, and lack of technology to show it. Otherwise, GR would certainly have added it; he knew what audiences liked\".\n\nRoddenberry is quoted in The Making of Star Trek DS9 as having doubts that a non-exploration show could work, and being displeased with early concepts presented to him in 1991. However, Rick Berman stated in the Star Trek: Deep Space Nine Companion that Roddenberry had given him his blessing for developing it close to his death.\n\nAt the Shore Leave 14 convention in July 1992, Majel Barrett commented on Roddenberry's involvement: \"He knew about it, but he was not about to become involved. He had done what he wanted to do and that was it. He just wished them Godspeed and go ahead. And as long as the name Star Trek is on it, yes, the estate will have a part of the action.\"\n\nRonald D. Moore, one of the series' main writers (who previously wrote for Star Trek: The Next Generation and went on to create the re-imagined Battlestar Galactica), praised the show as the \"ultimate achievement for the [Star Trek] franchise\" in 2002: I think Deep Space [Nine] was the show that really took Star Trek as far as you could take it. You have The Original Series which is a sort of a landmark, it changes everything about the way science fiction is presented on television, at least space-based science fiction. Then you have Next Generation, which for all of its legitimate achievements, is still a riff on the original. It's still sort of like, ok, it's another star ship and it's another captain – it's different, but it's still a riff on the original. Here comes Deep Space [Nine] and it just runs the table in a different way. It just says ok, you think you know what Star Trek is, let's put it on a space station, and let's make it darker. Let's make it a continuing story, and let's continually challenge your assumptions about what this American icon means. And I think it was the ultimate achievement for the franchise. Personally, I think it's the best of all of them; I think it's an amazing piece of work."
    },
    {
      "title": "Scholarly reception",
      "content": "J. Emmett Winn, in his discussion of the portrayal of Ferengi, criticized the show for \"perpetuat[ing] racial stereotypes and promot[ing] mainstream cultural assimilation as a noble, desirable quest and as the correct way for the racialized 'other' to exist\".\n\nSince the end of the series, many other scholars have addressed a variety of aspects of the show, including Victor Grech's analysis of the Cardassians as representing Nazis; Douglas Cowan's chapter looking at religion in science fiction \"Heeding the Prophet's Call: Star Trek: Deep Space Nine\"; and Roger A. Sneed's The Dreamer and The Dream: Afrofuturism and Black Religious Thought and Lisa Doris Alexander's article \"Far Beyond the Stars: The Framing of Blackness in Star Trek: Deep Space Nine\", both of which address the way Deep Space Nine broke new ground in depicting race in science fiction."
    },
    {
      "title": "Babylon 5 controversy",
      "content": "Babylon 5, another science-fiction series with a similar premise, set on a space station, aired around the same period as Deep Space Nine. Babylon 5 creator J. Michael Straczynski indicated that Paramount Television was aware of his concept as early as 1989, when he attempted to sell the show to the studio and provided them with the series bible, pilot script, artwork, lengthy character background histories, and plot synopses for 22 \"or so planned episodes taken from the overall course of the planned series\".\n\nParamount declined to produce Babylon 5, but later announced that Deep Space Nine was in development, two months after Warner Bros. announced its plans for Babylon 5. Straczynski stated that though he was confident that Deep Space Nine producer/creators Rick Berman and Michael Piller had not seen this material, he suspected that Paramount executives used his bible and scripts to steer the development of Deep Space Nine. He and Warner Bros did not file suit against Paramount, largely because Straczynski did not see it as a productive option, with negative repercussions for both TV series. In 1993, he responded to a Deep Space Nine fan who saw the lack of legal action as proof that Straczynski's allegation was unfounded with: \"If there is any (to use your term) winking and nudging going on, it's on the level of 'Okay, YOU (Paramount) know what happened, and *I* know what happened, but let's try to be grownup about it for now,' though I must say that the shapechanging thing nearly tipped me back over the edge again. If there are no more major similarities that crop up in the next few weeks or months, with luck we can continue that way.\""
    },
    {
      "title": "Music",
      "content": "On June 30, 1993, between seasons one and two, DS9 followed the example of other Star Trek series in releasing the original score from its pilot episode on CD. The title theme was also made available as a CD single. Music from several other episodes is included on The Best of Star Trek releases.\n\nCreated in the hope that Frank Sinatra Jr. would take the role, the character Vic Fontaine (instead played by 1960s heart-throb James Darren) was introduced in the sixth-season episode \"His Way\". The character was a self-aware holographic Las Vegas lounge singer and nightclub owner from the early 1960s. Vic was popular with the station's crew and performed many period songs by, among others, Frank Sinatra and Nat King Cole. Darren's role allowed him to release This One's from the Heart on August 24, 1999, featuring songs that Vic sang in the show and other period pieces.\n\nOn February 12, 2013, La La Land Records released a limited-edition, four-disc soundtrack collection entitled the Star Trek: Deep Space Nine Collection. The discs contain various cues from episodes scored by Dennis McCarthy, Jay Chattaway, David Bell, Paul Baillargeon, John Debney, Richard Bellis and Gregory Smith. Only 3000 copies of the collection were printed."
    },
    {
      "title": "Home media",
      "content": "Episodes of DS9 were made available on VHS cassettes. The series was released on VHS in the United Kingdom starting August 2, 1993. Each video cassette contained two episodes and unique artwork and character/plot information. The first VHS release in the United States came on November 19, 1996.\n\nBeginning in 1996, DS9 began releases on LaserDisc. Picture and sound quality in this format was significantly better than that of VHS cassettes; however, the Laserdisc format was discontinued in 1997. Only 30 discs, or the first 60 episodes, were released, comprising the first, second, and part of the third season before Pioneer halted its production of Star Trek discs in October 1999. DS9 LaserDiscs were also produced for the Japanese and European markets. In Japan, the first five seasons were released in a series of 10 boxed sets (two per season) before they were cancelled around the same time as the US releases. In Europe, a select few DS9 episodes were released on PAL laserdisc: \"Emissary\", also included in the boxed set Star Trek: The Pilots; \"The Way of the Warrior\", parts 1 and 2; and \"Trials and Tribble-ations\" from DS9, \"The Trouble with Tribbles\" from Star Trek: The Original Series and \"More Tribbles, More Troubles\" from Star Trek: The Animated Series.\n\nFollowing the DVD release of Star Trek: The Next Generation in 2002, DS9 was released on DVD beginning in February 2003. DS9 was released in boxed sets of one season each, which were released about one month apart. Each season contains several \"special features\", including a biographical look at a main character, information from make-up designer Michael Westmore on how various aliens were created, and interviews with cast and crew members.\n\nThe sets also include \"Section 31\" easter eggs that give a brief look at other aspects of the series. The Region 2 and 4 DVDs also came with bonus CD-ROM discs that allow users to build a \"virtual\" DS9 on their computers with each release (this software can no longer be installed, as the online registration is no longer available). On October 26, 2004, a boxed set of all seven seasons was also released.\n\nIn 2017, the complete series was released on a DVD box set, with 176 episodes on 48 discs; the set also included a variety of extras that was the same as those on the 2003 box set. An example of bonus content is a featurette \"Deep Space Nine: A Bold New Beginning\"."
    },
    {
      "title": "What We Left Behind: Looking Back at Star Trek: Deep Space Nine",
      "content": "In 2017, Ira Steven Behr announced he had reconvened much of the former cast and crew of Star Trek: Deep Space Nine for a documentary film entitled What We Left Behind (eventually released as What We Left Behind: Looking Back at Star Trek: Deep Space Nine). It had a very positive response and surpassed its fundraising goals, and this success led to ground-breaking conversions of Deep Space Nine footage into higher definition, although it caused some delays. A screening version was released in late 2018 in Hollywood, in New York City, and at the Destination Star Trek convention in the UK.\n\nBy February 2017, the documentary was partially finished, with an Indiegogo fundraising page set up to crowdsource the rest of the money needed to complete it. In addition to interviews with cast and crew, the documentary explored Deep Space Nine's legacy; Behr also reconvened the series' old writers' room to develop a script for the first episode of an imagined eighth season, which featured in the film. In 2017, a tentative release date was set for 2018. In the summer of 2018, the makers scheduled special release events starting in October 2018. A version was able to be screened at these special release events at Paramount in Hollywood and some other locations, but a decision was made to delay the media release to increase the number of high-definition conversions.\n\nIn 2017, a fundraiser for the documentary surpassed its target of nearly $150,000 within a day of going live. It went on to raise over $500,000 by March 2017. When it concluded, it had raised over $631,000 from thousands of donations.\n\nDevelopment of What We Left Behind took extra time due in part to the large amount of material for editing and technical challenges. This includes crafting special-effects footage and working with CBS to make high-definition scans. The makers also expanded the amount of footage that was remastered and innovated with a 16:9 scan of the original DS9 film.\n\nIn August 2018, it was the announced that the documentary would have original music scored by Star Trek veterans Dennis McCarthy (256 Star Trek episodes scored) and Kevin Kiner (10 Star Trek episodes scored). The documentary's producer was Kai de Mello-Folsom, in consultation with others from the original creative team including Michael Okuda, Jonathan West, and Doug Drexler.\n\nWhat We Left Behind: Looking Back at Star Trek: Deep Space Nine premiered in late 2018 at these locations:\n\n\n * Los Angeles, October 12\n * New York City, October 14\n * Birmingham, UK, October 20, during the Destination Star Trek convention\n\nThe strong community support and overall response, as well as the creative team's access to resources to create the high-definition sequences, led to a delay to increase the sequences filmed in higher definition for the documentary. Although the screening version was complete and could have been released as-is, a creative decision was made to undertake converting more sequences into high definition. One teaser showed concept art of a Star Trek spacecraft, which appears in the documentary in an animated sequence. The spacecraft design was by John Eaves, who designed many spacecraft in the franchise's television shows and theatrical films.\n\nOn May 13, 2019, a limited theatrical version was released. It played at about 800 theaters and grossed over $380,000. The film reviewed various aspects of the series from a perspective of 20 years later, explored a plot for a notional eighth season and included many clips rescanned from original footage in high definition.\n\nOn Rotten Tomatoes, it has an approval rating of 100% based on reviews from nine critics."
    },
    {
      "title": "Books",
      "content": "Pocket Books has published several dozen books based on DS9. Some of these were novelizations of memorable episodes, such as \"Emissary\", \"The Search\", and \"What You Leave Behind\", which were usually published a few days after the episode aired in the United States. Several novels were part of \"crossover\" series between the Star Trek franchises, while others were part of other franchises, but dealt with events laid out in DS9. For example, The Battle of Betazed tells of how Deanna Troi attempted to resist the Dominion occupation of her world (mentioned in the episode \"In the Pale Moonlight\"). Most focus on the station and its crew, with a notable exception being Ira Steven Behr and Robert Hewitt Wolfe's Legends of the Ferengi.\n\nThe \"Millennium\" series by Judith and Garfield Reeves-Stevens, published by Pocket Books beginning in 2000, consists of The Fall of Terok Nor (book 1), The War of the Prophets (book 2), and Inferno (book 3). The series lays out an alternate ending to DS9 (the novels were written before the series concluded) in which a second wormhole is created by the actions of a number of shady characters, destroying the station. In the space-time distortion that occurs, most of the crew are transported 25 years into the future - in which the Federation and its allies are virtually crushed, and a fanatical sect of Bajorans who worships the Pah-wraiths have ascended to power and plan to destroy the universe to bring about a higher state of existence. Inferno ends the series, as an unexpected mode of time travel is discovered after the end of the universe, allowing the DS9 crew to alter past events.\n\nAvatar, a two-part novel published on May 1, 2001, picked up where the series left off. It began season eight of DS9, into which A Stitch in Time (a biographical look at the life of Garak, written by Andrew Robinson himself) was incorporated retroactively. The events of \"What You Leave Behind\", DS9's series finale, caused some radical changes to occur in season eight. As Benjamin Sisko had entered the Celestial Temple, Colonel Kira was given command of the station, while a new commander named Elias Vaughn took over her position, Garak became the leader of postwar Cardassia, Odo helped the Changelings rebuild, and Rom presided over the Ferengi Alliance.\n\nOther publications, such as the Deep Space Nine Technical Manual and Deep Space Nine Companion, are common to most of the Trek series. The DS9 Companion contains detailed episode guides and interviews with actors, writers, directors, and other staff members.\n\nDS9 series influences were included in role-playing game reference books from Last Unicorn Games and Decipher, Inc. Additionally, several novels have also been released in audio form, narrated by René Auberjonois and Armin Shimerman, among others."
    },
    {
      "title": "Comics",
      "content": "Outside its line of novels, DS9 has been the subject of several comic books published by Malibu Comics, Wildstorm Comics, Marvel Comics, and IDW. One—Marvel's Starfleet Academy—is a spin-off detailing Nog's experiences as a cadet at the title academy in San Francisco. Another DS9 comic series became an example of licensed Star Trek works influencing each other as Tiris Jast, a major character from Wildstorm's N-Vector, appeared in the novel Avatar, Book One."
    },
    {
      "title": "Games",
      "content": "Several video games focus on DS9. The first is Crossroads of Time, a 1995 side-scrolling game for the Super NES and Genesis. It takes place around the time of the series premiere, borrowing some stories from early episodes such as \"Past Prologue\" and creating others. A number of problems reportedly impeded the game's development process, and it was met with mixed reactions.\n\nThree DS9-themed games were released for the PC: Harbinger in 1996, The Fallen in 2000, and Dominion Wars in 2001. A board game was released as part of the now-defunct \"component board game\" series, which includes a compatible board game for Star Trek: The Next Generation. DS9's role-playing book is one of several that failed to be released into wide circulation when Decipher, then publisher of the Star Trek role-playing game, discontinued its line.\n\nDS9 is featured prominently in the Star Trek Customizable Card Game, particularly its second edition. In the first edition, Deep Space Nine is the titular fifth set, followed by one titled The Dominion and several other DS9-themed sets. In the second edition, two types of cards are used for the United Federation of Planets, which may be placed at Earth or Deep Space Nine. The Ferengi, Dominion, Cardassian, Bajoran, and Maquis affiliations are primarily DS9-derived material, while the Klingon affiliation also borrows strongly from it.\n\nThe PC game Star Trek Online features Deep Space Nine as a trading hub. The lower ring (the Promenade) contains vendors, and the upper ring offers views of surrounding space. The expansion Victory is Life is focused around DS9 and the Gamma Quadrant.\n\nIn 2019, the Star Trek: Deep Space Nine – Red Alert video-game gambling machine was announced, with a tie-in promotion to the Las Vegas Star Trek convention."
    },
    {
      "title": "Other merchandising",
      "content": "Along with the rest of the Star Trek franchise, DS9 has had much merchandising including Action figures, keychains, and models. The station itself is the subject of many of these items. Paramount sells Starfleet uniforms, including the so-called \"DS9-style\" uniform with various division colors. The licensed product produced by Playmates Toys was directed by Karl Aaronian, who was responsible for helming the development of the Teenage Mutant Ninja Turtles. Aaronian called upon sculptors such as Scott Hensey of Anaglyph Studios, Steve Varner of Varner Studios, Art Asylum, and relied on graphic design from a number of design and development studios, including White Design, PANGEA, McHale Design, and Robinson-Clarke. The writing for the toy line was penned by John Schulte, John Besmehn, and Cheryl Ann Wong — all of PANGEA. The company was also responsible for generating blueprints of vessels and other in-pack incentives for the toy line.\n\nDS9 was represented at Star Trek: The Experience, an attraction at the Las Vegas Hilton with an immersive reenactment of the DS9 universe, as an adventure on the bridge of the Enterprise and on DS9. Staffed by costumed actors, Quark's Bar and Restaurant served Star Trek-style cuisine, and hosted gatherings such as conventions. The Shopping Promenade sold souvenirs such as \"official\" Starfleet uniforms and action figures. The attraction closed in September 2008."
    }
  ]
}