{
  "title": "Star Trek: Enterprise",
  "parentTitle": "Star Trek",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Created By",
      "value": "Rick Berman\n\nBrannon Braga"
    },
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    },
    {
      "type": "number",
      "label": "No. of Seasons",
      "value": 4
    },
    {
      "type": "number",
      "label": "No. of Episodes",
      "value": 98
    }
  ],
  "content": "Star Trek: Enterprise, originally titled simply Enterprise for its first two seasons, is an American science fiction television series created by Rick Berman and Brannon Braga. It originally aired from September 26, 2001 to May 13, 2005 on UPN. The sixth series in the Star Trek franchise, it is a prequel to Star Trek: The Original Series. Set in the 22nd century, a hundred years before the events of The Original Series, it follows the adventures of the Enterprise, Earth's first starship capable of traveling at warp five, as it explores the galaxy and encounters various alien species.\n\nFollowing the culmination of Star Trek: Deep Space Nine and with Star Trek: Voyager scheduled to end, Paramount asked Braga and Berman to create a new series to continue the franchise. Rather than setting it in the 24th century alongside Deep Space Nine and Voyager, they decided to set it in an earlier period, allowing them to explore new parts of the Star Trek fictional universe. Wanting a more basic, relatable, character-driven series, Berman and Braga concentrated on a core trio: Captain Jonathan Archer (played by Scott Bakula), Commander Trip Tucker (Connor Trinneer), and Sub-commander T'Pol (Jolene Blalock).\n\nThe show broke with Star Trek convention in several ways. In addition to dropping the Star Trek prefix, Enterprise used the pop-influenced song \"Faith of the Heart\" (performed by Russell Watson) as its theme. It was filmed on the Paramount lot in Los Angeles, California, on the same stages that housed the Star Trek series and films since the abandoned Star Trek: Phase II in the late 1970s.\n\nThe first two seasons were characterized by stand-alone episodes that explored topics like humanity's early relations with the Vulcans, and first encounters with the Klingons and Andorians, aliens already familiar to franchise viewers. Seeking to attract a wider audience, UPN called for changes for Enterprise 's third season. It was renamed Star Trek: Enterprise, and was changed to focus on action-driven plots and a single, serialized storyline: the crew's mission to prevent the Earth being destroyed by a newly introduced alien species, the Xindi. In 2005, UPN cancelled the series after its fourth season, despite a fan-led campaign to continue it. It was the first time in 18 years that no new Star Trek television series episodes would be produced, the beginning of a hiatus that lasted until the launch of Star Trek: Discovery in 2017, another prequel to Star Trek: The Original Series and chronological sequel to Enterprise.",
  "sections": [
    {
      "title": "General",
      "content": "Star Trek: Enterprise follows the adventures of the crew of the first starship Enterprise, designation NX-01. They are the first deep space explorers in Starfleet, using the first warp five capable vessel. The Vulcans have withheld advanced technology from humanity since their first contact, concerned that humans were not ready for it. This has delayed human space exploration and caused resentment in Starfleet test pilot Jonathan Archer, whose father developed the Warp 5 engine but did not live to see it used.\n\nThe Enterprise was equipped with less-advanced technologies than those seen in previous series (which occurred later on the Star Trek timeline). It had no tractor beam, but utilized grappler cables; and used missiles instead of particle weapons (see Weapons in Star Trek); in Season 1, phase cannons were added, similar to those on the Enterprise in The Original Series. It had only limited means of synthesizing foods and other consumable items. Communications Officer Linguist Hoshi Sato's expertise in linguistics helps compensate for the lack of the advanced universal translator.\n\nThe series also showed the crew making first contacts with a number of races previously seen in the franchise. The Klingons, who appear in the pilot \"Broken Bow,\" have the ridged makeup seen in the movie franchise and from Star Trek: The Next Generation onwards (excluding Star Trek: Discovery), rather than the smooth-headed versions seen in Star Trek: The Original Series. Berman and Braga attributed this change to advancements in makeup, and felt that such contradictions in continuity were unavoidable. The change in the Klingons' appearance was eventually justified by attributing it to a plague caused by genetic experimentation in the two part arc of \"Affliction\" and \"Divergence.\" Electronics in Enterprise were also more compact than those of previous (future) series, as advances in real-world technology made devices seen in The Original Series and Voyager seem anachronistically oversized.\n\nThe series's first season emphasized a core trio of characters: Jonathan Archer, T'Pol, and Trip Tucker. Other main characters had primary roles in particular episodes, such as \"Dear Doctor\" and \"Fight or Flight.\" The second season saw deepening relationships between characters—for example, the friendship between Tucker and Reed, seen in episodes such as \"Two Days and Two Nights\"; and the relationship between Tucker and T'Pol, which begins contentiously but leads to romance in later seasons."
    },
    {
      "title": "Temporal Cold War",
      "content": "The addition of a futuristic Temporal Cold War element was seen as a \"nod to mystery\" by Rick Berman, who sought to add an element of The X-Files to the series. Berman decided that the full story of the war would be revealed over the course of several years. At the start of the second season, Braga said that the Temporal Cold War storyline would continue to be included if viewers were still interested, but later described it as \"strangulating.\" Initially featured in the pilot episode, \"Broken Bow,\" it featured the Cabal, an organization composed of members of the alien race known as the Suliban, being manipulated by an unknown humanoid figure from the future, nicknamed \"Future Guy\" by viewers—a moniker later adopted by the series's writers. At the start of the series, Braga said that they did not have a plan for who the character would turn out to be. Ten years after the end of the series, Braga stated that Future Guy was Archer manipulating his own timeline; he and Berman had previously stated that the character was intended to be a Romulan.\n\nCrewman Daniels (Matt Winston), introduced in the episode \"Cold Front,\" was revealed as an operative from 900 years in the future who was fighting against the forces which included the Suliban. Archer found that he was being manipulated by those forces, as Enterprise was blamed for the destruction of a mining colony in \"Shockwave.\"\n\nIn the third season, an escalation of the Temporal Cold War introduced the Xindi and dealt with the repercussions of their attack on Earth. Daniels explained Archer's importance in history during a trip to the future in \"Azati Prime\" to witness the final battle against the Sphere Builders—aliens who were also manipulating the Xindi into attacking Earth during Archer's time period. In the closing phase of the Temporal Cold War, Daniels sent the Enterprise back to the 1940s, following a temporal incursion by aliens who had altered the outcome of World War II, permitting Nazi Germany to invade the United States. Once Vosk, the leader of the aliens, was killed, the timeline corrected itself. Vosk's actions had turned the Cold War into an actual war raging through time, but the Enterprise killed Vosk before he could initiate the wars and all of the damage done throughout history was undone. Afterwards, Daniels believed that the Temporal Cold War was finally coming to an end as a result.\n\nIn Star Trek: Discovery Season 3, it is mentioned that after the Temporal Wars all time travel was outlawed and all existing time travel devices were destroyed. The Guardian of Forever states in \"Terra Firma\" that the various factions used him to alter his own history and to kill people, so he moved to another planet and went into hiding."
    },
    {
      "title": "The Xindi",
      "content": "Braga and Berman created the season-long Xindi story arc, which began with the second-season finale, \"The Expanse,\" and ran throughout the third season until it was resolved in the episode \"Zero Hour.\" It opens with an attack on Earth by a mysterious space probe that kills seven million people in a destructive swath stretching through Florida to Venezuela. As a result, the Enterprise is redirected to unexplored regions of space to find the Xindi and stop a further attack that will destroy Earth. Although certain elements were preplanned, including the success of the mission against the Xindi, others, such as the details of the actual enemy race, were not. At the time of the initial development, Berman and Braga were uncertain if the storyline would last for a whole season or for just half a season.\n\nThe Xindi themselves were developed from on-set discussions with the writers and the actors who portrayed them. Six species that make up the Xindi were created in this manner. One was originally called \"humanoid Xindi,\" but after further discussions they were renamed \"primate Xindi.\" The first part of the third season saw the crew searching the Delphic Expanse, attempting to find clues that would lead them to the Xindi. In order to complete this mission, they took on additional crew members in the form of Military Assault Command Operations (abbreviated as MACO) soldiers, due to the increased military nature of the task."
    },
    {
      "title": "Founding of the Federation",
      "content": "The birth of the Federation was first hinted at during part two of \"Shockwave,\" which opened the second season. When Manny Coto was made showrunner for the fourth season, he decided that the focus of the series should be to link to that event. With this in mind, his intention was for this season to move towards that goal. Judith and Garfield Reeves-Stevens were hired as writers on Enterprise because they wrote the non-canon novel Federation and after it was suggested by producer Mike Sussman. The episodes for the fourth season were intended to lay the framework for the later creation of the Federation. This was something that the cast said that they would have liked to see more of, with Scott Bakula later saying \"I would have loved to have been able to explore that journey to the Federation and their creation of it ... to a greater extent. And I think that would have been, um, just more fun for the audience ... just better, longer storytelling.\"\n\nIn \"United,\" the founding races of the Federation - the humans, the Vulcans, the Andorians and the Tellarites - worked together for the first time to defeat a Romulan plot. In \"Demons,\" the xenophobic Terra Prime movement is introduced, which Coto felt was the final element of human nature that must be defeated before the Federation could be formed. The foundation of the Federation was shown on screen in the final episode of the series, \"These Are the Voyages...,\" which was set several years after the rest of the season."
    },
    {
      "title": "Cast and characters",
      "content": "\n * Jonathan Archer, played by Scott Bakula, is Captain of Earth's first Warp 5 starship, Enterprise. His father, Henry, designed its engine, giving Archer a personal connection to his ship. He was envisaged as being a cross between Chuck Yeager and Han Solo by executive producer Rick Berman, while Brannon Braga said that he was more \"laidback and relatable\". The character was initially openly prejudiced against the Vulcans, but this softens over time.\n * T'Pol, played by Jolene Blalock, is Science Officer of Enterprise, originally attached to Enterprise by the Vulcan High Command to keep the humans out of trouble. She becomes loyal to Archer, leaving her position in the High Command to accompany him to find the Xindi, and later joins Starfleet. In later seasons, she forms a romantic relationship with Tucker.\n * Charles \"Trip\" Tucker III, played by Connor Trinneer, is Chief Engineer of Enterprise and a longtime friend of Captain Archer. He starts the series as a relatively modest personality, but becomes more seasoned and outspoken as the series runs. In later seasons, he forms a romantic relationship with T'Pol.\n * Malcolm Reed, played by Dominic Keating, is Tactical Officer of Enterprise, also in charge of ship security. Reed comes from a long line of Royal Navy men, but joined Starfleet because of his fear of drowning. An extremely taciturn man, his own family, when asked, could not name his favorite food (pineapple).\n * Hoshi Sato, played by Linda Park, is Communications Officer of Enterprise and linguistic genius. Capable of learning alien languages extremely quickly, Hoshi serves as the interpreter between the crew of Enterprise and new alien species, even after the universal translator is on-line. She suffered anxiety about her place on board originally, but exposure to frequent danger helped her realize her value to the ship. Her confidence increases to the point Archer leaves her in command of Enterprise and she faces down the President of United Earth in \"These Are The Voyages ...\"\n * Travis Mayweather, played by Anthony Montgomery, is the Helmsman of Enterprise. A \"space boomer,\" Travis is unique on Enterprise, having been born in space. Son of a freighter captain, Travis knows many of the alien species as well as locations that Earth traders frequent. As Enterprise moves farther and farther from Earth, his value in this area lessens, but his skill at the helm is constantly appreciated, making him the pilot of choice for many missions.\n * Phlox, played by John Billingsley, is Ship's Physician (not Chief Medical Officer, as he is not in Starfleet) of Enterprise. A Denobulan member of the Inter-Species Medical Exchange, he is brought aboard Enterprise to care for the Klingon passenger during the ship's first mission. He then volunteers to stay on, delighting in the experience of humanity taking its first steps onto the galactic stage. An exceedingly cheerful alien, Dr. Phlox uses many animals and naturalistic cures in his practice, in addition to the usual technological methods."
    },
    {
      "title": "Conception",
      "content": "\n\nPrior to the end of Star Trek: Voyager and following the end of Star Trek: Deep Space Nine in June 1999, Paramount approached Rick Berman and Brannon Braga about the production of a fifth Star Trek series, either to overlap with the final season of Voyager or to immediately follow. Berman had previously created Star Trek: Deep Space Nine along with Michael Piller, Voyager with Piller and Jeri Taylor, and had been wanting to work with Braga on a series concept. While the fans online were suggesting that it could either be based on Starfleet Academy or the adventures of Hikaru Sulu, the producers took care that no information was leaked to reveal what the concept was going to be. They later revealed that the Academy idea was never properly considered.\n\nInstead, they opted to create a prequel to The Original Series set after the events in the film Star Trek: First Contact, as Braga and Berman felt it was a period in the Star Trek universe which was unexplored. The idea was for the series to portray the first deep space explorers in the Star Trek universe, with Braga explaining that everything would be new to the crew and that since the setting was closer in the timeframe to the modern day, their reactions to situations would be more contemporary. As part of this, they sought feedback from members of the submarine service of the United States Navy, which was reflected in certain design work on the series such as the Star Trek uniforms. The network executives needed to be convinced of the viability of a prequel series, as they had assumed that the series would take the franchise further into the future. The initial idea was for the first season to be almost entirely set on Earth as the Enterprise was rushed to completion to respond to first contact with the Klingon, and the crew being put together. This idea was rejected by the studio executives, and these story elements were instead restricted to the pilot, \"Broken Bow.\"\n\nThey sought to make Enterprise more character-driven than the previous series in the Star Trek franchise, and hoped that this would gain viewers who had watched The Next Generation but had lost interest with Deep Space Nine and Voyager. It was intended to link the series directly into The Original Series by having T'Pau, who had previously appeared in the episode \"Amok Time,\" as a main character. Instead, this character was developed into an original Vulcan character, T'Pol. Berman explained his vision for the series at launch, saying, \"We'll be seeing humanity when they truly are going where no man has gone before. We are seeing people who don't take meeting aliens as just another part of the job. It's not routine. Nothing is routine. Also, by bringing it back 200 years from Voyager, we're making the characters closer to the present, and by doing that they can be a little bit more accessible and a little bit more flawed and a little bit more familiar to you and me.\"\n\nHe said that this setting would combine elements of The Original Series while having \"a lot of fresh and new elements in it.\" It was initially considered whether or not to have Enterprise overlap with the final season of Voyager, but it was decided that there would be a gap in broadcasting between the two series, as Berman was concerned with the \"oversaturation\" of the franchise. But he hoped that the \"dramatic change\" in Enterprise would mean that new viewers were drawn in to watch it. As part of this change, the decision was made to drop \"Star Trek\" from the title, but Berman explained that \"if there's any one word that says Star Trek without actually saying Star Trek, that word is Enterprise.\" This title lasted until the third episode of season three, \"Extinction,\" when the series was renamed Star Trek: Enterprise as demanded by Paramount Television executives in an effort to reconnect the series with the fans of the franchise."
    },
    {
      "title": "Crew",
      "content": "In addition to the executive producers, a number of former Star Trek crew members joined the new series. Herman F. Zimmerman was recruited as Production Designer/Illustrator, having worked on Trek projects throughout The Next Generation, Deep Space Nine and the feature films. Marvin V. Rush resumed his role as Director of Photography, having been involved with Trek since the third season of The Next Generation. Working with him were Douglas Knapp and William Peets as Camera Operator and Chief Lighting Technician respectively. Both had previously worked on Voyager. Another alumna from the previous series was Louise Dorton, who started in the first season of that show as Set Designer, but joined Enterprise as Art Director. Andre Bormanis, a science consultant and writer on The Next Generation, Deep Space Nine and Voyager, was brought on as a staff writer.\n\nJohn Eaves, who worked on Star Trek: First Contact, became Senior Illustrator for the show, and Doug Drexler worked under him as Junior Illustrator. Michael Westmore was once again the Head of Make-up for the series, and was joined by his daughter-in-law Suzanne Westmore, who was previously credited on Voyager as Suzanne Diaz. Ronald B. Moore, who worked on Trek productions since The Next Generation as well as the feature film Star Trek Generations, returned as Visual Effectors Supervisor. Carol Kuntz was the Costume Supervisor, a position she had held since the production of The Next Generation. Charlotte A. Parker was Enterprise's Hair Stylist, previously credited as Charlotte A. Gravenor on Voyager. Michael Okuda continued as Scenic Arts Supervisor, and as technical consultant to the writing staff. A number of directors of episodes in other Star Trek series returned to work on Enterprise. These included former Star Trek alumni, such as LeVar Burton, who played Geordi La Forge from The Next Generation; and Robert Duncan McNeill, who played Tom Paris on Voyager. Roxann Dawson was also announced to direct at the start of the series, having previously played B'Elanna Torres, also on Voyager. She went on to direct ten episodes of the series. After the first season, most of the series's writers were fired by Braga, except Chris Black who was promoted to co-executive producer for the second season. Former The X-Files and The Lone Gunmen writer John Shiban joined the writing team and was also named co-executive producer. Berman called the recruitment of Shiban a \"coup\" for the series. Shiban stayed for the second season, while Black left after the third.\n\nThe fourth season of Enterprise saw a change to the crew's leadership, with Manny Coto taking over as executive producer and showrunner from Braga and Berman. He had joined the writing staff in the third season, and wrote the well-received episode \"Similitude.\" He was a fan of The Original Series and sought to link Enterprise more closely to it. He brought writers Judith and Garfield Reeves-Stevens onto Enterprise, who previously wrote books on the franchise's production, and worked with William Shatner on his Shatnerverse series of Star Trek novels. Braga and Berman remained on staff, with Coto describing the situation as having \"three showrunners.\" Coto set the direction for the final season, while the other two gave notes and feedback."
    },
    {
      "title": "Casting",
      "content": "The crew issued a casting call for the main roles in the series, and Keating and Billingsley made immediate impressions on the casting director and staff. Braga said that they knew they were right for those roles \"right off the bat.\" Keating had previously auditioned for a role on Voyager two years prior, but Berman wanted to keep him for a future main role, saying that when he auditioned for Reed the actor \"nailed it,\" although there were discussions about the accent he should be using, with Keating suggesting one from the north of England which the producers mistook for Scottish. In the end, they chose to go with Keating's natural voice. He also praised the casting processes involving Trinneer, Park and Billingsley, calling the latter \"perfect\" in his role as Doctor Phlox. Park was not required to audition, but instead was hired on the basis of her performance in a scene she appeared in The WB series Popular alongside Anthony Montgomery – despite that the character was intended to be older until Park was cast. Montgomery had previously auditioned to play Tuvok's son in Voyager, and after being chosen for the part of Travis Mayweather, he elected to take the part instead of a role in a low-budget movie he had been offered.\n\nThe longest casting process was that of Bakula as Archer, due to the extended contract negotiations that took place, which added to a delay in production. He had been sought for the part by the executive producers, and although Bakula wanted to do the show, he \"wanted to feel that [he] was making a good deal and that everyone was going to work together to make this a good experience.\" He had signed up for a pilot for CBS called Late Bloomers before agreeing to appear on Enterprise. One of the reasons he agreed to join the cast of Enterprise was that he had previously worked with Kerry McCluggage, one of the co-founders of UPN, on Quantum Leap. Berman later admitted that they did not have an alternative in mind if Bakula decided to turn down the role. Braga explained that the most difficult casting was that for T'Pol, as they were seeking a Kim Cattrall type. Blalock and Marjorie Monaghan were among the final three to be considered for the part, with Blalock gaining the role, despite her agents rejecting requests for her to attend auditions early in the casting process. By the time that Blalock auditioned in the final group, the crew had seen hundreds of actresses, according to Berman. His main issue at the time was to find a \"beautiful woman who can act and doesn't want to go right into feature films.\" Blalock was excited about the casting as she had been a lifelong Star Trek fan, with her favourite character being Spock.\n\nBakula's casting as Archer was announced via press release on May 10, 2001. However, some of the British media mistook the announcement for Bakula taking over from Patrick Stewart. Details of the rest of the main cast were released on May 15, with the rest of the character details publicised the following day.\n\nSome recurring characters were played by actors who had previously appeared in Star Trek productions, with Jeffrey Combs portraying the Andorian Shran, making his first appearance in the season one episode \"The Andorian Incident.\" He had previously portrayed the Vorta Weyoun as well as the Ferengi Brunt on Deep Space Nine. Vaughn Armstrong, who played Admiral Maxwell Forrest, had previously appeared in a number of roles in various Trek productions since his first part as a Klingon in The Next Generation episode \"Heart of Glory\"; by the end of the Enterprise run, he had appeared as 13 different characters in total. Randy Oglesby, Rick Worthy and Scott MacDonald had also appeared in a variety of roles within the franchise before taking on the recurring parts of Xindi council members throughout season three.\n\nThroughout the production on Enterprise, there were rumours that William Shatner would make a guest appearance. During season four, this idea was raised once again when Reeves-Stevens suggested that the tantalus field (previously thought to be a raygun) seen in The Original Series episode \"Mirror, Mirror\" actually sent its victims back in time to a penal colony in the regular universe. This in turn would allow Shatner to reprise his role as the Mirror Universe version of Captain James T. Kirk. Shatner pitched this to Braga and Berman, but instead they pitched another idea back to the actor in which he could play the chef of the Enterprise, who was taken to the future by Daniels and required to impersonate Kirk. After they could not settle on an idea, the Mirror Universe concept was reworked into the two-part episode \"In a Mirror, Darkly.\""
    },
    {
      "title": "Sets and filming",
      "content": "The majority of the filming took place on the Paramount Pictures lot in Los Angeles, California. The temporary sets for the show were housed on stages 8 and 9; while the permanent sets including the bridge, engine room and the arsenal were located on stage 18. The engineering set itself was built across two levels with the large warp drive taking up the majority of the space. Stages 8 and 9 had housed sets for the earlier Star Trek series since production was started on the abandoned Star Trek: Phase II during the late 1970s. They were subsequently used for the films Star Trek: The Motion Picture, Star Trek II: The Wrath of Khan, Star Trek III: The Search for Spock and Star Trek IV: The Voyage Home before being used for The Next Generation and Voyager. Stage 18 had not been previously used for the production of any Star Trek series or films.\n\nDuring the course of filming the pilot, between 130 and 150 members of staff worked on constructing the sets; this reduced to 20 to 25 crew members when the show went to series. These teams were led by construction coordinator Tom Arp, who had previously worked on Deep Space Nine and a number of Star Trek films in the same capacity. Although a number of episodes required specific sets to be built from scratch, the team would save certain elements to enable them to be reused in later episodes. The production had a warehouse in Burbank to store those pieces while they were not being used. Midway through the third season, from \"Exile\" onwards, the series started to be broadcast in 1080i high-definition television. Alongside Jake 2.0, it was one of the first two series on UPN to be broadcast in high-definition. The show contains over 4,214 minutes of special effects, dialogue, and other scenes. Although it was broadcast in high definition at 1080i, it was not released on 1080p blu-ray until later. An example of high definition is the 2017 Blu-ray collection of the full series called Enterprise: The Full Journey.\n\nUntil the start of the fourth season, the series was shot on traditional film stock. The first three seasons were shot on wide screen 35mm film with an aspect ratio of 1.78:1, and it was 3-perf Super 35mm film. After Rush began testing a Sony digital camera on the standing sets for two days prior to production on \"Storm Front\" and demonstrated the footage to Braga and Berman, the decision was made to switch to digital production. Rush felt that the audience would not see a great deal of difference as the footage could be shot in a way to look the same as the earlier seasons; but he felt that filming in high-definition video would be a benefit because of the additional detail that could be seen. At the time, this was cutting-edge for a TV show, allowing the production team improved low-light performance and enabling more shooting compared to chemical films. A Sony HDW-F900 CineAlta High-Definition camera was used, and the recording technology also used Sony' CineAlta 24P, a trademarked name of that company. The decision to move to Sony's technology was a unanimous agreement of the show's three executive producers, and was also supported by the director of photography. Season four's Blu-ray release in 1080p has been praised as sharp and with satisfying color, and the best-looking of the seasons. The fourth season has been released multiple times, and as a combined full-series set in January 2017."
    },
    {
      "title": "Music",
      "content": "Dennis McCarthy was recruited by the production team to score the pilot, \"Broken Bow\". He had scored other episodes of the franchise, including the pilot of The Next Generation, \"Encounter at Farpoint\", and won an Emmy Award for his work on the Voyager episode \"Heroes and Demons\". His work on \"Broken Bow\" was subsequently released in the United States on CD by Decca Records. Other composers who worked on Enterprise included Paul Ballinger, David Bell, Jay Chattaway, John Frizzell, Kevin Kiner, Mark McKenzie, Velton Ray Bunch and Brian Tyler."
    },
    {
      "title": "Opening sequence and theme song",
      "content": "The franchise was known for typically using orchestral themes, but Berman said that the theme tune would be more \"contemporary\" than heard in previous series and a \"little hipper\". The theme was revealed to be a cover of the Rod Stewart single \"Faith of the Heart\", by British tenor Russell Watson. Stewart's song had originally appeared on the soundtrack to the 1998 film Patch Adams. For the use in Enterprise, it was retitled to \"Where My Heart Will Take Me\", but prompted a negative reaction from existing Star Trek fans. These included an online petition to have the song removed, and there was a protest held outside of Paramount Studios. Executive producers Braga and Berman both defended the choice, with Berman saying that the fan response was split over the song while Braga said that some people found the song \"uplifting\". The U2 song 'Beautiful Day' had been used as a temp track on the test reels before \"Faith of the Heart\" was chosen.\n\nIllustrator John Eaves created a drawing of a number of real-world and Star Trek vessels leaving Earth, which was subsequently turned into a poster by Dan Madsen at the Star Trek Communicator magazine. Eaves gave copies of this poster to Braga and Berman, with Berman suggesting the possibility that this could be a good concept for an opening sequence. The aim of the sequence was to follow the evolution of exploration, flight and space flight. As suggested by Eaves' poster, it included real-world vessels such as the frigate HMS Enterprise, hot air balloon Montgolfier, Wright Flyer III, Spirit of St. Louis and Bell X-1, as well as the Lunar Module Eagle, Space Shuttle Enterprise, Mars rover Sojourner and International Space Station. Star Trek vessels featured included two new designs by Eaves as well as the first warp vessel, the Phoenix, and the Enterprise (NX-01). The Phoenix spacecraft was presented in the 1996 feature film Star Trek: First Contact as Earth's first warp vessel, whose inaugural warp flight triggered first contact with the Vulcans. The eighty second title sequence was produced by Montgomery Co. Creative, Culver City, California.\n\nThe two-part episode In a Mirror, Darkly uses a different opening sequence than the remainder of the series, reflecting themes of war and conquest in the Mirror Universe."
    },
    {
      "title": "Cancellation",
      "content": "The series was considered for cancellation at the end of the second season, with Paramount executives instead requesting a number of changes to renew it following a letter-writing campaign from fans. These included a change of name to Star Trek: Enterprise early in the third season; and a new action-oriented plot, which resulted in the development of the Xindi story line. There was a major turnover of staff at Paramount in June 2004, with Jonathan Dolgen, the head of entertainment at parent company Viacom, quitting following the departure of Viacom President Mel Karmazin. Dolgen was described by Bakula as being the \"huge Star Trek guy\" at Paramount, and his departure was followed by several other staff members leaving. Fans were resigned to cancellation at the end of the third season, but were surprised when the series was renewed, due in part to a reduction in the fees Paramount was charging UPN per episode. However, Enterprise was moved to a slot on Friday evening, the same night on which The Original Series was broadcast during its own third season before it was cancelled. In an interview, Bakula lamented that Enterprise was dependent on a single network; whereas, every other Star Trek series relied on syndication. He contributed this to a major factor in their cancellation with the quote, \"We were subject to the whims of the network and the advertisers\".\n\nOn February 3, 2005, it was announced that Enterprise had been canceled. This news was passed to the cast and crew during the sixth day of production on \"In a Mirror, Darkly\". The end of the series marked the first time in 18 years that no new Star Trek episodes were scheduled for broadcast, and Enterprise was the first live-action series of the franchise since The Original Series to last fewer than seven years. Braga said at a talk to students in Los Angeles shortly after the news of the cancellation was released that \"After 18 straight years on the air and 750-some episodes, the current run of Star Trek is over. Which is a good thing. It needs a rest\". He added that he was not sure how long Star Trek would be off the air, but called it a \"gestation\" instead of a \"cancellation\".\n\nFan myth suggests that Russell T Davies, showrunner of the then-upcoming revived series of Doctor Who, was in talks about producing a crossover episode in which the Ninth Doctor landed the TARDIS on board the NX-01, but these plans were abandoned with the cancellation of Enterprise. This was based on a misunderstanding of the quote: The \"we\" reported to have been discussing a crossover was a reference to Davies talking to the Doctor Who production team about his desire to write a crossover, not to any discussions between the BBC and Paramount.\n\nThe cancellation brought protests by fans—at Paramount Pictures, around the world, and online. A TrekUnited.com website was set up to raise funds for a fifth season, but failed to do so and refunded the donations after the unsuccessful campaign. $32 million was raised. In 2013, the possibility of a fifth season was still being discussed, with Braga suggesting that fans could prompt Netflix to produce it by watching the existing four seasons on the service. This resulted in a Facebook campaign to promote a fifth season.\n\nDespite the cancellation, Paramount remained optimistic. Studio head David Stapf \"looked forward to a new chapter of this enduring franchise in the future.\" Berman and screenwriter Erik Jendrensen developed a concept for a new film taking place after Enterprise but before the 1960s television show. Meanwhile, Paramount asked Roberto Orci for ideas to revive the franchise, resulting in the production of a reboot film set in an alternate timeline from the 1966–2005 franchise, simply titled Star Trek, released in May 2009 and directed by J. J. Abrams."
    },
    {
      "title": "Season five",
      "content": "At the time of the cancellation, Coto had hoped for renewal and already started to make plans for the fifth season. These included the expectation that the show would begin to cover the buildup to the Romulan War, as well as continue to link to The Original Series with references to things such as the cloud city of Stratos, as seen in \"The Cloud Minders\". Another feature Coto planned was to have a \"miniseries within a series\", with four or five episodes devoted to following up on events from the Mirror Universe episode \"In a Mirror, Darkly\". The producers also intended to bring Jeffrey Combs onto the series as a regular by placing his recurring Andorian character Shran on the bridge of the Enterprise in an advisory capacity.\n\nWork had already begun on an episode referred to by Coto as \"Kilkenny Cats\", which would have seen the return of Larry Niven's Kzinti, usually seen in his Known Space novels, and who had previously appeared in the Star Trek: The Animated Series episode \"The Slaver Weapon\". At the same time Enterprise was broadcast, writer Jimmy Diggs was pursuing the idea of a CGI animated film, Star Trek: Lions of the Night, with Captain Hikaru Sulu leading the Starship Enterprise and attempting to prevent a Kzinti invasion of the Federation. Coto's episode was based on a similar premise, with Diggs brought onto the Enterprise team to work on the episode. Production had begun on the new Kzinti ships for \"Kilkenny Cats\", with Josh Finney commissioned.\n\nThere have been numerous calls and a campaign for the series to be re-booted and a fifth season made, and some of the actors have indicated their willingness. A lot of this is based on the fact that as one of the more recent Trek shows, the actors are all still alive and active in the industry,   and that the show was never really properly finished."
    },
    {
      "title": "Time slots",
      "content": "The pilot, \"Broken Bow\", was watched by 12.5 million viewers on the first broadcast on UPN. This was during the first full week of the new season on American television, and it was felt at the time that the combination of Enterprise alongside Buffy the Vampire Slayer and Roswell would help to cross-promote each other due to the science fiction and fantasy genre links. This even included a cross-over episode of Roswell with a character from that series auditioning before Jonathan Frakes for a role on Enterprise. After the first few weeks of episodes of Enterprise, the ratings were considered to be solid enough and the expectation was that the series would run for seven seasons in the same manner as The Next Generation, Deep Space Nine and Voyager. However, the viewing figures began to decrease towards the end of the season.\n\nChanges were made for the third season, with the introduction of the season-long Xindi storyline. This improved the reviews that the series was receiving, and the viewers in the 18 to 35 demographics, but the overall ratings continued to decrease. UPN cut the 26 episode order for the third season to 24, meaning that if 24 episodes were created for the fourth season as well then they would have the 100 episodes needed for syndication. As well as a move to Friday nights, the fourth season was shortened further to 22 episodes, meaning that at cancellation there were 98 episodes produced in total. At the time of cancellation, Enterprise remained the highest rated drama series on UPN. The series went immediately into broadcast syndication; the arrangements having been made by UPN prior to the cancellation. It is distributed by CBS Television Distribution."
    },
    {
      "title": "Syndication and foreign broadcast",
      "content": "In the UK, the series was first broadcast on satellite TV channel Sky One, before airing on Channel 4 during July 2002, becoming the first Star Trek series not to be broadcast terrestrially by the BBC. In Australia, the series was broadcast on the Nine Network. All four seasons of Enterprise entered broadcast syndication in the United States during the week of September 17, 2005. The episodes were initially aired out of sequence, with episodes from the third and fourth season being broadcast directly after episodes from the first. Episodes from the second season were not planned to air until September 2006."
    },
    {
      "title": "Home media",
      "content": "Paramount Home Entertainment released the first season of Enterprise on VHS cassette in both the United Kingdom and Ireland, during 2002. In each of the thirteen volumes, there were two episodes on each tape. The first home media release of Enterprise in the United States was of the full first season on DVD, which was released by Paramount on May 3, 2005. The remaining seasons were released over the course of the next months, with season four brought out in November of that year. In addition, 2005 saw the release of the complete series as a DVD box-set.\n\nEnterprise was the third Star Trek series to be released in high definition on Blu-ray by Paramount Home Media Distribution (the show was produced by the original Paramount Television, and therefore was released under the label CBS Home Entertainment) following the earlier releases of Star Trek: The Original Series and Star Trek: The Next Generation, with season one delivered on March 26, 2013. The fans of the franchise were asked for feedback on potential covers for the first season release, but as there was no clear winner, a new design was created based on the feedback received. The second season was released on August 20, 2013, the third season was on January 7, 2014, and the final season on April 29, 2014. The Blu-ray releases featured both the same additional features as the DVD release, in addition to new features exclusive to these releases. In January 2017 a new 24 disc Blu-ray set of the whole series was released. This set includes the whole series in 1080p with a screen size ratio of 1.78:1 (widescreen) and with the sound in DTS-HD Master Audio 5.1 (5 channels plus subwoofer). The set includes all 97 episodes from its original broadcast run and features like a cast reunion."
    },
    {
      "title": "Novelizations",
      "content": "The first novel released based on the series was Broken Bow, authored by Diane Carey for Pocket Books and released in October 2001 in the United States. It also contained an additional chapter of production material on the series at the back of the novel, written by Paul Ruditis. The first original novel was By the Book, published in January 2002 and written by Dean Wesley Smith and Kristine Katheryn Rusch. The duo had not seen any episodes of the series at the time of writing, instead basing the book on the first three scripts and the initial trailer. Other books expanded on the backgrounds of specific characters, with What Price Honor? concentrating on Reed and Daedalus describing Tucker's work on a previous warp vessel.\n\nA further novelization was written by Paul Ruditis of the two-part episode \"Shockwave\" which closed the first season and opened the second. The final novelization of Enterprise episodes was contained within The Expanse by Jeanne Kalogridis which covered the second-season finale, \"The Expanse\" and the first episode of the third season, \"The Xindi\". Margaret Clark, an editor at Pocket Books explained on TrekNation that the reason for the low numbers of Enterprise related books was not due to poor sales, but instead because the fourth season of the show addressed topics that had been previously intended for novelizations. Books released subsequent to the end of the series as part of the Star Trek: Enterprise relaunch covered topics such as the Earth-Romulan War, and the initial years of the Federation."
    },
    {
      "title": "Other",
      "content": "In the video games Star Trek: Encounters and Star Trek: Legacy, both released in 2006, the first vessel controlled by the player in each storyline is the Enterprise (NX-01). As both games progress chronologically, the gamer then moves onto the USS Enterprise seen in The Original Series and later depictions afterwards. The film Star Trek Into Darkness (2013) references Enterprise with a model of the NX-01 in a collection depicting the history of flight in Fleet Admiral Alexander Marcus' (Peter Weller) office. It was placed next to other historical vessels such as the Wright Flyer, the Space Shuttle, and the First Flight. Events and elements of the series, including the MACOs and the Xindi war, are also referenced in the 2016 film Star Trek Beyond. The long-lost vessel featured in the film, the USS Franklin (NX-326), is similar in design and said to be a precursor to the NX-01. The Earth-Romulan War, which occurred after the events of the series in the official timeline but was seeded during the series, is also mentioned in Beyond. In 2023 Connor Trinneer reprised the role of Trip Tucker in Holograms, All the Way Down an episode of the animated web series Star Trek: Very Short Treks made to celebrate the 50th anniversary of Star Trek: The Animated Series."
    },
    {
      "title": "Critical reception",
      "content": "The first season was generally well received. The pilot episode of Enterprise, \"Broken Bow,\" was well received by critics, with Ed Bark for the Knight Ridder/Tribune News Service saying that it all came together in an \"impressive fashion,\" while Brandon Easton said in The Boston Herald that the cast was \"impeccable\" and the writing was \"strong\" despite the \"limitations of a questionable premise.\" In a differing opinion, Charlie McCollum for Knight Ridder said that the premise was \"great\", although at the time had yet to see the episode. Dan Snierson, while writing for Entertainment Weekly, praised the series, saying \"It's hot, it's sexy, it's kinda funny\" and called it the savior of UPN.\n\nFollowing the pilot, the critical reaction became mixed. David Segal said in The Washington Post that the series \"has a bargain basement feel that lands this side of camp.\" During the course of the second season, mainstream media publications began publishing that the show was \"broken.\" Tom Russo proclaimed in Entertainment Weekly that \"It's dead Jim – almost,\" attributing the lack of appeal of Star Trek: Nemesis and the dwindling ratings received by Enterprise as demonstrating that the franchise was tired. The frequency of stand-alone episodes broadcast during the second season resulted in a negative fan reaction.\n\nThe reception for the third and fourth seasons improved overall, but with some negative reviews being received. One such criticism was from Gareth Wigmore in TV Zone who said that \"Enterprise isn't so much reacting to current events as it is lazily picking items from the news to produce stories.\" Coto felt that the critics \"dumped on the show,\" and despite his feelings that the final season marked an improvement, he was disappointed that the critics did not change their minds. Critics received the news of the cancellation with mixed opinions, with Ted Cox in The Daily Herald saying that it was \"good riddance to space rubbish,\" while an article in the Lethbridge Herald blamed the cancellation on the poor ratings despite the improved quality of the series.\n\nThe series finale, \"These Are the Voyages...,\" was poorly received, with Cox adding that Enterprise ended \"with a whimper,\" while Kevin Williamson stated in the Calgary Sun that it was the worst series finale since \"Turnabout Intruder\" and criticised the concentration on characters from The Next Generation instead of Enterprise. Mark Perigard held a similar opinion in The Boston Herald, saying that William Riker \"has no business walking the ship,\" and that the death of Tucker was \"for no other reason than the show's creators realized at least one dramatic thing had to happen in the hour.\" Braga later admitted that killing Tucker \"wasn't a great idea,\" and called making the finale TNG-centric his biggest regret of the series. Others found the conclusion a comforting reminder of the Star Trek: The Next Generation episode \"The Pegasus,\" which aired about 11 years prior in real-time.\n\nIn 2016, in a listing that included every Star Trek film and TV series, Enterprise was ranked 12th by the Los Angeles Times, ahead of the 1994 film Star Trek: Generations."
    },
    {
      "title": "Accolades",
      "content": "Star Trek: Enterprise was nominated for seventeen awards over the course of the four seasons at the Creative Arts Emmy Award. It won on four occasions, for Outstanding Special Visual Effects for a Series for \"Broken Bow\", Outstanding Hairstyling for a Series for \"Two Days and Two Nights\", Outstanding Music Composition for a Series (Dramatic Underscore) for \"Similitude\", and Outstanding Special Visual Effects for a Series for \"Countdown\". It also received sixteen nominations at the Saturn Awards, with the only wins coming following the first season, both being for Jolene Blalock in the Best Supporting Actress on Television and Faces of the Future categories.\n\nThe series won an ASCAP Film and Television Music Award in 2002 for Top Television Series, and won twice at the Visual Effects Society Awards: once for \"Dead Stop\" in the category Best Models and Miniatures in a Televised Program, Music Video, or Commercial and once for the second part of \"Storm Front\" in the category Outstanding Visual Effects in a Broadcast Series, with a further two nominations received."
    }
  ]
}