{
  "title": "Jean-Luc Picard",
  "parentTitle": "Star Trek: The Next Generation",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Created By",
      "value": "Gene Roddenberry D. C. Fontana"
    }
  ],
  "content": "Jean-Luc Picard is a fictional character in the Star Trek franchise, most often seen as the commanding officer of the Federation starship USS Enterprise (NCC-1701-D). Played by Patrick Stewart, Picard has appeared in the television series Star Trek: The Next Generation (TNG) and the premiere episode of Star Trek: Deep Space Nine, as well as the feature films Star Trek Generations (1994), Star Trek: First Contact (1996), Star Trek: Insurrection (1998), and Star Trek: Nemesis (2002). He is also featured as the central character in the show Star Trek: Picard (2020–2023).",
  "sections": [
    {
      "title": "Casting and design",
      "content": "After the success of the contemporary Star Trek feature films, a new Star Trek television series featuring a new cast was announced on October 10, 1986. Star Trek creator Gene Roddenberry named Picard for (one or both of) the twin brothers Auguste Piccard and Jean Piccard, 20th-century Swiss scientists.\n\nPatrick Stewart, who has a background in live theater at the Royal Shakespeare Company, was initially considered for the role of Data. In the early 1970s, UCSB professor Homer Swander had recruited Stewart to help teach American college students about William Shakespeare. It was because of this connection that in 1986, Stewart was visiting UCLA to assist professor David Rodes with a series of public lectures on Shakespeare. At one of those lectures, producer Robert H. Justman immediately recognized that Stewart was the ideal candidate for Picard. Roddenberry originally did not want to cast Stewart as Picard, he had envisioned an actor who was \"masculine, virile, and had a lot of hair\". Roddenberry's first choice was Stephen Macht, and it took \"weeks of discussion\" with Justman, Rick Berman, and the casting director to convince him that \"Stewart was the one they had been looking for to sit in the captain's chair\"; Roddenberry agreed after auditioning every other candidate for the role. Other actors considered included Yaphet Kotto, Patrick Bauchau, Roy Thinnes and Mitchell Ryan. Kotto turned down the role due to concern about shifting his career to television after a prolific film career; he later called it a \"wrong decision\". Edward James Olmos was offered the role but was not interested.\n\nStewart was uncertain why the producers would cast \"a middle-aged bald English Shakespearean actor\" as captain of the Enterprise. He had his toupee delivered from London to meet with Paramount executives, but Roddenberry ordered Stewart to remove the \"awful looking\" hairpiece. Stewart's stentorian voice impressed the executives, who immediately approved the casting. Roddenberry sent Stewart C. S. Forester's Horatio Hornblower novels, saying the Picard character was based on Hornblower, but Stewart was already familiar with the character, having read the books as a teenager.\n\nAs the series progressed, Stewart exercised more control over the character's development. By the time production began on the first Next Generation film, \"it was impossible to tell where Jean-Luc started and Patrick Stewart ended\", and by the fourth film, Stewart stated:\n\n\"I find myself talking a lot about Picard and one of the things that I've come to understand is that as I talk a lot about Picard what I find is I'm talking about myself.\n\nThere was a sort of double action that occurred. In one sense, Picard was expanding like this and at the same time he was also growing closer and closer to me as well and, in some respect, I suppose even had some influence on me. I became a better listener than I ever had been as a result of playing Jean-Luc Picard because it was one of the things that he does terrifically well.\"\n\nHowever, Stewart stated that he is not nearly as serious or brooding as his alter ego.\n\nStewart also stated, \"One of the delights of having done this series and played this role is that people are so attracted to the whole idea of Star Trek... several years after the series has ended... I enjoy hearing how much people enjoyed the work we did... It's always gratifying to me that this bald, middle-aged Englishman seems to connect with them\". Stewart has commented that his role has helped open up Shakespeare to science fiction fans. He has noted the \"regular presence of Trekkies in the audience\" whenever he plays theater, and added: \"I meet these people afterwards, I get letters from them and see them at the stage door... And they say, 'I've never seen Shakespeare before, I didn't think I'd understand it, but it was wonderful and I can't wait to come back.'\""
    },
    {
      "title": "Depiction",
      "content": "Jean-Luc Picard was introduced on television in 1987, in the debut episode \"Encounter at Farpoint\" of Star Trek: The Next Generation. In this science fiction television show, he is the captain of a crewed spacecraft of the fictional organization Starfleet as it visits various exoplanets and aliens within and away from its governing United Federation of Planets. It is set in the late 24th century, and Picard must balance the challenges of people and technology. As a character in the Star Trek franchise, Picard appears in various books, comics, computer games, and films throughout the 1990s and a variety of merchandise. He is portrayed as being deeply moved by a desire to explore the universe and with a strong sense of duty; however, he has misgivings about not having a family and difficulty interacting with children. Some of his interests, as presented by the show, include space exploration, Shakespeare, and archaeology.\n\nThe close-knit crew of the Enterprise provides his main friendships as they take on the Milky Way Galaxy. Notably, he builds very long-lasting friendships with his first officer William T. Riker, tactical officer Worf, counselor Deanna Troi, helmsman-turned-chief engineer Geordi La Forge, and science officer Data. Picard is also occasionally depicted as having subtle romantic tension with the ship's head doctor, Beverly Crusher, widow of his former crewmate and best friend Jack. Towards the end of the timeframe of The Next Generation he acquires a protégée, Ro Laren, but she defects to the terrorist organization Maquis, betraying him.\n\nNotable episodes featuring the Jean-Luc Picard character include \"The Best of Both Worlds\" (Parts I and II), \"Yesterday's Enterprise\", \"Family\", \"All Good Things...\", \"Tapestry\", and \"The Inner Light\". Actor Patrick Stewart noted of the character \"During these past years, it has been humbling to hear many stories about how The Next Generation brought people comfort, saw them through difficult periods in their lives or how the example of Jean-Luc inspired so many to follow in his footsteps, pursuing science, exploration and leadership...\""
    },
    {
      "title": "Television series",
      "content": "Jean-Luc Picard was born to Maurice and Yvette Picard in La Barre, France, on July 13, 2305. As a child, he dreamed of joining Starfleet. He and the rest of his family speak English, with UK English dialects—the French language having become obscure by the 24th century, as mentioned in the Next Generation episode \"Code of Honor\". In the first season of The Next Generation, Picard was depicted as having a special pride in being French, though this was dropped by the second season. Picard also has a number of British habits, including the regular consumption of Earl Grey tea, a fondness for Shakespeare (which he performs in holodeck simulations), riding horses with English tack and a knowledge of such British songs with Royal Navy associations as \"A British Tar\" (Gilbert and Sullivan) and \"Heart of Oak\". The young Picard failed his first Starfleet Academy entrance exam and, upon admission, met with numerous ethical and scholastic difficulties during his cadet career, but went on to flourish, developing a lifelong passion for archaeology, and he became the first freshman to win the Academy marathon. Shortly after graduation, Picard was stabbed in the heart by a Nausicaan, leaving the organ irreparable and requiring replacement with a parthenogenetic implant; this proved near-fatal later. Ensign Picard's first posting was on the USS Reliant, later serving as first officer aboard the USS Stargazer, which he later commanded. During that time, he performed a warp-speed battle tactic that would become known as the Picard Maneuver.\n\nDepicted as deeply moral, highly logical, and intelligent, Picard is a master of diplomacy and debate who resolves seemingly intractable issues between multiple, sometimes implacable parties with a Solomon-like wisdom. Though such resolutions are usually peaceful, Picard is also shown using his remarkable tactical cunning in situations when it is required. Picard has a fondness for detective stories, Shakespearean drama, and archaeology. His catchphrases are \"Make it so\" and \"Engage\", but also \"Tea, Earl grey, hot\" when ordering from the computer's replicator.\n\nStar Trek: The Next Generation depicts Picard's command of the USS Enterprise (NCC-1701-D). The pilot episode shows the ship's mission to investigate a problem at Farpoint Station, which becomes sidetracked when an entity known as Q makes Picard \"representative\" in a trial charging humanity with being a \"dangerously savage child-race\". Picard persuades Q to test humanity, and Q chooses as the test's first stage the crew's performance at Farpoint. The trial \"ends\" seven years later (though Q reminds Picard that the trial never ends), in the series finale, when humanity is absolved by Picard's demonstration that the species has the capacity to explore the \"possibilities of existence\".\n\nThe third season finale, \"The Best of Both Worlds, Part I\", depicts Picard being assimilated by the Borg to serve as a bridge between humanity and the Borg (renamed Locutus of Borg); Picard's assimilation and recovery are a critical point in the character's development, and provided backstory for the film Star Trek: First Contact and the sequel series Star Trek: Picard, and the development of Benjamin Sisko, the protagonist of Star Trek: Deep Space Nine in the series premiere \"Emissary.\" Stewart asked Roddenberry to keep Picard a Borg for a few more episodes beyond the third season finale, as he thought that would be more interesting than simply restoring Picard in Part II. It is later revealed in First Contact that parts of Borg machinery were removed from inside Picard, but that he retains traumatic memories, lingering neurological aftereffects of assimilation (which become a pivotal plot twist in Star Trek: First Contact). Another aftereffect is the (fictional) parietal lobe disorder Irumodic syndrome, revealed in Star Trek: Picard third season to be caused by Borg alterations in his genome.\n\nThe fourth season episode \"Family\" reveals that Picard has a brother, Robert, who took charge of the family vineyards in La Barre after Picard joined Starfleet. Robert and his wife have a young son, René. In the film Star Trek Generations, Picard is devastated to learn that Robert and René have both died in a fire, and worse, the loss makes him the last of the Picard family, until the events of Star Trek: Picard. An encounter with an alien probe causes Picard to become trapped in another life, the life of a scientist on his dying homeworld, in the Hugo Award-winning fifth season episode \"The Inner Light\". The episode has a scene where Picard plays an alien flute, which was critically acclaimed as one of the best scenes in the series. When the flute went to auction in 2006, it was suggested it could be acquired for US$300, but it went for $48,000. The flute reappears as a symbol of Picard's brief romantic bond with one of his officers, Lieutenant Commander Nella Daren, in the sixth season episode \"Lessons\", which shows Picard's melancholic struggles with maintaining a romantic life as a starship captain.\n\nPicard made his final appearance in Star Trek: The Next Generation on broadcast television with the seventh season and series finale \"All Good Things...\", which was watched by over 30 million viewers."
    },
    {
      "title": "Films",
      "content": "Picard joins forces with the 23rd-century Enterprise captain James T. Kirk in Star Trek Generations to fight the film's villain Dr. Tolian Soran. Commanding the new USS Enterprise-E (after the Enterprise-D is destroyed in Generations), Picard again confronts the Borg and their Queen in First Contact. Later, he defends the Prime Directive and fights the forced relocation of the Ba'ku in Star Trek: Insurrection, and encounters Shinzon, a Romulan-made clone of himself, before witnessing Data sacrificing himself to defeat Shinzon and help restore political stability on Romulus, in Star Trek: Nemesis."
    },
    {
      "title": "Streaming",
      "content": "The follow-up series Star Trek: Picard is set at the close of the 24th century. A now-retired Admiral Picard lives with two former Romulan Tal Shiar operatives, who have become his companions in solitude on Château Picard, the Picard vineyard estate in La Barre, France (filmed at the Sunstone winery in Santa Ynez Valley, California). His retirement was brought upon by his failure to save the Romulans from the Hobus supernova depicted in Star Trek (the 2009 film), the planned evacuation being the reason he joined the admiralty, and also ruined the life of another of his protégées, the Starfleet officer Raffi Musiker. In the first season, a mysterious woman, Dahj Asha, comes to his estate seeking sanctuary, and Picard learns that she may be a Soong-type android, created from Data's remains. Androids had been made illegal in the wake of their rebellion on Mars, which directly led to the failure of the Romulan rescue attempt.\n\nSoon, Picard is drawn into a conspiracy to suppress all synthetic life, which involves the remnants of the Tal Shiar. Picard, accompanied by a rag-tag crew on La Sirena, works to subvert this conspiracy. At the end of season one, Picard's human form expires on Coppelius due to his Irumodic syndrome, and he encounters Data's consciousness, still alive in a simulated matrix. Data pleads for Picard to finally let him die, as he considers the finiteness of life to be a defining human characteristic. Data informs Picard that scientists \"were able to scan, map and transfer a complete neural image of your brain's substrates\" into a synthetic body, specifically configured to only give him the lifespan he would have lived if he did not have his previous disease. Picard obliges Data's request, staying by him in the simulated matrix as Data dies. Picard then continues exploring space in his new body before returning to Château Picard, on La Sirena.\n\nIn the second season, set in the year 2401, Picard becomes Chancellor of Starfleet Academy. The Borg request for Picard to negotiate with them to help investigate a new space anomaly. Picard is brought on board the new Starfleet ship USS Stargazer. Q travels to the ship to give Picard a great challenge, and throws him into an alternate timeline wherein Picard is a highly decorated general of the neofascist and xenophobic Confederation of Earth. Sensing something is wrong, Picard and the La Sirena crew band together with the Borg Queen to access time travel technology, learning Q has placed the point of divergence in the year 2024, before Picard's ancestor, Renée Picard, is due to embark on a human mission to Europa and spark developments that lead humanity to first contact. Picard and crew, with the help of the young version of his future friend Guinan and Renée's Romulan \"guardian angel\" Tallinn, adventure throughout Los Angeles, fending off the Borg-aligned eugenicist Adam Soong, and convince Renée to overcome her mental illness and go on the mission, thereby restoring the timeline and completing Q's challenge. In doing so, Picard also makes peace with realizing his father Maurice was not abusive, and with having unwittingly helped his mother Yvette commit suicide due to mental illness, when he was a small child. Q reveals that it is his final gift to Picard before returning Picard to the Stargazer in 2401 in the proper timeline, and ascending to a higher level of existence. Picard successfully negotiates with the Borg, forming an alliance aimed at researching the anomaly, and kindles a romance with Laris, one of his Romulan companions after the death of her husband Zhaban.\n\nIn the third season, set later that year, Picard has deepened his relationship with Laris, but receives a distress message from Beverly Crusher, whose ship is under attack by a shadowy conspiracy of criminals just outside Federation space. Picard and Riker commandeer the Starfleet ship USS Titan under false pretenses and rescue Crusher, who reveals she had a son, Jack II, with Picard shortly after the events of Nemesis, and hid Jack from Picard to keep Jack safe from mounting assassination attempts on Picard. Picard and Riker's confrontations with the conspirators, combined with the efforts of his protégées Worf, Ro, and Raffi, reveal that a rogue faction of Changelings have infiltrated the highest levels of Starfleet and are interested in restarting the Dominion War. They wish to facilitate this by stealing Picard's dead original organic body. Picard captures the faction head, Vadic, and learns her motives, but is unable to prevent her escape, until she is killed by a resurrected Data. Worf and Raffi rescue Troi and Riker from certain doom, and the Enterprise-D bridge crew is reunited. The crew find out that Picard's original body's genome and brain contain irregularities that allow him to hear the Borg Collective, and the rogue Changelings have worked with the Borg to analyze and implant them in every Starfleet transporter code, thus rewriting the genome of every user with an immature parietal lobe. The crew fail to warn the rest of Starfleet in time, as the Borg assimilate Starfleet's youngest members. The Enterprise-D crew are forced to flee to the Starfleet Museum, whereupon La Forge reveals his secret project, a newly rebuilt and fully functional Enterprise-D, and gives command to Picard. Picard successfully rescues a newly assimilated Jack by infiltrating the Borg's last cube and plugging into the Borg hive mind to profess his fatherly love to Jack, while Beverly destroys its power source with the Enterprise torpedoes, eliminating the villainous Borg and their Queen once and for all. In 2402, Picard and Beverly, who have just bid Jack farewell before his first assignment for Starfleet, special counselor to Captain Seven of Nine, aboard the newly rechristened USS Enterprise-G (formally the Titan), are last seen playing poker in the Ten Forward bar in Los Angeles, with the rest of the crew of the Enterprise-D, finally content with their lives."
    },
    {
      "title": "Development in non-canon works",
      "content": "In novels by Pocket Books, Picard has married Beverly Crusher, and they have a son named René Jacques Robert François Picard. Jean-Luc also corresponds regularly with Marie, his sister-in-law, who still maintains the family vineyards. Picard remained captain of the Enterprise-E until 2387, when the events of Star Trek: Coda reveals that these events take place in an alternate timeline from the \"prime\" reality (the one depicted in the TV series) known as the First Splinter, created during a Borg attack on the displaced Enterprise-E during the events of First Contact. When the powerful Devidians attempt to consume alternate realities by exploiting the weakness of the First Splinter reality, Picard must lead a crew of assembled allies to erase their reality from existence in order to protect the prime universe from the Temporal Apocalypse, a devastating wave of temporal energy caused by the Devidians' feeding that threatened to destroy the multiverse if they consumed the First Splinter and gained even greater power.\n\nIn the comics miniseries Star Trek: Countdown, a prequel to the Star Trek reboot (2009), Picard is depicted as having retired from Starfleet and become Federation Ambassador to Vulcan. In 2387, he works with Data, the new commanding officer of the Enterprise-E, Ambassador Spock, and the Romulan miner Nero to save the Romulan Star Empire from a cataclysmic supernova. He is present aboard the Enterprise as it confronts Nero, who has gone mad and begun killing non-Romulans after they fail to save Romulus. The Enterprise arrives too late to aid Ambassador Spock against Nero, believing both Spock and Nero to have been consumed by the artificial black hole that Spock created.\n\nThe PC video game Star Trek: Hidden Evil (1999) includes voice acting by Brent Spiner as Data and Patrick Stewart as Captain Picard, with the plot a follow-up from the ninth Star Trek film Star Trek: Insurrection (1998) which also starred both actor-character combinations. Patrick Stewart also voiced Picard and Locutus for the year 2000 computer game Star Trek: Armada."
    },
    {
      "title": "Reception",
      "content": "The character received critical acclaim among fans of The Next Generation, and he is usually considered one of the top two captains in the Star Trek franchise – there are often lengthy and serious debates over whether Picard or James T. Kirk is the \"best\" Starfleet captain. A 1991 TV Guide cover story was titled \"It's Kirk vs. Picard: Experts and fans debate who's best\". In a more lighthearted take on the debate, the cover of a 1994 Mad magazine Star Trek special features both Kirk and Picard wrestling childishly to fit into the Enterprise's captain's chair, while Scotty and Worf watch their respective commanders with looks of astonishment. In his parody song \"White and Nerdy\", satirizing nerd culture, \"Weird Al\" Yankovic sang the lines \"Only question I ever thought was hard/Was do I like Kirk or do I like Picard?\" Picard is deemed the ultimate delegator of authority, knowing \"how to gather and use data better than any other Star Trek captain\". His leadership style \"is best suited to a large, process-centric, either geographically identical or diverse team\". Kirk and Picard are considered to be attentive to the needs of their respective crews. When Stewart and William Shatner were asked in 1991 how their characters would have dealt with Saddam Hussein, Shatner stated that Kirk would \"have told him to drop dead\" while Stewart joked that Picard \"would still be talking\".\n\nIn 2015, Stewart addressed a long-asked conundrum among Star Trek fans, \"If Kirk and Picard fought each other, who would win?\" in Smithsonian magazine, by saying Picard would prefer to negotiate in the hope of avoiding a fight altogether.\n\nUGO Networks listed Picard as one of their best heroes in entertainment, saying, \"He doesn't have Kirk's sense of panache, but he did have a tendency to take everything really, really seriously for years\". He also became a sex symbol.\n\nIn 2012, IGN ranked Picard, as depicted in The Next Generation series and films, as the 3rd top character of the Star Trek universe, behind Spock and Kirk in first and second place respectively. In 2017, IndieWire ranked Picard as the number one best character on Star Trek: The Next Generation. In 2017, Screen Rant ranked Picard the number one most attractive person in the Star Trek universe, ahead of Nyota Uhura (#2), Benjamin Sisko (#3), and Seven of Nine (#4).\n\nIn 2018, Screen Rant ranked Picard as one of the top 8 most powerful characters of Star Trek, remarking that Picard is \"Played with trademark charm and gravitas by Patrick Stewart.\"\n\nIn 2018, CBR ranked Picard the second best Starfleet character of Star Trek; Kirk being the first.\n\nIn 2019, Jean-Luc Picard was ranked the 8th sexiest Star Trek character by Syfy. In July 2019, Screen Rant ranked Picard the 6th smartest character of Star Trek."
    },
    {
      "title": "Other actors",
      "content": "The character of Jean-Luc Picard has also been portrayed by:\n * David Birkin in \"Rascals\", November 15, 1992 — a child version.\n * Marcus Nash in \"Tapestry\", February 15, 1993 — a young man version, just graduated from Starfleet.\n * Tom Hardy in Star Trek: Nemesis (2002) — photograph, and also as a younger clone, Shinzon\n * Dylan Von Halle in \"The Star Gazer\" of Star Trek: Picard, March 3, 2022 – a child version."
    }
  ]
}