{
  "title": "James T. Kirk",
  "parentTitle": "Star Trek: The Original Series",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Created By",
      "value": "Gene Roddenberry"
    }
  ],
  "content": "James Tiberius Kirk, often known as Captain Kirk, is a fictional character in the Star Trek media franchise. Originally played by Canadian actor William Shatner, Kirk first appeared in Star Trek serving aboard the starship USS Enterprise as captain. Kirk leads his crew as they explore new worlds and \"boldly go where no man has gone before\". Often, the characters of Spock and Leonard \"Bones\" McCoy act as his logical and emotional sounding boards, respectively. Kirk has also been portrayed in numerous films, books, comics, webisodes, and video games.\n\nKirk first appears in the Star Trek episode \"The Man Trap\", broadcast on September 8, 1966, although the first episode recorded featuring Shatner was \"Where No Man Has Gone Before\". Shatner continued in the role for the show's three seasons, and he later provided the voice of the animated version of Kirk in Star Trek: The Animated Series (1973–1974). Shatner returned to the role for Star Trek: The Motion Picture (1979) and six subsequent films.\n\nAmerican actor Chris Pine portrays a young version of the character in the 2009 Star Trek film, Star Trek Into Darkness (2013), and in Star Trek Beyond (2016). Paul Wesley portrays Kirk on the Paramount+ series Star Trek: Strange New Worlds, set prior to Kirk's captaincy of the Enterprise. Other actors have played the character in fan-created media, and the character has been the subject of multiple spoofs and satires.",
  "sections": [
    {
      "title": "Biography",
      "content": "James Tiberius Kirk was born in Riverside, Iowa, on March 22, 2233, where he was raised by his parents, George and Winona Kirk. Although born on Earth, Kirk lived for a time on Tarsus IV, where he was one of nine surviving witnesses to the massacre of 4,000 colonists by Kodos the Executioner. James Kirk's brother, George Samuel Kirk, is first mentioned in \"What Are Little Girls Made Of?\" and introduced and killed in \"Operation -- Annihilate!\", leaving behind three children.\n\nKirk became the first and only student at Starfleet Academy to defeat the Kobayashi Maru test, garnering a commendation for original thinking after he reprogrammed the computer to make the \"no-win scenario\" winnable. Kirk was granted a field commission as an ensign and posted to advanced training aboard the USS Republic. He was then promoted to lieutenant junior grade and returned to Starfleet Academy as a student instructor. According to a friend, students could either \"think or sink\" in his class, and Kirk himself was \"a stack of books with legs\". Upon graduating in the top five percent, Kirk was promoted to lieutenant and served aboard the USS Farragut. While assigned to the Farragut, Kirk commanded his first planetary survey and survived a deadly attack by a bizarre cloud-like creature that killed a large portion of the Farragut's crew, including his commanding officer, Captain Garrovick. Although the surviving Executive Officer disagreed, Kirk blamed himself for years for hesitating to fire his assigned weapons upon seeing the threat until a later encounter with the creature showed that firing immediately with conventional weapons would have been useless anyway. Kirk became Starfleet's youngest starship captain after receiving command of the USS Enterprise (NCC-1701) for a five-year mission, three years of which are depicted in the original Star Trek series. Kirk's most significant relationships in the television series are with first officer Spock and chief medical officer Dr. Leonard \"Bones\" McCoy. McCoy is someone to whom Kirk unburdens himself and is a foil to Spock. Robert Jewett and John Shelton Lawrence's The Myth of the American Superhero describes Kirk as \"a hard-driving leader who pushes himself and his crew beyond human limits\". Terry J. Erdman and Paula M. Block, in their Star Trek 101 primer, note that while \"cunning, courageous and confident\", Kirk also has a \"tendency to ignore Starfleet regulations when he feels the end justifies the means\"; he is \"the quintessential officer, a man among men and a hero for the ages\". Although Kirk throughout the series becomes romantically involved with various women, when confronted with a choice between a woman and the Enterprise, \"his ship always won\".\n\nRoddenberry wrote in a production memo that Kirk is not afraid of being fallible, but rather is afraid of the consequences to his ship and crew should he make an error in judgment. Roddenberry wrote:\n\n\"[Kirk] has any normal man's insecurities and doubts, but he knows he cannot ever show them—except occasionally in private with ship's surgeon McCoy or in subsequent moments with Mr. Spock whose opinions Kirk has learned to value so highly.\"\n\nIn Star Trek: The Motion Picture, Admiral Kirk is Chief of Starfleet Operations, and he takes command of the Enterprise from Captain Willard Decker. Star Trek creator Gene Roddenberry's novelization of The Motion Picture depicts Kirk married to a Starfleet officer killed during a transporter accident. At the beginning of Star Trek II: The Wrath of Khan, Kirk takes command of the Enterprise from Captain Spock to pursue his enemy from \"Space Seed\", Khan Noonien Singh. The movie introduces Kirk's former lover Carol and his son, David Marcus. Spock, who notes that \"commanding a starship is [Kirk's] first, best destiny\", dies at the end of Star Trek II. In Star Trek III: The Search for Spock, Admiral Kirk leads his surviving officers in a successful mission to rescue Spock from a planet on which he is reborn. Although Kirk is demoted to Captain in Star Trek IV: The Voyage Home for disobeying Starfleet orders, he also receives command of the new Enterprise, the USS Enterprise-A (NCC 1701-A).\n\nIn Star Trek Generations, Captain Jean-Luc Picard finds Kirk living in the timeless Nexus, despite the fact that history recorded his death during the Enterprise-B's maiden voyage, Kirk having fallen into the Nexus in the incident that caused his \"death\". Picard persuades Kirk to return to Picard's present to help stop the villain Soran from destroying Veridian III's sun. Although Kirk initially refuses the offer, he agrees after realizing the Nexus cannot give him the one thing he has always sought: the ability to make a difference. The two leave the Nexus and stop Soran. However, Kirk is mortally wounded; as he dies, Picard assures him that he helped to \"make a difference\". Picard buries Kirk on the planet, however in Star Trek: Picard 's third season (2023), Kirk’s body is revealed to be stored in stasis at the Daystrom Institute by Section 31."
    },
    {
      "title": "Shatnerverse",
      "content": "Shatner has since written a series of novels featuring Kirk being brought back to life by a Borg-Romulan alliance to serve as an assassin against Picard, but he is restored to normal and returns to provisional active service in Starfleet, including opposing his Mirror Universe counterpart."
    },
    {
      "title": "Kelvin Timeline",
      "content": "In this series of films, Chris Pine plays Kirk.\n\nThe film takes place in an alternate course of events known as the \"Kelvin Timeline\" that reveal different origins for Kirk, the formation of his association with Spock, and how they came to serve together on the Enterprise. Whereas The Original Series portrayed Kirk as having been born in Iowa, the Star Trek film portrays him being born on a shuttle escaping the starship USS Kelvin in an alternate timeline in which his father is killed when the Kelvin is attacked by a Romulan ship from the future. In the film, George and Winona Kirk name their son James Tiberius after his maternal and paternal grandfathers, respectively.\n\nAlthough the film treats specific details from Star Trek as mutable, characterizations are meant to \"remain the same\" though with Kirk being initially portrayed as \"a reckless, bar-fighting rebel\" but who eventually matures. According to Pine, the character is \"a 25-year-old [who acts like a] 15-year-old\" and who is \"angry at the world\", until he enrolls in Starfleet Academy basically after being 'dared' by Captain Christopher Pike.\n\nKirk and Spock clash at Starfleet Academy, but, over the course of the film, Kirk focuses his \"passion and obstinance and the spectrum of emotions\" and becomes captain of the Enterprise. He is also aided by a meeting with the time-displaced Spock of the original timeline, who inspires Kirk to live up to his full potential after learning about the parallel version of himself and his accomplishments as Captain in the elder Spock's timeline."
    },
    {
      "title": "Conception and television",
      "content": "Jeffrey Hunter played the commanding officer of the USS Enterprise, Captain Christopher Pike, in the rejected Star Trek television pilot \"The Cage\". In developing a new pilot episode, called \"Where No Man Has Gone Before\", series creator Gene Roddenberry changed the captain's name to \"James Kirk\" after rejecting other options like Hannibal, Timber, Flagg and Raintree. The episode title may have been inspired by Captain James Cook, whose journal entry \"ambition leads me ... farther than any other man has been before me\" inspired the episode title, and became the series catch-phrase in the opening voice-over. The character is in part based on C. S. Forester's Horatio Hornblower hero, and NBC wanted the show to emphasize the captain's \"rugged individualism\". Roddenberry had previously used the middle name of Tiberius for the leading character in his earlier television series, The Lieutenant, which was to feature several actors who would later go on to be part of the production of Star Trek.\n\nJack Lord was Desilu Productions' original choice to play Kirk, but his demand for fifty-percent ownership of the show led to him not being hired. The second pilot episode was successful, and \"Where No Man Has Gone Before\" was broadcast as the third episode of Star Trek on September 22, 1966.\n\nWilliam Shatner tried to imbue the character with qualities of \"awe and wonder\" absent from \"The Cage\". He also drew upon his experiences as a Shakespearean actor to invigorate the character, whose dialogue at times is laden with jargon. Not only did Shatner take inspiration from Roddenberry's suggestion of Hornblower, but also from Alexander the Great – \"the athlete and the intellectual of his time\" – whom Shatner had played for an unsold television pilot two years earlier. In addition, the actor based Kirk partly on himself because \"the fatigue factor [after weeks of daily filming] is such that you try to be as honest about yourself as possible\". A comedy veteran, Shatner suggested making the show's characters as comfortable working in space as they would be at sea, thus having Kirk be a humorous \"good-pal-the-captain, who in time of need would snap to and become the warrior\". Changing the character to be \"a man with very human emotions\" also allowed for the development of the Spock character. Shatner wrote that \"Kirk was a man who marveled and greatly appreciated the endless surprises presented to him by the universe ... He didn't take things for granted and, more than anything else, respected life in every one of its weird weekly adventure forms\"."
    },
    {
      "title": "Films",
      "content": "Shatner did not expect Star Trek to be successful, so when it was cancelled in 1969, he assumed it would be the end of his association with the franchise. Following Star Trek's popularity after its cancelation, Shatner went on to voice Kirk in the animated Star Trek series, star in the first seven Star Trek films, and provide voice acting for several games. Star Trek II: The Wrath of Khan director and writer Nicholas Meyer, who had never seen an episode of Star Trek before he was assigned to direct, conceived a \"Hornblower in outer space\" atmosphere, unaware that those books had been an influence on the show. Meyer also emphasized parallels to Sherlock Holmes, in that both characters waste away in the absence of stimuli: new cases for Holmes; starship adventures for Kirk.\n\nMeyer's The Wrath of Khan script focuses on Kirk's age, with McCoy giving him a pair of glasses as a birthday present. The script states that Kirk is 49, but Shatner was unsure about being specific about Kirk's age because he was hesitant to portray a middle-aged version of himself. Shatner changed his mind when producer Harve Bennett convinced Shatner that he could age gracefully like Spencer Tracy. Spock's sacrifice at the end of the film allows for Kirk's spiritual rebirth; after commenting earlier that he feels old and worn out, Kirk states in the final scene that he feels \"young.\" Additionally, Spock's self-sacrificing solution to the no-win Kobayashi Maru scenario, which Kirk had cheated his way through, forces Kirk to confront death and to grow as a character.\n\nBoth Shatner and test audiences were dissatisfied that Kirk was fatally shot in the back in the original ending of the film Star Trek Generations. An addendum inserted while Shatner's Star Trek Movie Memories memoir was being printed expresses his enthusiasm at being called back to film a rewritten ending. Despite the rewrite, Generations co-writer Ronald D. Moore said that Kirk's death, which was intended to \"resonate throughout the Star Trek franchise\", failed to \"pay off the themes [of death and mortality] in the way we wanted\". Malcolm McDowell, whose character kills Kirk, was dissatisfied with both versions of Kirk's death: he believed Kirk should have been killed \"in a big way\". McDowell claims to have received death threats after Generations was released."
    },
    {
      "title": "Franchise \"reboot\"",
      "content": "In Star Trek (2009), screenwriters Alex Kurtzman and Roberto Orci focused their story on Kirk and Spock in the movie's alternative timeline while attempting to preserve key character traits from the previous depictions. Kurtzman said casting someone whose portrayal of Kirk would show that the character \"is being honored and protected\" was \"tricky\", but that the \"spirit of Kirk is very much alive and well\" in Pine's depiction. Due to his belief that he could not take himself seriously as a leader, Pine recalled having difficulty with his audition, which required him \"to bark 'Trek jargon'\", but his charisma impressed director J. J. Abrams. Pine's chemistry with Zachary Quinto, playing Spock, led Abrams to offer Pine the role. Jimmy Bennett played Kirk in scenes depicting the character's childhood. The writers turned to material from the novel Best Destiny for inspiration as to Kirk's childhood.\n\nIn preparing to play Kirk, Pine decided to embrace the character's key traits – \"charming, funny, leader of men\" – rather than try to fit the \"predigested image\" of Shatner's portrayal. Pine specifically did not try to mirror Shatner's cadence, believing that doing so would become \"an impersonation\". Pine said he wanted his portrayal of Kirk to most resemble Harrison Ford's Indiana Jones or Han Solo characters, highlighting their humor and \"accidental hero\" traits.\n\nA misunderstanding arose during the film's production about the possibility of Shatner making a cameo appearance. According to Abrams, the production team considered ways to resurrect Shatner's deceased Kirk character, but could not devise a way that was not \"lame\". However, Abrams believed Shatner misinterpreted language about trying to get \"him\" into the movie as a reference to Shatner, and not his character. Shatner released a YouTube video expressing disappointment at not being approached for a cameo. Although Shatner questioned the wisdom of not including him in the film, he predicted the movie would be \"wonderful\" and that he was \"kidding\" about Abrams not offering him a cameo."
    },
    {
      "title": "Star Trek: Strange New Worlds",
      "content": "Kirk also appears in Star Trek: Strange New Worlds, which is set six years before the events of the original series. He first appears in the final episode of Season 1, portrayed by Paul Wesley, and appeared as a recurring guest in Season 2. In this series, the Enterprise has another captain, Kirk's predecessor Christopher Pike, who first appeared in \"The Cage\"."
    },
    {
      "title": "Reception",
      "content": "According to Shatner, early Star Trek reviewers described his performance as \"wooden\", with most of the show's acting praise and media interest going to Nimoy. However, Shatner's mannerisms when portraying Kirk have become \"instantly recognizable\" and Shatner won a Saturn Award for Best Actor in 1982 for The Wrath of Khan. Star Trek II director Nicholas Meyer said Shatner \"gives the best performance of his life\" in The Wrath of Khan. The Guardian called Pine's performance of Kirk an \"unqualified success\", and The Boston Globe said Pine is \"a fine, brash boy Kirk\". Slate, which called Pine \"a jewel\", described his performance as \"channel[ing]\" Shatner without being an impersonation.\n\nSlate described Shatner's depiction of Kirk as an \"expansive, randy, faintly ridiculous, and yet supremely capable leader of men, Falstaffian in his love of life and largeness of spirit\". The Myth of the American Superhero refers to Kirk as a \"superhuman redeemer\" who \"like a true superhero ... regularly escapes after risking battle with monsters or enemy spaceships\". Although some episodes question Kirk's position as a hero, Star Trek \"never left the viewer in doubt for long\". Others have commented that Kirk's exaggerated \"strength, intelligence, charm, and adventurousness\" make him unrealistic. Kirk is described as able to find ways \"through unanticipated problems to reach [his] goals\" and his leadership style is most \"appropriate in a tight, geographically identical team with a culture of strong leadership.\" Although Roddenberry conceived the character as being \"in a very real sense ... 'married' \" to the Enterprise, Kirk has been noted for \"his sexual exploits with gorgeous females of every size, shape and type\"; he has been called \"promiscuous\" and labeled a \"womanizer\". The Last Lecture author Randy Pausch believed he became a better teacher, colleague, and husband because he watched Kirk run the Enterprise; Pausch wrote that \"for ambitious boys with a scientific bent, there could be no greater role model than James T. Kirk\". David A. Goodman commented that Kirk \"has as much reality as possible for a fictional character.\"\n\nIn 2012, IGN ranked the character Captain Kirk, as depicted in the original series, films, and the new Kirk in 2009 film Star Trek, as the number one top character of the Star Trek universe. In 2016, Kirk was ranked as the #1 most important character of Starfleet within the Star Trek science fiction universe by Wired magazine, out of 100 characters of the franchise.\n\nIn 2018, CBR ranked Kirk the best Starfleet character of Star Trek, including later television series.\n\nIn July 2019, Screen Rant ranked Kirk the 8th smartest character of Star Trek."
    },
    {
      "title": "Cultural impact",
      "content": "In 1985, Riverside, Iowa petitioned Roddenberry and Paramount Pictures for permission to \"adopt\" Kirk as their town's \"Future Son\". Shatner and Roddenberry approved the proposal. Paramount wanted $40,000 for a license to reproduce a bust of Kirk, but the city instead set a plaque and built a replica of the Enterprise (named the \"USS Riverside\"), and the Riverside Area Community Club holds an annual \"Trek Fest\" in anticipation of Kirk's birthday.\n\nKirk has been the subject of a wide range of television spoofs that aired in many countries, including The Carol Burnett Show and KI.KA's Bernd das Brot. John Belushi's impression of Kirk for Saturday Night Live, which he described as his favorite role, was \"dead-on\". Jim Carrey has been praised for his satire of the character in a 1992 episode of In Living Color. Comedian Kevin Pollak is well known for his impressions of Shatner as Kirk.\n\nKirk's memorable scream of \"Khan!\" in the 1982 movie Star Trek II: The Wrath of Khan has become a pop culture icon in its own right, spawning internet memes and is widely parodied and paid tribute to.\n\nKirk has been referenced in the lyrics of many pop songs. Early examples include the 1979 song \"Where's Captain Kirk?\" by Spizzenergi, the 1982 rap song \"Tough\" by Kurtis Blow, and 1983's \"99 Luftballons\" by Nena (both German and English versions). More recently, in the 2003 remix of 1998’s \"That Don't Impress Me Much\", Shania Twain puts forth Captain Kirk as one of the unattainable ideals to whom her unappealingly haughty suitor apparently thinks himself equal.\n\nKirk has been merchandised in a variety of ways, including collectible busts, action figures, mugs, t-shirts, and Christmas tree ornaments. A Kirk Halloween mask was altered and used as the mask worn by the character Michael Myers in the Halloween film franchise. In 2002, Kirk's captain's chair from the original Star Trek was auctioned for $304,000.\n\nIn a 2010 Space Foundation survey, Kirk tied with cosmonaut Yuri Gagarin as the No. 6 most popular space hero.\n\nCaptain Kirk has also been portrayed in feline form. First, anthropomorphically, in two episodes of the 1975 Filmation Saturday morning animated children’s series The Secret Lives of Waldo Kitty. The cartoon is based around the title character’s fantasies about being various heroic felines based on popular culture icons. Later came scientific illustrator Jenny Parks' 2017 book Star Trek Cats, in which Kirk is depicted as an orange tabby cat.\n\nThe Kirk crater on Pluto's moon, Charon, is named after the character."
    },
    {
      "title": "Fan productions",
      "content": "In addition to television, feature films, books, and parodies, Kirk has also been portrayed in non-canon fan fiction."
    },
    {
      "title": "Star Trek: New Voyages",
      "content": "The Star Trek: New Voyages fan production, known from 2008 until 2015 as Star Trek: Phase II, portrays the further voyages of the original Enterprise crew. The series' creators feel that \"Kirk, Spock, McCoy and the rest should be treated as 'classic' characters like Willy Loman from Death of a Salesman, Gandalf from The Lord of the Rings or even Hamlet, Othello or Romeo. Many actors have and can play the roles, each offering a different interpretation of said character.\"\n\nJames Cawley played Kirk in most of the ten episode Phase II series from its beginning in 2004 before replacing himself with actor Brian Gross. Wired observes that while Cawley's depiction \"lacks Shatner's vulnerability\", the actor has enough swagger \"to be passable in the role\". Cawley's portrayal was well-known enough at Paramount that a group of Star Trek: Enterprise writers called for Cawley's attention at a science fiction convention by shouting \"Hey, Kirk!\" at him while Shatner sat nearby."
    },
    {
      "title": "Star Trek Continues",
      "content": "First produced in 2013, the 11 episode series Star Trek Continues also looked to chronicle the \"lost seasons\" of Star Trek: The Original Series. The series developer and producer is anime voice actor Vic Mignogna, who also plays the role of Kirk. Rounding out the core cast is fellow voice actor Todd Haberkorn as Spock, Chris Doohan (son of the original Scotty actor James Doohan) as Scotty, and as McCoy first author-producer Larry Nemecek, followed by voice actor Chuck Huber. It also co-starred Grant Imahara (MythBusters) as Sulu.\n\nThe first episode, \"Pilgrim of Eternity\" (with Michael Forest reprising his role as Apollo from the original series episode \"Who Mourns for Adonais?\") was released in 2013. The second episode, \"Lolani\" (featuring guest star Lou Ferrigno), was released in February 2014, and a third episode, \"Fairest of Them All\" was released in June 2014 and won a Burbank International Film Festival award for \"Best New Media – Drama\". Star Trek Continues also won a Geekie Award for \"Best Web Series\". On June 19, 2015, Episode 4 of the series was posted and titled \"White Iris\". All eleven full episodes have been released as of December, 2017."
    },
    {
      "title": "Legacy",
      "content": "In October 2021, Kirk's actor from The Original Series William Shatner flew to space aboard a Blue Origin sub-orbital capsule. At age 90, he became the oldest person to fly to space and one of the first 600 to do so."
    }
  ]
}