{
  "title": "Star Trek: Picard",
  "parentTitle": "Star Trek",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Created By",
      "value": "Akiva Goldsman\n\nMichael Chabon\n\nKirsten Beyer\n\nAlex Kurtzman"
    },
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    },
    {
      "type": "number",
      "label": "No. of Seasons",
      "value": 3
    },
    {
      "type": "number",
      "label": "No. of Episodes",
      "value": 30
    }
  ],
  "content": "Star Trek: Picard is an American science fiction television series created by Akiva Goldsman, Michael Chabon, Kirsten Beyer, and Alex Kurtzman for the streaming service CBS All Access (later rebranded as Paramount+). It is the eighth Star Trek series and was released from 2020 to 2023 as part of Kurtzman's expanded Star Trek Universe. The series focuses on retired Starfleet Admiral Jean-Luc Picard. It begins at the end of the 24th century, 20 years after the character's last appearance in Star Trek: Nemesis (2002).\n\nPatrick Stewart stars as Picard, reprising his role from the series Star Trek: The Next Generation as well as other Star Trek media. Alison Pill, Isa Briones, Harry Treadaway, Michelle Hurd, Santiago Cabrera, and Evan Evagora also star in the first season, with Jeri Ryan, Orla Brady, and Brent Spiner joining for the second. The third season stars Stewart, Ryan, Hurd, and Ed Speleers, with Next Generation cast members LeVar Burton, Michael Dorn, Jonathan Frakes, Gates McFadden, Marina Sirtis, and Spiner as special guest stars.\n\nA new series starring Stewart as Picard was first rumored in June 2018 and officially announced that August. It was produced by CBS Studios in association with Secret Hideout, Weed Road Pictures, and Roddenberry Entertainment. The series was designed to be slower and more character-focused than previous franchise installments, with each season exploring different aspects of Picard in his advanced age. Filming took place in California, which granted the series large tax credits, and production on the second and third seasons took place back-to-back. Chabon served as showrunner for the first season, Goldsman and Terry Matalas took over for the second, and Matalas was the sole showrunner for the third.\n\nStar Trek: Picard premiered on CBS All Access on January 23, 2020, and the rest of its 10-episode first season was released weekly until March. The second season was released on Paramount+ from March to May 2022, and the third and final season was released from February to April 2023. The series was met with generally positive reviews from critics and has received numerous accolades, including one Primetime Creative Arts Emmy Award from ten nominations and five Saturn Awards from eleven nominations.\n\nSeveral tie-in projects have been created based on the series, including an episode of the companion series Star Trek: Short Treks. Cast, crew, and fans have expressed interest in the story continuing through a potential spin-off series commonly referred to as Star Trek: Legacy, while Stewart has expressed interest in a film continuation that is in development.",
  "sections": [
    {
      "title": "Premise",
      "content": "The series begins in 2399, 20 years after Jean-Luc Picard's last appearance in Star Trek: Nemesis (2002), and finds the character still deeply affected by the death of Data in that film as well as the destruction of the planet Romulus in the film Star Trek (2009). Retired from Starfleet and living on his family's vineyard, Picard is drawn into a new adventure when he is visited by a synthetic \"daughter\" of Data, one of several new synthetic beings or \"synths\". Picard fights for their right to exist and gives his life to save them.\n\nAfter Picard's consciousness is transferred into a synthetic body, the second season moves forward to 2401. Picard and his companions are living new lives when his old adversary Q, an extra-dimensional being, traps them in an alternate reality. They travel back in time to the 21st century to save the future of the galaxy. In the third season, Picard learns that he has a son who is being hunted by mysterious enemies. He reunites with the former crew of the USS Enterprise to protect his son and face a new invasion by the Borg."
    },
    {
      "title": "Cast and characters",
      "content": "A retired Starfleet admiral who previously commanded the USS Enterprise. Picard retired from Starfleet in protest when the United Federation of Planets chose not to aid the Romulans when their planet was destroyed. He is diagnosed with a terminal illness in the first season, as the writers wanted to discuss relatable issues that people face at the end of their lives, and he dies at the end of the season. Picard's consciousness is transferred to a synthetic body, which led to widespread discussion by fans and critics regarding whether the synthetic version was still the same person. Co-creators Michael Chabon and Akiva Goldsman both felt he was the same character, but other commentators disagreed. More than a week of debates on the Star Trek wiki encyclopaedia Memory Alpha regarding whether or not a new wiki page should be created for the synthetic version of Picard ended with the information being kept on the same page. Picard is appointed Chancellor of Starfleet Academy by the second season, which explores the character's trauma from his mother's death by suicide when he was a child. This was inspired by Stewart's own experience of childhood domestic violence. In the third season, Picard is reunited with the former command crew of the Enterprise. A former Starfleet doctor and expert on synthetic life who joins Picard. During the second season, Agnes is assimilated into the Borg Collective and becomes the new Borg Queen. Dahj and Soji are twin androids with organic bodies that were created to be the daughters of Data. Sutra is an earlier android model, and Kore is the daughter of Dr. Adam Soong from 2024. This helps explain by whom Data was inspired for the appearance of Dahj and Soji. A Romulan agent sent to seduce and spy on Soji Asha. Picard's former Starfleet first officer who struggles with substance abuse. A former Starfleet officer and the pilot of La Sirena. Cabrera also portrays the emergency holograms aboard La Sirena. During the second season, Rios falls in love with a 21st century woman and opts not to return to the future. A Romulan refugee whom Picard abandoned as a boy and was raised by the Qowat Milat, a sect of all-female warrior nuns. A former Borg drone and crew member aboard the USS Voyager who became a member of the Fenris Rangers vigilante group. Laris is Picard's Romulan housekeeper who develops romantic feelings for him. Tallinn is a Supervisor like the Star Trek: The Original Series character Gary Seven. Data is Picard's android former second officer, created by cyberneticist Dr. Noonian Soong. Altan Inigo Soong is the latter's descendent and Dr. Adam Soong his ancestor from 2024, continuing the franchise's tradition of having Spiner play every male member of the Soong family. The android Lore is Data's evil older brother. The son of Beverly Crusher and Jean-Luc Picard.\n * Patrick Stewart as Jean-Luc Picard:\n * Alison Pill as Agnes Jurati (seasons 1–2):\n * Isa Briones as Dahj and Soji Asha, Sutra, and Kore Soong (seasons 1–2):\n * Harry Treadaway as Narek (season 1):\n * Michelle Hurd as Rafaella \"Raffi\" Musiker:\n * Santiago Cabrera as Cristobal \"Chris\" Rios (seasons 1–2):\n * Evan Evagora as Elnor (seasons 1–2):\n * Jeri Ryan as Seven of Nine:\n * Orla Brady as Laris and Tallinn:\n * Brent Spiner as Data, Altan Inigo Soong, Adam Soong, and Lore:\n * Ed Speleers as Jack Crusher (season 3):"
    },
    {
      "title": "Development",
      "content": "In June 2018, after becoming sole showrunner of the series Star Trek: Discovery, Alex Kurtzman signed a five-year overall deal with CBS Television Studios to expand the Star Trek franchise beyond Discovery to several new series, miniseries, and animated series. One of these new series was reported to star Patrick Stewart, reprising his role of Jean-Luc Picard from the series Star Trek: The Next Generation. Kurtzman and Akiva Goldsman (who worked on the first season of Discovery) were attached to the project. When CBS had first approached him about making more Star Trek series, Kurtzman included a series featuring Picard on his wish list as he believed the character was the greatest Star Trek captain. This was despite Stewart having previously said that he did not want to return to the franchise.\n\nWhile developing ideas for the short form companion series Star Trek: Short Treks, Kurtzman and his team developed a story that would have featured Nichelle Nichols reprising her role from Star Trek: The Original Series as Uhura. The short would have seen a young Picard visit Uhura in hospital and receive a mission related to the Borg. The short did not move forward, but it led to discussions of a short starring Stewart as an older version of Picard. The team soon decided that they had enough material to pitch to Stewart a full series focused on Picard. Kurtzman and Goldsman contacted the actor before January 2018 to discuss this idea, and met with him along with Discovery writer Kirsten Beyer at the Beverly Wilshire Hotel. Stewart took the meeting with the intention of turning the project down, but after Beyer convinced him to reconsider he agreed to read a four-page document outlining their ideas. At that time, Goldsman invited novelist Michael Chabon, a friend, to work on the project as well and the four ultimately produced a 35-page document that they sent to Stewart. Stewart asked to meet with the group again in March 2018, where he expressed his approval of their pitch. Stewart said the pitch felt like \"something very unusual, and I was intrigued\". While deciding whether to join the project, Stewart asked Kurtzman that the series be \"so different\" from previous Star Trek stories, \"both what people remember but also not what they're expecting at all, otherwise why do it?\"\n\nOn August 4, 2018, Stewart made a surprise appearance at the annual Las Vegas Star Trek Convention to officially announce the series and confirm that he would star in it. He explained that after last portraying the character in the 2002 film Star Trek: Nemesis, he felt his role in the franchise \"had run its natural course\", but in the years since he was humbled by stories of the impact the character had on the lives of fans. He was now happy to bring back Picard's \"comforting and reforming light [to] shine on these often very dark times\". In addition to starring, Stewart was also set to executive produce the series alongside Kurtzman, Goldsman, Chabon, Discovery's James Duff, Heather Kadin of Kurtzman's production company Secret Hideout, and Rod Roddenberry (the son of Star Trek creator Gene Roddenberry) and Trevor Roth of Roddenberry Entertainment, with Beyer as supervising producer.\n\nThe series was initially expected to premiere in 2019. Kadin revealed in October that it was intended to be ongoing rather than a limited miniseries and said that its release dates would not overlap with Discovery or any other new Star Trek series. Kurtzman added that the Picard series would be \"its own thing\", later elaborating that where Discovery is \"a bullet\", the Picard series is \"a very contemplative show\" with its own rhythm and more of a real-world feeling. CBS CCO David Nevins confirmed in December 2018 that the series was intended to debut on CBS All Access at the end of 2019, after the full release of Discovery second season and several Star Trek: Short Treks shorts. Stewart revealed a month later that the series would consist of 10 episodes, and reiterated that the intention was for it to continue for multiple seasons, adding in February that \"we are set up for possibly three years of this show\". A production listing in March gave the series' title as Star Trek: Destiny, which CBS had trademarked in 2018. However, the official title was announced to be Star Trek: Picard at CBS's upfront presentation that May. At that time, Kurtzman said the series was being \"shepherded\" by a larger creative team rather than having a traditional showrunner.\n\nChabon was named sole showrunner in June, working on the day-to-day production with Kurtzman and Goldsman. A month later, the series was scheduled to premiere in January 2020. It was reported to have a budget of $8–9 million per episode. In October, Kurtzman said a second season was \"already in the works\". Chabon signed an overall deal with CBS Television Studios in early December to create several new series for the studio, which meant he would be exiting as showrunner of Picard in 2020. He remained an executive producer and writer for the series. CBS officially announced the second season a month later and revealed that Terry Matalas had joined the series as an executive producer to fill the void that would be created by Chabon's departure. Goldsman and Matalas took over as co-showrunners once Chabon left. The series was also reported to have an informal green-light for a third season that would be developed at the same time as, and filmed back-to-back with, the second. This was to save costs and simplify scheduling, and was officially confirmed in September 2021. By then, CBS All Access had been expanded and rebranded as Paramount+. Goldsman said the producers had discussed a three-season plan and a five-season plan for the series, but would ultimately keep making it as long as Stewart was happy to do so. In February 2022, Goldsman confirmed that the third season would be the last. Matalas served as sole showrunner for the third season."
    },
    {
      "title": "Writing",
      "content": "Kurtzman's mandate for the series was that it be a psychological character study about Picard in his \"emeritus years\". He noted that it was rare for a television series to star an actor of Stewart's age. Goldsman said the series would not be a direct sequel to The Next Generation and would be more character-focused than that series, describing Picard as \"slower, more gentle, more lyrical\" than previous Star Trek stories. He contrasted Picard with Discovery by describing the latter as a sci-fi action-adventure series while Picard is a sci-fi drama series that tells dramatic stories within an otherworldly setting. Stewart was assured by the creative team that the series would not be \"jokey\", and compared Picard to when he reprised his X-Men role of Professor X in the film Logan (2017), where he was the same character but the franchise's world and tone was \"blown apart\".\n\nGoldsman said each season tells a separate story, but he saw the three seasons as being \"of a piece\". Matalas elaborated that the series was a three-part story about Picard, with each season exploring different aspects of the character. In addition to having different stories and themes, each season also has a different tone and visual approach, making the series \"a kind of an anthology\" with each season following the respective visions of Chabon, Goldsman, and Matalas. The first season finds Picard deeply affected by the death of his android colleague Data in Nemesis, and Kurtzman saw it as a redemption story for the character, who must face the consequences of his choice to abandon Starfleet and the Romulans following the destruction of the planet Romulus in the film Star Trek (2009). The second season continues to explore issues that come up in the last stage of a person's life, especially Picard's past relationships, and other elements of his life that have been preventing him from moving forward. Goldsman felt that the first season was about resurrection and the second season was about redemption, while Matalas said the third season was designed to be a \"send off\" for Picard and the rest of Next Generation main cast."
    },
    {
      "title": "Casting",
      "content": "With the series announcement in August 2018 came confirmation that Stewart would star as Picard. At the start of March 2019, Santiago Cabrera and Michelle Hurd were both set to co-star in the series, with Cabrera being one of the most sought-after actors during the 2019 television pilot season and choosing this series over other offers. Later that month, newcomer Evan Evagora was cast in another series regular role. In April, Alison Pill, Harry Treadaway, and Isa Briones joined the cast. Characters for the new cast members were announced in July, with Pill as Agnes Jurati, Cabrera as Cristobal \"Chris\" Rios, Hurd as Raffi Musiker, Treadaway as Narek, and Evagora as Elnor. Briones portrays several androids, including Dahj and Soji Asha.\n\nWhile developing the series, the creative team discussed not bringing back any other characters from The Next Generation to allow Picard to stand alone and not become reliant on nostalgia. Part of this was to allow newcomers who had not seen the previous series to enjoy Picard. However, the writers wanted to be respectful to longtime fans of Star Trek and felt they were missing opportunities by not including certain characters, so they decided to add some returning guests who organically served the new story. Several actors from previous Star Trek series were announced as guest stars for Picard in July 2019, including The Next Generation's Brent Spiner as Data, Jonathan Del Arco as Hugh, Jonathan Frakes as William Riker, and Marina Sirtis as Deanna Troi, as well as Star Trek: Voyager Jeri Ryan as Seven of Nine. In January 2020, Stewart said it was his hope that all of the main cast of The Next Generation would appear on Picard before the end of the series, while Kurtzman said if Michael Dorn reprised his Klingon role Worf in Picard he would appear as he did in The Next Generation and not be changed to match the new Klingon designs in Discovery. At that time, Whoopi Goldberg agreed to appear in the second season of the series as her The Next Generation character Guinan.\n\nIn June 2020, the main cast was confirmed to be returning for the second season, except for Treadaway. In April 2021, Ryan, Spiner, and first season guest star Orla Brady were revealed to also be main cast members for the second season, with John de Lancie appearing as his Star Trek character Q. That July, Voyager Robert Duncan McNeill said he had been in discussions to reprise his role as Tom Paris for both seasons of the series, but scheduling conflicts had prevented this. In April 2022, the main cast of The Next Generation were confirmed to be starring in the third season with Stewart: LeVar Burton as Geordi La Forge, Dorn, Frakes, Gates McFadden as Beverly Crusher, Sirtis, and Spiner. Another Next Generation cast member, Wil Wheaton, appeared in the second-season finale, reprising his role as Wesley Crusher, but did not return for the third season. After the second-season finale's release in May 2022, Ryan and Hurd confirmed that they had returned for the third season, but Cabrera, Pill, Evagora, and Briones did not. In January 2023, Ed Speleers was announced as a new series regular for the third season. He portrays Jack Crusher, the son of Picard and Beverly Crusher."
    },
    {
      "title": "Design",
      "content": "Several members of the design team from Star Trek: Discovery returned for Picard, including production designer Todd Cherniawsky and creature designer Neville Page of Alchemy Studios. Christine Bieselin Clark served as costume designer. Acknowledging that the series would be set further in the future than any previous Star Trek film or series, Kurtzman explained that the production was aiming for a \"grounded\" approach rather than having things like \"crazy floating skyscrapers and all the cliches of science fiction\". The opening title sequence was created by Prologue, the company that created the Discovery opening sequence."
    },
    {
      "title": "Filming",
      "content": "The series was filmed at Santa Clarita Studios, California, under the working title Drawing Room. It received large tax credits from the California Film Commission for the production to take place in California, rather than in Toronto, Canada, where Star Trek: Discovery is filmed. Filming for the first season took place from April to September 2019, with location shooting around California, including at Sunstone Winery in Santa Ynez Valley to depict Picard's French vineyard, at long-time Star Trek filming location Vasquez Rocks in the Sierra Pelona Mountains in Los Angeles County for Raffi's home, and in the Malibu area for the planet Coppelius.\n\nDespite reports that the second and third seasons were intended to be filmed back-to-back, the producers were just planning to film the second season on its own when the COVID-19 pandemic began to impact film and television productions in early 2020. Due to the scheduling requirements for the series, the subsequent pandemic-induced delays meant the second and third seasons did need to be filmed back-to-back. Filming for the second season began in February 2021, with some third-season scenes being filmed at the same time. Location filming took place around Los Angeles for the second season, which is mostly set in that city during the year 2024. Filming for the season ended in September, with the production then segueing fully into filming the third. The two seasons had one of the largest television series crews at the time with more than 450 crewmembers. Filming for the series wrapped in March 2022; Stewart stated that continually filming the series for nearly 14 months was \"thrilling and exciting much of the time\", but also difficult for the actor who was in his 80s."
    },
    {
      "title": "Visual effects",
      "content": "Visual effects for the series are provided by Pixomondo, DNEG, Crafty Apes, Ghost VFX, Gentle Giant Studios, Technicolor VFX, and Filmworks/FX. with Jason Zimmerman returning from Discovery as visual effects supervisor. Pixomondo worked with the series' production design department to help flesh out their designs into 3D assets, and then shared those assets with the other vendors. For the first season, these digital models included the Borg Cube, La Sirena, and the Romulan ships."
    },
    {
      "title": "Music",
      "content": "Star Trek: Discovery composer Jeff Russo was revealed to be composing the score for Picard in July 2019. Russo's relationship with Star Trek began as a fan of The Next Generation, and he asked Kurtzman if he could work on Picard after seeing Stewart's announcement of the series at the Las Vegas Star Trek Convention. Russo wanted his music to remain truthful to previous Star Trek scores without repeating them, and especially wanted to avoid his music for Discovery. Russo felt that Picard was a more intimate story and wanted to take a more personalized approach by featuring more solo instrument performances than he did for Discovery.\n\nRusso wrote several iterations of the main theme for the series before settling on a more emotional and stirring version. It is bookended with a piccolo, which Russo felt sounded similar to the fictional Ressikan flute that Picard plays in the Next Generation episode \"The Inner Light\". The second season features an \"up-tempo rearrangement\" of the main theme. Additionally, Russo used Jerry Goldsmith's theme from Star Trek: The Motion Picture (1979) to connect to The Next Generation, as that series used Goldsmith's theme for its main title, and he also referenced Alexander Courage's original Star Trek theme to \"evoke the idea of Star Trek in general\". A soundtrack album for the first half of the first season was released on February 7, 2020, followed by an album for the full season on April 3. An album for the second season was released on April 29, 2022.\n\nStephen Barton replaced Russo as composer for the third season, after working with Matalas on the series 12 Monkeys. They took inspiration from the work of Goldsmith and James Horner for the Star Trek films. Craig Huxley contributed performances on the blaster beam, an instrument that he invented and previously played on the soundtrack of The Motion Picture."
    },
    {
      "title": "Streaming and broadcast",
      "content": "Star Trek: Picard premiered on the streaming service CBS All Access in the United States on January 23, 2020. Like Discovery, each episode was broadcast in Canada by Bell Media on the same day as the U.S. release, on the specialty channels CTV Sci-Fi Channel (English) and Z (French) before streaming on Crave. Amazon Prime Video released each episode within 24 hours of its U.S. debut in over 200 other countries and territories around the world; this was separate from Discovery, which was released internationally by Netflix at that time. The deals with Amazon and Bell were made by international distributor arm CBS Studios International.\n\nAfter CBS All Access was rebranded as Paramount+, the first season remained on the service and the other two seasons were confirmed to be released on it as well. In February 2023, Paramount made a new deal with Prime Video for the series' international streaming rights. This allowed the third season to be streamed on Paramount+ in some other countries, within 24 hours of each episode's U.S. debut, alongside its Prime Video release. The first two seasons were also added to Paramount+ internationally in addition to remaining on Prime Video. The series finale was released on Paramount+ in the U.S. on April 20, 2023. In August 2023, Star Trek content was removed from Crave and all three seasons of Picard began streaming in Canada on Paramount+ instead. The series would continue to be broadcast on CTV Sci-Fi and be available on CTV.ca and the CTV app."
    },
    {
      "title": "Home media",
      "content": "Each season received an individual release on DVD, Blu-Ray, and Limited Edition Steelbook formats, featuring all of the seasons' episodes and relevant special features. On September 5, 2023, the same day that the third season was released on home media, a box set collecting all three seasons and more than seven hours of special features was released on DVD and Blu-Ray in the U.S. This was followed by the \"Picard Legacy Collection\" on November 7, a 54-Disc Blu-ray box set that includes all three seasons of Picard, all seven seasons of The Next Generation, the four Next Generation films, the Wisdom of Picard novel, and other merchandise."
    },
    {
      "title": "Viewership",
      "content": "A week after the series premiere, CBS said that Picard had set a new record for the total streams of a CBS All Access original series by its subscribers, with 115 percent more total streams than the previous record set by Star Trek: Discovery. CBS also partly attributed the premiere of the series for the month of January 2020 breaking the service's record for the most new subscribers in a month, helped by the week of Picard's premiere being the second-most new subscribers in a single week for the service."
    },
    {
      "title": "Critical response",
      "content": "<section begin=Response /><section end=Response /> Star Trek: Picard has an 89% approval rating on the review aggregator website Rotten Tomatoes, while Metacritic, which uses a weighted average, has assigned a score of 77 out of 100 based on reviews from 50 critics, indicating \"generally favorable\" reviews.\n\nFor the first season, Rotten Tomatoes reported 86% approval with an average rating of 7.55/10 based on 254 reviews. The website's critical consensus reads, \"Anchored by the incomparable Patrick Stewart, Picard departs from standard Starfleet protocol with a slower, serialized story, but like all great Star Trek it tackles timely themes with grace and makes for an exciting push further into the final frontier.\" Metacritic assigned a score of 76 out of 100 based on reviews from 27 critics, indicating \"generally favorable\" reviews.\n\nRotten Tomatoes reported 85% approval for the second season, with an average rating of 7.95/10 based on 95 reviews. The website's critical consensus reads, \"Picard gets some backup from franchise fan favorites in a sophomore season that charts a course towards recapturing more of the classical Star Trek spirit and makes it so.\" Metacritic assigned a score of 69 out of 100 based on reviews from 7 critics, indicating \"generally favorable\" reviews.\n\nFor the third season, Rotten Tomatoes reported 98% approval with an average rating of 8.60/10 based on 100 reviews. The website's critical consensus reads, \"Finally getting the band back together, Picard final season boldly goes where the previous generation had gone before—and is all the better for it.\" Metacritic assigned a score of 83 out of 100 based on reviews from 16 critics, indicating \"universal acclaim\"."
    },
    {
      "title": "Publishing",
      "content": "In September 2019, CBS announced a novel written by frequent Star Trek author Una McCormack to be published by Simon & Schuster in February 2020. Titled The Last Best Hope, the novel introduces several characters from the first season and leads directly into its events. A three-issue comic book titled Star Trek: Picard – Countdown was also set to be released beginning that November by IDW Publishing. Written by Mike Johnson and Picard supervising producer Kirsten Beyer, the comic is set in 2385, and depicts Admiral Picard's actions during the evacuation of Romulus. A second novel, Dark Veil by James Swallow, was published in January 2021 and follows Riker and Troi aboard the USS Titan a year after Picard retires from Starfleet. Rogue Elements by John Jackson Miller was released in August 2021 and tells the backstory of Cristóbal Rios.\n\nAnother three-issue comic by Johnson and Beyer, Star Trek: Picard – Stargazer, is set between the second and third seasons. Published by IDW beginning in August 2022, it features art by Angel Hernandez and tells a story in which Picard returns to helm the USS Stargazer. McCormack's second Picard novel, Second Self, centers on Raffi Musiker between the first and second seasons. It was released in September 2022."
    },
    {
      "title": "Aftershows",
      "content": "In January 2020, CBS All Access announced that The Next Generation actor Wil Wheaton would host a new season of the Star Trek aftershow The Ready Room, to stream after the release of each Picard episode. Wheaton replaced Naomi Kyle, who hosted the series for its first run after episodes of Discovery second season. After each episode of the first season, Deadline Hollywood released an episode of a weekly aftershow podcast titled Star Trek: Picard Podcast. Hosted by Deadline's senior editor Dominic Patten and genre editor Geoff Boucher, each episode of the podcast features interviews with the series' cast and creative team."
    },
    {
      "title": "Audio drama",
      "content": "Simon & Schuster announced an audio-exclusive story, titled No Man's Land, in January 2022. Written by Kirsten Beyer and Mike Johnson, the story is set after the series' first-season finale and follows the characters Raffi and Seven of Nine, with Michelle Hurd and Jeri Ryan reprising their respective roles from the series. Fred Tatasciore, John Kassir, and John Cutmore-Scott also star in the drama, which was released on February 22, 2022."
    },
    {
      "title": "Star Trek: Short Treks",
      "content": "When the Discovery companion series Star Trek: Short Treks was being released in December 2018, CBS chief creative officer David Nevins said more shorts would be released before Picard. In February 2019, Kurtzman said future shorts could tie-into series other than Discovery. At the 2019 San Diego Comic-Con, Kurtzman announced that the second group of Short Treks would include a teaser for Picard set 15 years before the start of the series. Titled \"Children of Mars\", the short was released on January 9, 2020, and depicts the synthetic attack on Mars from the first season's backstory. This is told from the perspective of two school children."
    },
    {
      "title": "Potential film continuation",
      "content": "Stewart said in November 2022 that he would like to make another Star Trek film with the cast of The Next Generation. He reiterated this wish in February 2023, praising the ending of Picard but feeling there were questions left unanswered and saying \"it might be a good idea to look at Jean-Luc Picard one more time in a different atmosphere, and then wrap him up with certainty.\" That April, Paramount+ announced that the franchise was expanding into television films with Star Trek: Section 31. In June, Stewart said he still thought a film would be an appropriate way to end his time as Picard, but there had been \"no eager response\" from the studio about the idea and he had been asked to stop talking about it. In his memoir Making It So which was released later that year, Stewart said he was \"gently pushing\" Paramount to make a Picard film and had discussed the idea with Frakes, Burton, and Spiner. He said they were all open to reprising their roles in the film and Frakes was his personal first choice to direct. In January 2024, Stewart said he had just been told that a Star Trek film was being written for him to star in and he should expect to receive the script in the next week or so. The next month, Matalas said he was open to making a television film that could serve as a backdoor pilot for his proposed Star Trek: Legacy spin-off series, as long as he could hire the cast and crew that he wanted. By the end of March, Kurtzman was considering a follow-up to Picard as one of the next Star Trek television films if Section 31 was successful."
    },
    {
      "title": "Potential series continuation",
      "content": "Goldsman and Matalas stated in January 2022 that elements of the series could be explored more in a spin-off series, with Matalas describing Picard 25th century setting as the \"present day of Star Trek... what's going on in that particular world is very important to me\". By that May, some fans had begun championing the idea of a spin-off series featuring Ryan as Seven of Nine and Hurd as Raffi. Matalas said he was \"not just supporting, [but] spearheading\" the idea, which both actresses also expressed interest in. In November, Frakes said Picard was \"ripe for a continuation of some version of what we've established in the show. Not more Picard, but certainly, Next Gen is alive and well.\" McFadden added that the Next Generation cast were excited to continue in their roles after the third season. In January 2023, Kurtzman said it was possible for the series to continue beyond its third season. The next month, Matalas said the third season of Picard would feel like \"the final voyage\" of the Next Generation main cast, but a \"Next, Next Generation\" series could continue the story and include \"legacy characters\" from The Next Generation, Voyager, and Deep Space Nine. He said a spin-off series was not in development but he would love to be involved if it ever was, and suggested the possible title Star Trek: Legacy.\n\nIn March 2023, Ryan shared a fan petition calling for a Star Trek: Legacy series to be made, similar to an earlier fan petition that led to the development of Star Trek: Strange New Worlds. However, the spin-off was considered unlikely to be ordered in the near future due to Paramount+'s recent cost-cutting measures and the fact that multiple Star Trek series were already in development. Matalas confirmed in April that this was the situation, but he had still been discussing his ideas for the spin-off with Kurtzman who added, \"We've heard the fans loud and clear. There's obviously more story to tell. So, we'll see.\" After Picard ended, Matalas confirmed that he envisioned Star Trek: Legacy as following the crew of the USS Enterprise-G who would be led by Captain Seven of Nine and include Raffi, Speleer's Jack Crusher, Ashlei Sharpe Chestnut's Sidney La Forge, and Mica Burton's Alandra La Forge. Stewart said he was open to making guest appearances as Picard alongside Speleers. Matalas said Worf's son Alexander Rozhenko from The Next Generation and Deep Space Nine would appear in the potential spin-off series, and he wanted Todd Stashwick, who portrayed Captain Liam Shaw in the third season of Picard, to return despite his character's death. He said Stashwick's return would be as \"a Shaw character\".\n\nGoldsman stated in June 2023 that fan appetite for Star Trek: Legacy was undeniable and he had signed the petition asking Paramount to make the series; the petition was approaching 60,000 signatures at that point, nearly doubling the amount received by the Strange New Worlds petition. In January 2024, Hurd expressed her hope that work could begin on the series following Section 31 and Star Trek: Starfleet Academy. Kurtzman said at the start of April that he would have green-lighted Star Trek: Legacy by then if he could, but the decision was \"beyond [his] paygrade\"."
    }
  ]
}