{
  "title": "Spock",
  "parentTitle": "Star Trek: The Original Series",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Created By",
      "value": "Gene Roddenberry"
    }
  ],
  "content": "Spock is a fictional character in the Star Trek media franchise. He first appeared in the original Star Trek series serving aboard the starship USS Enterprise as science officer and first officer (and Kirk's second-in-command) and later as commanding officer of the vessel. Spock's mixed human–Vulcan heritage serves as an important plot element in many of the character's appearances. Along with Captain James T. Kirk (William Shatner) and Dr. Leonard \"Bones\" McCoy (DeForest Kelley), he is one of the three central characters in the original Star Trek series and its films. After retiring from active duty in Starfleet, Spock served as a Federation ambassador, and later became involved in the ill-fated attempt to save Romulus from a supernova, leading him to live out the rest of his life in a parallel universe.\n\nSpock was played by Leonard Nimoy in the original Star Trek series, Star Trek: The Animated Series, eight of the Star Trek feature films, and a two-part episode of Star Trek: The Next Generation. Multiple actors have played the character since Nimoy within Star Trek's main continuity; the most recent portrayal is Ethan Peck, who played Spock as a recurring character in the second season of Star Trek: Discovery and in Star Trek: Short Treks, and as a main character in Star Trek: Strange New Worlds (both a Discovery spin-off and a prequel to the original Star Trek series). Additionally, Zachary Quinto played an alternate reality version of Spock in the feature films Star Trek (2009), Star Trek Into Darkness (2013), and Star Trek Beyond (2016). Although the three films are set in the aforementioned parallel timeline, Nimoy appears in the first two as the original timeline's Spock.\n\nAside from the series and films in the Star Trek franchise, Spock has also appeared in numerous novels, comics, and video games. Nimoy's portrayal of Spock made a significant cultural impact and earned him three Emmy Award nominations. His public profile as Spock was so strong that both his autobiographies, I Am Not Spock (1975) and I Am Spock (1995), were written from the viewpoint of coexistence with the character.",
  "sections": [
    {
      "title": "Back story",
      "content": "Born to the Vulcan Sarek (Mark Lenard) and the human Amanda Grayson (Jane Wyatt), Spock's backstory has been addressed during several episodes of Star Trek: The Original Series, the 2009 film Star Trek and the Star Trek: The Animated Series episode, Yesteryear. His mixed heritage led to a troubled childhood; full-blooded Vulcan children repeatedly bullied him on their home world to incite the emotions of his human nature. For a time, he grew up alongside his older half-brother Sybok, until the older brother was cast out for rejecting logic. In Star Trek: Discovery, it is revealed that Spock has a human, adopted sister, Michael Burnham. According to the episode \"Amok Time\", Spock was betrothed to T'Pring (Arlene Martel) during his childhood.\n\nSarek supported Spock's scientific learning and application to the Vulcan Science Academy, as mentioned in \"Journey to Babel\". In the 2009 film Star Trek, Spock rejects his acceptance into the Vulcan Science Academy on the basis that they would never fully accept someone who was only half-Vulcan. Although this film set the Kelvin timeline scene in this and later films, writer Roberto Orci stated that he felt that the actions were unaffected by the changes in this timeline and so would have occurred in the same manner prior to The Original Series. Because Spock did not enter the VSA and sought to join Starfleet instead, he did not speak to his father for the following 18 years."
    },
    {
      "title": "\"The Cage\" and the first season",
      "content": "Spock appeared as the science officer on the USS Enterprise in the first pilot for the series, \"The Cage\". This was not shown on television at the time, but the events of the episode were shown in the two-part episode \"The Menagerie\" of the first season, and Spock's previous 11 years of service on the Enterprise were described. Spock was one of the members of the away team who joined Captain Christopher Pike (Jeffrey Hunter) on a mission to Talos IV to investigate a distress call. Spock did appear in the second pilot, \"Where No Man Has Gone Before\", but this was broadcast initially as the third episode. During the events of that pilot, Spock became concerned at the risk to the ship posed by Lieutenant Commander Gary Mitchell (Gary Lockwood) and suggested possible solutions to Captain James T. Kirk (William Shatner).\n\nThe earliest appearance of Spock in the series as broadcast was in \"The Man Trap\", the first such episode. When he needs to knock out an evil version of Kirk in \"The Enemy Within\", he uses a Vulcan nerve pinch. Spock and Chief Engineer Montgomery \"Scotty\" Scott (James Doohan) work together to rejoin the good and evil versions of the Captain, which had been split following a transporter accident. During \"Miri\", he finds himself to be the only member of the landing party to be immune to the physical effects of the disease affecting human adults on the planet. However, he realizes that he is probably a carrier and could infect the Enterprise if he were to return. Doctor Leonard McCoy (DeForest Kelley) manages to devise a cure, allowing the team to return to the ship.\n\nWhen Simon van Gelder enters the bridge armed with a phaser in \"Dagger of the Mind\", Spock subdues him with a nerve pinch. He later conducts a mind meld with van Gelder as part of the investigation into the activities of the nearby colony. After power to the colony is shut down, and a protective force field drops, Spock leads an away team to rescue Kirk. Spock is reunited with Christopher Pike (Sean Kenney) in \"The Menagerie\". Pike had been promoted to Fleet Captain but suffered an accident, resulting in severe burns and confining him to a wheelchair and restricting his communication to yes/no answers via a device connected to his brainwaves. Spock commits mutiny and directs the ship to travel to Talos IV, a banned planet. He recounts the events of \"The Cage\" under a tribunal to Kirk, Pike and Commodore Jose I. Mendez (Malachi Throne). As the Enterprise arrives at the planet, Mendez is revealed to be a Talosian illusion. At the same time, the real Mendez communicates from Starfleet, giving permission for Pike to be transported to the planet, and all charges against Spock are dropped.\n\nWhile the Enterprise is under threat in \"Balance of Terror\", Spock is accused by Lieutenant Stiles (Paul Comi) of knowing more about the Romulans than he admits when the alien's similar physical appearance is revealed. Spock hypothesizes that they are an offshoot of the Vulcan race. He saves the Enterprise, manning the phaser station and saves the life of Stiles in the process. In \"The Galileo Seven\", Spock leads a landing party on the shuttlecraft Galileo, which is damaged and pulled off its course before landing on the planet Taurus II. Lieutenant Boma (Don Marshall) criticizes Spock's fascination with the weaponry of the natives after the death of Lieutenant Latimer (Rees Vaughn) at their hands. After Scotty uses the power packs of the party's phasers to supply enough energy to get the damaged shuttle back into orbit, Spock decides to dump and ignite the remaining fuel to attract the attention of the Enterprise. The procedure is successful and the crew on the shuttle are rescued.\n\nSpock encounters old acquaintance Leila Kalomi (Jill Ireland) in \"This Side of Paradise\" after joining an away team to the planet Omicron Ceti III. After being affected by mind-altering spores, Spock begins acting out of character and with overt emotion, partaking in a romantic liaison with Kalomi, who had always desired a relationship but Spock had never reciprocated her feelings. The impact of the spores on him is cured after Kirk goads him into anger, and once freed of the effects, Spock is able to initiate a solution which cures the rest of the crew. Spock attempts to mind meld with a non-humanoid Horta in \"The Devil in the Dark\", having initially suggested that Kirk should kill the creature. Following a second mind meld, Spock relays the history of the Horta and is able to create peace between the aliens and a nearby colony. Both Spock and Kirk undertake guerrilla warfare against the occupying Klingon forces on the planet Organia, prior to the establishment of the Organian Peace Treaty in \"Errand of Mercy\". To restore the timeline, he travels with Kirk back to 1930's New York City in \"The City on the Edge of Forever\". He uses technology of that period to interface with his tricorder over the course of the weeks they spend in the period before witnessing Edith Keeler's (Joan Collins) death."
    },
    {
      "title": "Season two and three",
      "content": "During the premiere episode of the second season, \"Amok Time\", Spock begins to undergo pon farr, the Vulcan blood fever, and must undergo a ritual mating in the next eight days or die. Kirk disobeys Starfleet orders and takes the Enterprise to the planet Vulcan so that Spock can undergo the mating ritual. When they arrive, he is reunited with T'Pring (Arlene Martel). She rather wishes to be with Stonn (Lawrence Montaigne), a full-blooded Vulcan. She demands the ritual kal-if-fee fight instead, and selects Kirk as her champion, who unknowingly agrees to a fight to the death with Spock. McCoy persuades T'Pau (Celia Lovsky) to let him inject Kirk with something to alleviate the issues with Vulcan's thinner atmosphere and make the fight fair. The fight begins, and Spock gains the upper hand, garroting Kirk and killing him. McCoy orders an emergency transport directly to sickbay, while Spock is told by T'Pring that it was all a game of logic which would let her be with Stonn no matter the outcome. No longer feeling the effects of the pon farr, Spock returns to the Enterprise where he discovers that McCoy had injected Kirk with a paralyzing agent which merely simulated death and that the Captain was still alive. Over the course of the encounter with the Nomad space probe in \"The Changeling\", Spock undertakes a mind meld with the machine. Kirk stops the meld when he realizes that Spock's personality starts to be changed by the contact. Following a transporter accident which transports Kirk, McCoy, Uhura and Scotty to a Mirror Universe and swaps them with their counterparts in the episode \"Mirror, Mirror\", they encounter a different version of Spock. Sporting a beard, he grows suspicious of the activities of the suddenly changed personnel and under Starfleet orders, attempts to kill Kirk. Mirror-Spock is knocked unconscious, and is treated by McCoy while the others head to the transporter to attempt to return to their universe. Spock awakes and mind melds with McCoy to discover why Kirk did not have him killed. Discovering what took place, he agrees to help them return and as he mans the transporter controls, Kirk implores him to take control and save not only the ship but his Terran Empire from implosion at the hands of tyrants. The switch is once again successful, and the crew members return to their relevant universes."
    },
    {
      "title": "The Motion Picture and the film series",
      "content": "At the beginning of Star Trek: The Motion Picture (1979), Spock is no longer serving in Starfleet, having resigned and returned home to pursue the Vulcan discipline of Kolinahr. Unable to complete the Kolinahr ritual after he senses the coming of V'ger, he rejoins Starfleet to aid the Enterprise crew in their mission. Spock is later promoted to captain, and is commanding officer of the Enterprise at the beginning of Star Trek II: The Wrath of Khan (1982). At the film's end, he transfers his \"katra\" – the sum of his memories and experience – to McCoy, and then sacrifices himself to save the ship and its crew from Khan Noonien Singh (Ricardo Montalbán). The sequel, Star Trek III: The Search for Spock (1984), focuses on his crewmates' quest to recover Spock's body, learning upon arrival that he has been resurrected by the Genesis matrix after landing on the planet at the end of the previous film. At the film's conclusion, Spock's revived body is reunited with his katra. Spock is next seen in Star Trek IV: The Voyage Home (1986), which depicts his recovery from the after-effects of his resurrection. After saving planet Earth with his comrades, Spock reconciles with his father who has reconsidered his opinion regarding Spock's life choices and his friends. In the film's final scene, he joins the crew of the newly commissioned USS Enterprise-A under Kirk's command. In Star Trek V: The Final Frontier (1989), Spock and the Enterprise crew confront the renegade Sybok, Spock's half-brother. Star Trek VI: The Undiscovered Country (1991) reunites the Enterprise crew on a mission to prevent war from erupting between the Federation and Klingon Empire. Spock serves as a special envoy to broker peace with the Klingons after a natural disaster devastates their homeworld."
    },
    {
      "title": "Star Trek: The Next Generation",
      "content": "After a period during which the production team avoided mentioning some aspects of The Original Series, Spock was mentioned by name in Star Trek: The Next Generation in the episode \"Sarek\" (1990). Executive producer Michael Piller later described this one act as \"the breakthrough which allowed us to open the doors, that allowed us to begin to embrace our past\".\n\nSpock appears in \"Unification\" (1991), a two-part episode of Star Trek: The Next Generation. Set 75 years after the events of The Undiscovered Country, the episode focuses on Federation Ambassador Spock's attempt to reunite the Romulans with their Vulcan brethren. Filming of The Undiscovered Country overlapped with production of this episode, and the episode references Spock's role in the film. While Spock's initial unification campaign fails, he chooses to remain on Romulus in secret to help the movement."
    },
    {
      "title": "Star Trek (2009)",
      "content": "Spock's next appearance in the live action Star Trek franchise is the 2009 Star Trek film. Nimoy was given approval rights over Spock's casting and supported Quinto being cast as the role. During the film's flashback, set 19 years after the events of \"Unification\", and as depicted in the comic miniseries Star Trek: Countdown, Ambassador Spock (Nimoy) promises the Romulans he will use Vulcan technology to save them from a rogue supernova that threatens to destroy their Empire. He pilots an advanced starship equipped with red matter, a powerful substance able to create artificial black holes. The mission is only partially successful, and in the aftermath, Spock is pursued into the past by Nero (Eric Bana), a Romulan driven mad by the loss of his homeworld and family, setting into motion the events of the film.\n\nIn the film's opening act, Nero's ship emerges in the year 2233, and through its interaction with the inhabitants, inadvertently creates an \"alternate, parallel 'Star Trek' universe\". Twenty-five years later, in the new reality, Spock's ship emerges and Nero captures him and the red matter. Stranded in the alternate past, the prime version of Spock helps the alternate, younger version of himself and Kirk (Zachary Quinto and Chris Pine, respectively) thwart Nero's attempt to destroy the Federation.\n\nThe film also features Jacob Kogan in several scenes depicting Spock's childhood, including his abuse at the hands of other Vulcan children due to his half-Human heritage, and his relationship with his parents (Ben Cross and Winona Ryder). The film also depicts Kirk and Spock's initial clashes at Starfleet Academy, and the gradual development of their friendship based on shared mutual respect, what the elder Spock calls \"...a friendship that will define them both in ways they cannot yet realize.\" A major change in characterization from the primary timeline is alternate Spock's involvement with alternate Uhura (Zoe Saldana), his former student. At the end of the film, the young Spock opts to remain in Starfleet while his older self stays in the altered universe to aid the few surviving Vulcan refugees, as Nero had destroyed Vulcan, Spock's home planet."
    },
    {
      "title": "Star Trek Into Darkness (2013)",
      "content": "In Star Trek Into Darkness, Spock Prime is described as living on 'New Vulcan' while the younger Spock remains aboard the Enterprise, struggling with the loss of his home world, as well as his relationships with Uhura and James T. Kirk. Spock nearly dies protecting a planet from an active volcano, but Kirk breaks the Prime Directive and saves him. Spock Prime is contacted by Spock on the Enterprise, to find out details on Khan. Spock Prime initially reminds his alternate self that he will not interfere with the events in the alternate timeline. That being said, he then informs Spock that Khan was a dangerous man, and the greatest threat that the Enterprise ever faced in his own timeline, and warns that he is likely as dangerous in Spock's alternate timeline as well. When asked whether Khan was defeated, Spock Prime answers that he eventually was defeated, but at great cost (referring to the events of Star Trek II: The Wrath of Khan). When Kirk contracts radiation poisoning and dies in front of Spock (a transposed parallel of events in the prime timeline where Spock dies in front of Kirk), an enraged and vengeful Spock attempts to kill Khan to avenge Kirk before Uhura informs him that Khan's regenerative blood can revive Kirk. Nearly a year later, Spock remains as Kirk's chief science officer and executive officer as the Enterprise departs on its first five-year mission of deep-space exploration.\n\nInto Darkness would be Nimoy's final appearance as Spock Prime, as well as the last role of his career. He died in 2015, shortly before production began on Star Trek Beyond."
    },
    {
      "title": "Star Trek Beyond (2016)",
      "content": "In Star Trek Beyond, Spock receives word that Ambassador Spock (Spock Prime) has died. Impacted by this, Spock later tells McCoy that he intends to leave Starfleet to continue the ambassador's work on New Vulcan. At the end of the film, Spock receives a box containing some of Ambassador Spock's personal effects, and reflecting on a photograph of the older crew of the Enterprise from the series' original timeline, he chooses to remain in Starfleet."
    },
    {
      "title": "Star Trek: Discovery",
      "content": "In August 2018, it was announced that Ethan Peck would join the cast of Star Trek: Discovery as Spock in the show's second season, portraying a Spock younger than both Nimoy's and Quinto's renditions of the character, as Discovery is set several years before the Original Series and Kelvin Timeline films.\n\nAs of his appearances on Discovery, Spock is a Lieutenant, serving under Captain Christopher Pike on the Enterprise. Due to the trauma Spock suffered because of his visions of the \"Red Angel\", he is on leave from the Enterprise and under psychiatric care. His adopted sister Michael Burnham is attempting to help him recover.\n\nThe introduction to the second-season episode, \"If Memory Serves\", uses archival footage of Nimoy as Spock from the unaired pilot episode \"The Cage\", and the third-season episode \"Unification III\" uses archival footage of Nimoy again from the Star Trek: The Next Generation episode \"Unification II\". The latter appearance is a holographic recording from the records of Jean-Luc Picard, and is shown to Michael Burnham after she travels to the 31st Century, a time in which the Romulan and Vulcan peoples remember Ambassador Spock as the cause of their reunification on the planet Ni'Var, the newly renamed Vulcan."
    },
    {
      "title": "Star Trek: Short Treks",
      "content": "In 2019, it was announced that the character Spock, as played by Peck would appear in two Star Trek: Short Treks, along with Captain Pike. He reprised the role in the episodes \"Q&A\" and \"Ask Not\"."
    },
    {
      "title": "Star Trek: Strange New Worlds",
      "content": "In May 2020, it was announced that Spock (Ethan Peck) would return in the series Star Trek: Strange New Worlds alongside Captain Pike (Anson Mount) and Number One / Una (Rebecca Romijn)."
    },
    {
      "title": "The Original Series",
      "content": "The earliest known mention of Spock occurred during a conversation between Star Trek's creator, Gene Roddenberry, and actor Gary Lockwood, in which Lockwood suggested Leonard Nimoy for the role. The trio had previously worked together on Roddenberry's The Lieutenant, in the episode \"In the Highest Tradition\". Roddenberry agreed to the idea, but was required to audition other actors for the part. At the time, Roddenberry sought DeForest Kelley to play the doctor character in the pilot, \"The Cage\", but both NBC executives and director Robert Butler wanted Kelley to play Spock. Roddenberry offered the part to both Kelley and Martin Landau, but they both turned him down. When offered, Nimoy accepted the part, but was apprehensive about the make-up, which had not yet been determined.\n\nDuring an interview segment of TV Land's 40th anniversary Star Trek marathon on November 12, 2006, Leonard Nimoy stated that Gene Roddenberry's first choice to play Spock was George Lindsey. Because of the flippant way Nimoy makes the comment, it has been suggested that he was joking. The claim Lindsey was offered the role is given more credibility when Lindsey's close friend Ernest Borgnine writes in his autobiography, \"my hand to God – he turned down the part of Mr. Spock on TV's Star Trek, the role that made Leonard Nimoy famous.\" The character evolved from having a metal plate in his stomach, through which he ingested energy, to being a half-Martian in the original 1964 pitch, with a \"slightly reddish complexion and semi-pointed ears\". Due to Roddenberry's concern that a Mars landing might take place before the end of the series, Spock's home planet was changed. Lee Greenway conducted the initial makeup tests on Nimoy, but after four or five days, Fred Phillips was asked to take over. Phillips in turn asked John Chambers to create Spock's ears, as he was working on getting an appropriate shade of red for Spock's skin; this idea was later abandoned in favor of a yellow hue because of the effects on black and white television. Nimoy hated the ears, and Roddenberry promised him that if he was still unhappy by the 13th episode then they'd find a way to write them out. The NBC executives were also concerned, as they felt it made the character satanic.\n\nAt Roddenberry's insistence, Spock was the only character retained for the second pilot, \"Where No Man Has Gone Before\". However, NBC demanded that he be only a background character, and when it went to series, the tips of Spock's ears were airbrushed out on promotional materials. It was during early episodes such as \"The Corbomite Maneuver\" and \"The Naked Time\" that Nimoy came to understand the nature of the character. After eight episodes, NBC executives complained to Roddenberry that there was not enough Spock in the series; \"Spockmania\" had begun. In response, Spock was moved to a more prominent role within the series, such as taking the lead role in \"This Side of Paradise\" over Sulu. The popularity of the character caused frictions with Shatner, and rumors spread that he was going to be dropped from the show and replaced as the lead by Nimoy as Spock. A drawn out contract renegotiation at the start of season two resulted in Roddenberry considering whether or not to replace Nimoy and the character. Both Mark Lenard and Lawrence Montaigne were seriously considered.\n\nThe character continued to develop, with Nimoy creating the Vulcan salute during the filming of \"Amok Time\". This was based on a Jewish Kohen he had seen as a child. During the course of the season, a rift grew between Nimoy and Roddenberry and by the end of the year, they only spoke through formal letters. After the departure of producer Gene L. Coon and the stepping back of Roddenberry during the third season, Nimoy found that the writing of Spock deteriorated. In particular, he did not like the character being made a fool of during the episode \"Spock's Brain\". The interracial kiss between Kirk and Uhura in \"Plato's Stepchildren\" had been intended by the writers to be between Spock and Uhura, but Shatner persuaded them to change it.\n\nFor his role as Spock, Leonard Nimoy was nominated three times Emmy Award for Outstanding Supporting Actor in a Drama Series, and is currently the only Star Trek actor to be nominated for an Emmy."
    },
    {
      "title": "Revival attempts and the film franchise",
      "content": "Nimoy agreed to return to Spock during one of the early 1970s attempts to create a Star Trek film, entitled Star Trek: The God Thing, but dropped out after his likeness as Spock was used without permission to advertise Heineken beer. He was persuaded to return to the role of Spock as the lead for the planned Trek film titled Planet of the Titans to be directed by Philip Kaufman. When this project was killed in favor of a new television series, Star Trek: Phase II, Nimoy was reportedly just offered only a recurring part by Roddenberry, so refused to appear at all. When the decision was made to turn the TV pilot script into Star Trek: The Motion Picture, director Robert Wise insisted Nimoy to return as the character, which was only accomplished by Jeffrey Katzenberg forcing Paramount to settle the dispute with Nimoy over licensing use of his image.\n\nAs on the series, Nimoy, calling on method acting training, would often not break character between takes.\n\nDissatisfied with the first Trek feature, Nimoy was reluctant to return for Star Trek II: The Wrath of Khan but was convinced by the promise of a dramatic death scene. Nimoy enjoyed the production of the film so much that despite his character's on-screen death he wanted to return for a sequel. The film's success allowed Nimoy to successfully negotiate to direct the next installment in addition to briefly appearing as a reanimated Spock. The resulting film, Star Trek III: The Search for Spock was successful enough that Nimoy was asked to direct once more for Star Trek IV: The Voyage Home. The following film of the series, the William Shatner-directed Star Trek V: The Final Frontier was initially unacceptable to Nimoy because it called for Spock to betray Kirk and side with his newly introduced half-brother Sybok. Nimoy felt his character had already come to terms with his human-side thus Sybok would have no influence on him, and forced the script to be changed before signing on. Nimoy subsequently organized Star Trek VI: The Undiscovered Country, choosing the director, writers and producers. To hand over to Star Trek: The Next Generation at the time of The Undiscovered Country, Nimoy agreed to appear as Spock in the episode \"Unification\". Nimoy subsequently turned down the directing role on Star Trek Generations as he wanted to rework the script, and refused reprising the role of Spock for what was essentially a cameo appearance, and his character's lines were subsequently given to Scotty.\n\nWhen recasting the role for 2009's Star Trek, Nimoy was asked his opinion. He highlighted the work of Zachary Quinto, as he felt he looked similar and could portray the inner thought process of the character. Quinto became the first actor to be cast for the film, and Nimoy agreed to return as the version of the character from the \"Prime\" universe. Nimoy said that he returned because of the enthusiasm from director J. J. Abrams and the writers, and because it made him feel appreciated. Nimoy made a final appearance as Spock in Star Trek Into Darkness as a favor to Abrams. At the time, he did not rule out returning again, but he died prior to the following film. In Star Trek Beyond, Quinto's Spock mourns the loss of Spock Prime, as played by Nimoy."
    },
    {
      "title": "Reception",
      "content": "\"Given the choice\", Nimoy said years after the show ended, \"if I had to be someone else, I would be Spock.\" He recalled, more than a decade after the show's cancellation:\n\n\"The 'Star Trek' phenomenon continues to amaze and confound me. It was incredible, and it still is, although it is gentler now than it used to be. For a time, it was hysterical – it was so wild I had to be very careful where I went. If I went to a restaurant, I had to plan my entrances and my exits so I wouldn't be mobbed and hurt. Same thing in hotels and airports – any public place. It isn't that hysterical any more, but it is still a potent force.\"\n\nFrom early on, the public reacted very positively—even fanatically—to his character, in what The Boston Globe in 1967 described as \"Spockmania\". Headshots of Spock became popular souvenirs, with the rare ones of the actor laughing the most valuable. Nimoy reported that \"within two weeks after [\"Amok Time\"], my mail jumped from a few hundred letters to 10,000 a week\". When he appeared as Spock as grand marshal of a Medford, Oregon, parade in April 1967, thousands gathered to receive autographs: \"They surged forward so quickly that I was terrified someone would be crushed to death; and then they started pressing against the bandstand so hard it began to sway beneath my feet!\" After being rescued by police, \"I made sure never to appear publicly again in Vulcan guise\", Nimoy stated.\n\nFans asked Nimoy questions about current events such as the Vietnam War and LSD as if he were the Vulcan scientist; one even asked the actor to lay his hands on a friend's eyes to heal them. When a biracial girl wrote asking for advice on how to deal with persecution as \"a half-breed\", Nimoy responded that young Vulcans had treated Spock similarly and that she should, as he did, \"realize the difference between popularity and true greatness\". The actor believed that the character appealed to viewers, especially teenagers, because\n\n\"Spock understands the trauma of human existence, for he is not home with earthmen or Vulcan; he can function only in the fabricated and neatly ordered society of the Enterprise. There, he knows who he is; he relates to his role very specifically, and this gives him a kind of cool.\"\n\nTo Nimoy's surprise, Spock became a sex symbol; Isaac Asimov described the character as \"a security blanket with sexual overtones\" and Nimoy reported, \"I've never had more female attention on a set before. And get this: they all want to touch the ears!\" (When a young woman asked \"Are you aware that you are the source of erotic dream material for thousands and thousands of ladies around the world?\", he replied \"May all your dreams come true\".) Nimoy speculated that Spock appealed to women because\n\n\"Down comes a stranger—tall, dark, thoughtful, alien and exotic. Somewhat devilish in appearance. He has a brilliant mind, the wisdom of a patriarch and is oh, so cool.\n\nWith one raised eyebrow, he suggests he is above game-playing and role-playing—which are just hangovers from Earth's Victorian Age—that he and he alone understands the deepest needs and longings of the Earth female.\"\n\nNASA made Spock an informal mascot. Nimoy was invited to be guest of honor at the March 1967 National Space Club dinner and to take an extensive tour of the Goddard Space Flight Center in Greenbelt, MD. The actor concluded from the warm and intense reception he received that astronauts like John Glenn and aerospace industry engineers, secretaries, and shareholders alike all regarded Star Trek, and especially the character of Spock, as a \"dramatization of the future of their space program\".\n\nAn asteroid in the Eos family discovered on August 16, 1971, was named Mr. Spock after the discoverer James B. Gibson's cat (which had been named Mr. Spock, who was likewise \"imperturbable, logical, intelligent, and had pointed ears\").\n\nSpock proved inspirational to many budding scientists and engineers. Nimoy has said that many of them, on meeting him, were eager to show him their work and discuss it with him as if he were a scientific peer, as opposed to an actor, photographer, and poet. His stock response in these situations was \"it certainly looks like you're headed in the right direction\".\n\nIn 2004, Spock was ranked number 21 in Bravo's list of The 100 Greatest TV Characters. In 2008, UGO named Spock one of the 50 greatest TV characters. According to Shatner, much of Star Trek's acting praise and media interest went to Nimoy.\n\nIn 2012, IGN ranked the character Spock, as depicted in the original series and the 2009 film Star Trek, as the second top character of the Star Trek universe, with Kirk in the top spot.\n\nIn 2016, Adam Nimoy released his documentary film For the Love of Spock, about his father and his iconic character.\n\nIn 2017, Screen Rant ranked Spock the 5th most attractive person in the Star Trek universe, in between Michael Burnham and Seven of Nine. In 2018, they ranked Spock as one of the top 8 most powerful characters of Star Trek (including later series).\n\nIn 2018, CBR ranked Spock the 6th best Starfleet character of the Star Trek franchise."
    },
    {
      "title": "Reaction to Spock's death",
      "content": "The Wrath of Khan had its first public screening at a science-fiction convention in Overland Park, Kansas on May 8, 1982, almost a month before general release. Although Paramount executives were concerned that Spock's death would set fans against the movie, the audience actually applauded after Spock's death scene. \"It was sensational. I hate to be given to superlatives but it absolutely reached everything we wanted it to. I couldn't ask for anything better,\" said co-producer Robert Sallin of the advance audience's reaction.\n\nCritical reaction to Spock's death was mixed. Film critic Roger Ebert lauded Spock's death: \"He makes a choice in Star Trek II that would be made only by a hero, a fool, or a Vulcan. And when he makes his decision, the movie rises to one of its best scenes, because the Star Trek stories have always been best when they centered on their characters.\" Conversely, The Washington Post's Gary Arnold states that Spock's death \"feels like an unnecessary twist, and the filmmakers are obviously well-prepared to fudge in case the public demands another sequel.\"\n\nTwenty-five years later, Spock's death in The Wrath of Khan ranks number 2 on Total Film's list of 25 greatest Star Trek movie moments, and number 1 on IGN Movie's top 10 Star Trek movie moments."
    },
    {
      "title": "Star Trek (2009)",
      "content": "Ty Burr of The Boston Globe described Quinto's performance in the 2009 film as \"something special\", and stated that Nimoy's appearance \"carries much more emotion than you'd expect\". Slate said Quinto played Spock \"with a few degrees more chill\" than Nimoy brought to the original character. Entertainment Weekly said that Quinto \"...invests Spock with a new layer of chilly-smoldering sex appeal, [and] Quinto does a fantastic job of maintaining Spock's calm, no-sweat surface but getting quietly hot and bothered underneath.\""
    },
    {
      "title": "Cultural impact",
      "content": "Spock has been parodied by, and has also been the inspiration for, pop culture works in various media. Composer/keyboardist George Duke's 1976 Solo Keyboard Album features two tracks which pay homage to Spock: \"Spock Gets Funky\" and \"Vulcan Mind Probe\". Rock guitarist Paul Gilbert wrote the song \"Mr. Spock\" on his Space Ship One album. Swedish synthpop band S.P.O.C.K makes music heavily influenced by the Star Trek universe. Assuming the Spock character, Nimoy recorded a number of novelty songs, the first being \"Highly Illogical\", in which Spock pointed out the foibles of human thought, such as relationships, automobiles, and greed. A second song, \"A Visit to a Sad Planet\", was darker in tone and told the story of Spock visiting Earth in the future and discovering it had been ruined by war, violence, and environmental irresponsibility. According to comic book writer and editor Bob Budiansky, The Transformers character Shockwave was inspired by Spock. Spock's utilitarian perspective that \"the needs of the many outweigh the needs of the few\" is cited in a legal decision rendered by the Texas Supreme Court. Leonard Nimoy's second-season Spock costume shirt was expected to sell at auction for over $75,000.\n\nSpock's physical appearance in the Original Series episode \"Mirror, Mirror\" (1967) has itself spawned a trope of the \"evil twin\" archetype found in various fictional genres. In that episode, several members of the Enterprise travel to a parallel universe inhabited by evil versions of themselves. The parallel universe version of Spock is distinguished physically by his goatee. Science fiction blog io9 said that Spock's beard in the episode introduced \"the best shorthand ever for evil parallel universe duplicates\". Examples of the evil goatee's appearances in other media include the host segments of episode 611 of the TV series Mystery Science Theater 3000, Bender's \"evil twin\" Flexo in Futurama, and a 2009 episode of The Colbert Report featuring Stephen Colbert and Dan Maffei wearing fake goatees while pretending to be evil versions of themselves. The name of progressive rock band Spock's Beard is a direct reference to Spock's goatee in this episode."
    },
    {
      "title": "Fan productions",
      "content": "In addition to television, feature films, books, and parodies, Spock has also been portrayed in non-canon fan fiction. Since 2004, the online fan production Star Trek: New Voyages has continued the further voyages of the canceled initial series. The fan-series' creators feel \"Kirk, Spock, McCoy, and the rest should be treated as 'classic' characters like Willy Loman from Death of a Salesman, Gandalf from The Lord of the Rings, or even Hamlet, Othello, or Romeo. Many actors have and can play the roles, each offering a different interpretation of said character.\"\n\nThe fan series Star Trek: New Voyages has featured three actors in the role of Spock. Spock was portrayed by Jeffrey Quinn for the pilot and first three episodes, by Ben Tolpin in episodes 4 and 5, and by Brandon Stacy in episodes 6 through 11. Stacy also served as a stand-in for Zachary Quinto in the 2009 Star Trek film.\n\nThe independent online fan series Star Trek Continues featured Todd Haberkorn as Spock in three vignettes and eleven full episodes between 2013 and 2017.\n\nIn scientific illustrator Jenny Parks' 2017 book Star Trek Cats, Spock is depicted as an Oriental Shorthair."
    },
    {
      "title": "\"Spocking\" Canadian $5 notes",
      "content": "There has been a practice of altering the portrait of Wilfrid Laurier, Canada's prime minister from 1896 to 1911, on Canadian five-dollar notes to look like Spock. After the death of Nimoy in 2015, there was an increase in that practice."
    }
  ]
}