{
  "title": "Montgomery \"Scotty\" Scott",
  "parentTitle": "Star Trek: The Original Series",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Created By",
      "value": "Gene Roddenberry"
    }
  ],
  "content": "Montgomery \"Scotty\" Scott is a fictional character in the science fiction franchise Star Trek. First portrayed by James Doohan in the original Star Trek series, Scotty also appears in the animated Star Trek series, 10 Star Trek films, the Star Trek: The Next Generation episode \"Relics\", and in numerous books, comics, and video games.\n\nSimon Pegg has assumed the character and appeared in the Star Trek reboot (2009) and its sequels, Star Trek Into Darkness (2013) and Star Trek Beyond (2016). In 2023, a young version of Scotty appeared in the final episode of the second season of Star Trek: Strange New Worlds, portrayed by Martin Quinn. Later in 2023, an animated version of Scotty was played by Carlos Alazraqui in a Very Short Treks episode.",
  "sections": [
    {
      "title": "Development and portrayals",
      "content": "Doohan was cast as the Enterprise engineer for the second Star Trek pilot, \"Where No Man Has Gone Before\" (1966) on the recommendation of that episode's director, James Goldstone, who had worked with him before. The character almost did not make it to the show after series creator Gene Roddenberry sent Doohan a letter informing him, \"We don't think we need an engineer in the series\". Only through the intervention of Doohan's agent did the character remain.\n\nDoohan tried a variety of accents for the part and decided to use a Scottish accent on the basis that he thought Scottish people make the best engineers. Doohan himself chose Scotty's first name, Montgomery (Doohan's own middle name), in honor of his maternal grandfather James Montgomery. In a third-season production memo, Roddenberry said Doohan \"is capable of handling anything we throw at him\" and that the \"dour Scot\" works better when being protective of the ship's engines."
    },
    {
      "title": "Doohan depiction",
      "content": "Scotty (the fictional Lt. Commander Montgomery Scott) spent part of his life in Aberdeen, but was born in Linlithgow Scotland. He wears Clan Scott's tartan as part of his dress uniform. Doohan claimed to have based Scotty's accent on an Aberdeen accent he once heard. During the events of Star Trek, Scotty holds the rank of lieutenant commander and serves as the Enterprise's second officer and \"miracle worker\" chief engineer, commanding the ship and recording its log when both Captain James T. Kirk (William Shatner) and First Officer Spock (Leonard Nimoy) are not aboard. Scotty's technical knowledge and skill allow him to devise unconventional and effective last-minute solutions to dire problems. Scotty's identity is strongly connected to the Enterprise itself, and the character often takes a paternal attitude toward the ship. He is frequently the liaison between Captain Kirk's ambitious tactical plans and what is technically feasible in the realm of the starship's capabilities. Scotty asserts in the TNG episode \"Relics\" that he \"never wanted to be anything else but an engineer\". In addition to his engineering abilities, Scotty is often shown to be a fairly heavy drinker but is only shown drunk twice, in \"By Any Other Name\" and \"Relics\".\n\nScotty oversaw the Enterprise's refit prior to the events of Star Trek: The Motion Picture (1979), and is part of the crew when the Enterprise confronts Khan Noonien Singh (Ricardo Montalbán) in Star Trek II: The Wrath of Khan (1982). Although not stated when this occurred in the original release of the film, Peter Preston – who was mortally wounded during the attack on the Enterprise by the USS Reliant, and dies with Scotty at his bedside – was Scotty's nephew. After Scotty was promoted to captain of engineering of the USS Excelsior in Star Trek III: The Search for Spock (1984), he sabotages the new ship and helps Kirk steal the Enterprise to rescue Spock. Scotty joins Kirk's crew aboard the USS Enterprise-A at the end of Star Trek IV: The Voyage Home (1986). In Star Trek V: The Final Frontier (1989), he helps Kirk, Spock and Dr. Leonard McCoy (DeForest Kelley) escape the brig and retake the hijacked Enterprise. Scotty kills Colonel West (René Auberjonois) before the latter can assassinate the Federation president (Kurtwood Smith) in Star Trek VI: The Undiscovered Country (1991). Scotty joins Kirk and Pavel Chekov (Walter Koenig) for the USS Enterprise-B's maiden voyage in Star Trek Generations (1994), saving the ship through his technical expertise.\n\nAfter serving aboard 11 starships in a career spanning 52 years and retiring at the age of 72 with the rank of Captain, Scotty was aboard a transport shuttle en route to a retirement colony when it crashed into a Dyson sphere; stranded, he set the transporter to cycle indefinitely and \"stored\" himself in the buffer for 75 years before being recovered by the USS Enterprise-D crew in \"Relics\". Even though he is no longer able to serve effectively as an engineer and struggles to get used to 24th-century life, Scotty nevertheless helps save the Enterprise-D from being trapped within the sphere. At the end, the 147-year-old Captain Montgomery Scott is given an Enterprise shuttlecraft and left to explore space."
    },
    {
      "title": "Pegg depiction",
      "content": "In September 2007, Paul McGillion auditioned for the Scotty role in the 2009 Star Trek reboot and received James Doohan's son Chris's endorsement. However, Simon Pegg's casting was announced on October 11, 2007. Pegg's portrayal in the 2009 Star Trek reboot has Scotty stuck working at an isolated outpost as punishment for beaming Admiral Jonathan Archer's prized beagle from one planet to the next — and having no idea where it ended up. With assistance from Spock Prime and James Kirk, he joins the Enterprise crew and becomes the ship's chief engineer. Slate.com called Pegg's performance of Scotty in the 2009 Star Trek reboot \"juicily comic\". The character of Scotty has an expanded role in the film Star Trek Beyond (written by Pegg and Doug Jung), in which he meets an alien woman named Jaylah, who leads him to the crashed Federation starship, the USS Franklin. Working together, the two make the ship again flightworthy and Scotty helps Jaylah to see the value of working together with a crew."
    },
    {
      "title": "Early years",
      "content": "A young Scotty, played by Scottish actor Martin Quinn, appears in the Star Trek: Strange New Worlds episode \"Hegemony\". In that episode, Scotty holds the rank of Lieutenant junior grade and is the only survivor of a Gorn attack on his ship, the USS Stardiver. After escaping from the wrecked Stardiver, Scotty took a shuttlecraft and managed to reach a Federation colony on Parnassus Beta. He was then rescued by the Enterprise."
    },
    {
      "title": "Birthplace dispute",
      "content": "Following Doohan's death, several Scottish towns campaigned to be named Scotty's \"official birthplace\". Scripts, production materials and Doohan's family support Aberdeen's claim to being Scotty's birthplace. In \"Wolf in the Fold\" (1967), Scotty says that he is \"an old Aberdeen pub crawler\", as he grew up and spent some of his reprobate youth there. Notwithstanding that caveat, Aberdeen city leaders proposed plans to erect a monument to the actor and character."
    },
    {
      "title": "In popular culture",
      "content": "Scotty's operation of the Enterprise transporter system inspired the catchphrase \"Beam me up, Scotty\", which gained currency in popular culture beyond Star Trek fans (most notably by former U.S. Representative James Traficant), even though the exact phrase is not spoken in that way in the original series, it is used frequently in the animated series. In Star Trek IV: The Voyage Home, Kirk says, \"Scotty, beam me up.\"\n\nDoohan himself briefly reprised the role for a gag cameo in the action comedy Loaded Weapon 1 (1993), as well as being Scotty in the movie Knight Rider 2000 (1991), while parodies of Scotty or his accent appear in such media as World of Warcraft (2004), Spaceballs (1987),Tale Spin, Goof Troop, The Simpsons, Ace Ventura: Pet Detective (1994), Beavis and Butt-Head and All That. Scotty also appeared in a Far Side comic, where he was in Hell.\n\nIn the song \"Boat Drinks\", singer-songwriter Jimmy Buffett asks, \"Could you beam me somewhere, Mister Scott? Any old place, here on Earth or in space, you pick the century and I'll pick the spot.\" Rap artists D4L have a song \"Scotty\" that uses his character and Star Trek, as do Relient K in their song \"Beaming\"."
    },
    {
      "title": "Reception",
      "content": "In 2009, IGN rated Scotty the 16th best character of the Star Trek franchise, including the spin-off shows produced up to that time.\n\nIn 2016, Screen Rant rated Scotty as the 18th best character in Star Trek overall as presented in television and film up to that time, highlighting the character as someone who could get the Enterprise out of trouble, with phrases that added both tension and humor to the show. In 2016, Scotty was ranked as the 19th most important character of Starfleet within the Star Trek science fiction universe by Wired magazine.\n\nIn 2018, The Wrap placed Scotty as 12th out of 39 in a ranking of main cast characters of the Star Trek franchise prior to Star Trek: Discovery. In 2018, CBR ranked Scotty the ninth best Starfleet character of Star Trek.\n\nIn July 2019, Screen Rant ranked Scotty the 5th smartest character of all Star Trek (including later series)."
    }
  ]
}