{
  "title": "Star Trek: Strange New Worlds",
  "parentTitle": "Star Trek",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Created By",
      "value": "Akiva Goldsman\n\nAlex Kurtzman\n\nJenny Lumet"
    },
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    },
    {
      "type": "number",
      "label": "No. of Seasons",
      "value": 2
    },
    {
      "type": "number",
      "label": "No. of Episodes",
      "value": 20
    }
  ],
  "content": "Star Trek: Strange New Worlds is an American science fiction television series created by Akiva Goldsman, Alex Kurtzman, and Jenny Lumet for the streaming service Paramount+. It is the 11th Star Trek series and debuted in 2022 as part of Kurtzman's expanded Star Trek Universe. A spin-off from the series Star Trek: Discovery (2017–2024), it follows Captain Christopher Pike and the crew of the starship Enterprise in the 23rd century during the decade before Star Trek: The Original Series (1966–1969).\n\nAnson Mount, Ethan Peck, and Rebecca Romijn respectively star as Pike, Spock, and Number One, all characters from The Original Series. They were initially cast for the second season of Discovery (2019) and, after positive fan responses, Kurtzman expressed interest in bringing them back for a spin-off. Development began by March 2020 and Strange New Worlds was officially ordered in May. The lead cast and creative team were confirmed, with Goldsman and Henry Alonso Myers as showrunners. Jess Bush, Christina Chong, Celia Rose Gooding, Melissa Navia, Babs Olusanmokun, Bruce Horak, and Martin Quinn also star. Some of those actors play younger versions of Original Series characters. The series is produced by CBS Studios in association with Secret Hideout, Weed Road Pictures, H M R X Productions, and Roddenberry Entertainment. Filming takes place at CBS Stages Canada in Mississauga, Ontario. The showrunners chose to return to the episodic storytelling of The Original Series rather than Discovery more serialized approach.\n\nStar Trek: Strange New Worlds premiered on Paramount+ on May 5, 2022, and its 10-episode first season was released weekly until July. A second season was released from June to August 2023, a third season is set for release in 2025, and a fourth season is in production. The series is estimated to have high viewership and audience demand. It received positive reviews for its episodic storytelling and cast, and several accolades including two Primetime Creative Arts Emmy Award nominations and two Saturn Award wins.",
  "sections": [
    {
      "title": "Premise",
      "content": "Star Trek: Strange New Worlds follows Captain Christopher Pike and the crew of the USS Enterprise (NCC-1701) in the 23rd century as they explore new worlds and carry out missions throughout the galaxy during the decade before Star Trek: The Original Series (1966–1969). It has a contemporary take on The Original Series episodic storytelling and 1960s designs, and is the first Star Trek series since Star Trek: The Next Generation (1987–1994) to feature the franchise's opening narration during its main credits: \"Space, the final frontier. These are the voyages of the starship Enterprise. Its five-year mission: to explore strange new worlds, to seek out new life and new civilizations, to boldly go where no one has gone before.\""
    },
    {
      "title": "Season 4",
      "content": "A fourth season was ordered in April 2024 while the third season was in production. The writers had settled on the ideas for all 10 episodes of the season by the end of July 2024. Filming began on March 3, 2025."
    },
    {
      "title": "Cast and characters",
      "content": "The captain of the USS Enterprise, who struggles with the knowledge that he will suffer a horrible fate. Pike was first portrayed by Jeffrey Hunter in The Original Series as a \"gruff, authoritative commander\" whom Mount described as \"first act Pike... a very young man [who is] very self-involved\". In contrast, Mount's \"second act Pike\" is confident, collaborative, and empathetic. Co-showrunner Akiva Goldsman believed that a \"more thoughtful and contemporary approach\" was required to avoid the toxic masculinity of some previous Star Trek captains, and Mount said his Pike represented \"true masculinity\". Inspired by Mount's own leadership style, Pike's quarters include a kitchen where he convenes the crew, cooks for them, and builds consensus. Pike's hairstyle was widely commented on, drawing comparisons to Elvis Presley and the title character of the animated series Johnny Bravo (1997–2004), spawning Internet memes and its own fan-run Twitter account, and being called \"the best hair quiff on television\". Mount enjoyed this and attributed the style to \"hair guru\" Daniel Losco. A half-Vulcan, half-human science officer aboard the Enterprise. The series explores Spock's struggle to gain acceptance among Vulcans as well as the complicated relationship with his fiancée, T'Pring. Co-showrunner Henry Alonso Myers acknowledged that the writers were interpreting some of The Original Series differently from what fans had previously done to expand on T'Pring's role in this stage of Spock's life. Peck said he was \"constantly checking in\" with original actor Leonard Nimoy's portrayal of Spock, but he also wanted to \"have an experience as Spock\" and not focus on the final outcome for the character. A civilian nurse on the Enterprise. Myers felt the character's portrayal in The Original Series came from a \"very different conception of women and of marriage and what people would do in their jobs\" that modern audiences would not expect, and sought to tell new stories inspired by Bush's strengths. Bush said the character had a \"distinct essence\" but also felt there was room to explore her youth and backstory; the actress focused on the character's \"dry and sarcastic\" personality and developed that into a sense of humor for the younger version. The series explores a friendship and romance between Chapel and Spock. The Enterprise newly assigned chief of security, whose family was murdered by the lizard-like Gorn when she was a child. Chong described the character as guarded and struggling with survivor's guilt but noted that she opens up as the series goes on and the crew of the Enterprise becomes her new family. Serving as security chief allows her to protect that family. La'an is also a descendant of Ricardo Montalbán's Star Trek villain Khan Noonien Singh, and has been discriminated against because of this. Chong related to this aspect of the character because she was bullied as a child for her ethnicity. Ava Cheung plays young La'an. A cadet on the Enterprise specializing in linguistics. Despite the character's important role throughout the Star Trek franchise, the writers felt that there was a lot still unknown about her that could be explored beyond her just being a Starfleet officer. As one of her first television acting roles, Gooding related to Uhura's experiences in the series as a cadet who is learning about the Enterprise. The actress chose to keep her own natural hair rather than wear a wig to match previous Uhura actresses Nichelle Nichols and Zoe Saldaña because she felt they both represented the \"black femininity\" of their times and she could, too, with a modern look. The Enterprise helmsman, who Navia described as a \"highly skilled pilot [and] a veteran... she can handle a gun and also crack a joke\". The actress compared Ortegas to Jonathan Frakes's Next Generation character William Riker, one of her favorite Star Trek characters. Navia worked with John Van Citters—the vice president of Star Trek brand management at CBS Studios—and the series' motion graphics team, who create the display for Ortegas's on-set control panel, to understand how to fly the Enterprise accurately. Ortegas's surname is a reference to the original Star Trek pitch which included a navigator named Jose Ortegas. The Enterprise chief medical officer, who is secretly trying to cure his daughter, Rukiya, of a rare disease. M'Benga was not given a first name in The Original Series, but was referred to as Joseph in the script for the unproduced episode \"Shol\". Posters at the 2022 Star Trek: Mission Chicago convention referred to the character as \"Jabilo\", a name used in some non-canon novels, but the producers soon stated that this was incorrect and the name Joseph was eventually used in Strange New Worlds. Olusanmokun felt he was \"crafting something anew\" with his portrayal since M'Benga only appears in two episodes of The Original Series. The Enterprise chief engineer, Hemmer, is an Aenar, an albino subspecies of Andorians who are generally depicted as blind; Horak is blind in one eye with limited sight in the other, and the first legally blind regular actor in a Star Trek series. The writers always intended for Hemmer to die in the first season as a way to increase the series' stakes, since most of the main characters are still alive in The Original Series. Horak was told about this when he was first cast and hoped to build the character into a \"fan favorite\". He compared the role to the Star Wars character Obi-Wan Kenobi, serving as a mentor to the young Uhura. The first officer of the Enterprise and second-in-command to Pike, the character was only referred to as \"Number One\" in The Original Series but was given the name Una Chin-Riley in several non-canon Star Trek novels. Strange New Worlds brings this name into official canon. The series confirms that Number One is an Illyrian, which Original Series writer D.C. Fontana had established in the novel Vulcan's Glory (1989), and reveals that Illyrians genetically modify themselves. This explains why Number One appears human while the Illyrians seen in the Star Trek: Enterprise episode \"Damage\" (2004) do not, and also aligns with the description of Illyrians practicing \"selective breeding\" in the novel Child of Two Worlds by Greg Cox. The Strange New Worlds writers believed it would be interesting for Number One to be at odds with Starfleet's anti-genetic alteration laws. An engineer. Following the controversial Scottish accents used for the character by Canadian actor James Doohan in The Original Series and English actor Simon Pegg in several Star Trek films, the showrunners wanted to cast an actual Scottish actor and looked at 30 to 50 different actors before Quinn was hired. He worked with the writers to make the character more authentically Scottish.\n * Anson Mount as Christopher Pike:\n * Ethan Peck as Spock:\n * Jess Bush as Christine Chapel:\n * Christina Chong as La'an Noonien-Singh:\n * Celia Rose Gooding as Nyota Uhura:\n * Melissa Navia as Erica Ortegas:\n * Babs Olusanmokun as Joseph M'Benga:\n * Bruce Horak as Hemmer:\n * Rebecca Romijn as Una Chin-Riley / Number One:\n * Martin Quinn as Montgomery Scott:"
    },
    {
      "title": "Background",
      "content": "When Alex Kurtzman, the co-creator and executive producer of Star Trek: Discovery (2017–2024), asked Akiva Goldsman to join that series as a supporting producer, Goldsman believed—based on internet rumors—that it was a prequel to Star Trek: The Original Series (1966–1969) following the USS Enterprise (NCC-1701) under the command of Captain Christopher Pike. He was disappointed to find this was not the case, and with his encouragement the Enterprise was introduced in the first-season finale (2018). Then co-showrunner Aaron Harberts wanted to explore Pike, feeling he had not been seen much in Star Trek, but was less interested in exploring Enterprise crew member Spock due to his many franchise appearances. Harberts was also reluctant to have an actor other than Leonard Nimoy or Zachary Quinto portray the character. However, Spock was confirmed to be in the second season in April 2018. Anson Mount was cast as Pike, and he revealed in July that Rebecca Romijn would portray Original Series character Number One. Mount and Romijn signed one-year deals for the series as part of the producers' attempt to align Discovery more closely with the wider Star Trek continuity than it was in the first season. In August, Ethan Peck was revealed to have been cast as Spock."
    },
    {
      "title": "Development",
      "content": "In June 2018, after becoming sole showrunner of Discovery, Kurtzman signed a five-year overall deal with CBS Television Studios to expand the Star Trek franchise beyond Discovery to several new series, miniseries, and animated series. Mount left Discovery following the second-season finale, and fans began calling for him to reprise his role in a spin-off series set on the Enterprise, alongside Romijn and Peck. Mount and Peck both responded positively to the idea. Mount said Discovery long filming schedule was difficult and his return would involve \"a lot of creative conversations\", but he later added that he had never had such a positive response to his work as he did for Pike and the role \"changed [his] life\".\n\nIn April 2019, Kurtzman was asked about the spin-off idea and said, \"The fans have been heard. Anything is possible in the world of Trek.\" At San Diego Comic-Con in July, Kurtzman announced that the second season of companion series Star Trek: Short Treks (2018–2020) would include three shorts starring the Enterprise actors. He said this was a way to bring those characters and actors back, but would not prevent a full spin-off series from being made. In January 2020, Kurtzman said active discussions regarding a spin-off series had begun and he had been \"tossing ideas back and forth\" with Goldsman, who had moved from producing Discovery to co-showrunning Star Trek: Picard (2020–2023). Kurtzman said he would prefer for it to be an ongoing series rather than a miniseries, and said it could explore the seven years between Discovery second season and the accident that seriously injures Pike in The Original Series. Kurtzman soon said two unannounced Star Trek series were in development for CBS All Access.\n\nCBS All Access officially ordered Star Trek: Strange New Worlds to series in May 2020, with Mount, Romijn, and Peck confirmed to be reprising their roles. Kurtzman and Goldsman were confirmed to be executive producing alongside: their fellow Star Trek producer Jenny Lumet; Henry Alonso Myers; Heather Kadin and Aaron Baiers of Kurtzman's production company Secret Hideout; Frank Siracusa; John Weber; and Rod Roddenberry, the son of Star Trek creator Gene Roddenberry, and Trevor Roth of Roddenberry Entertainment. Akela Cooper and Davy Perez were set as co-executive producers. Goldsman wrote the script for the series' first episode based on a story he wrote with Kurtzman and Lumet, and was set as showrunner alongside Myers. Goldsman would also remain an executive producer and co-showrunner on Picard. Myers joked that \"The Cage\" (1965), the first pilot episode of The Original Series which stars the same main characters as Strange New Worlds, could be considered the pilot for the new series as well, making it \"the longest pilot-to-series pickup in the history of television\".\n\nIn September 2020, ViacomCBS announced that CBS All Access would be expanded and rebranded as Paramount+ in March 2021. A second season of Strange New Worlds was reported to be in development in November 2021, which Paramount+ officially announced in January 2022. Goldsman expressed his hope that the series would continue until its setting caught up with the events of The Original Series, stating: \"We will continue on for as long as Paramount lets us. We will drive right into The Original Series.\" Mount said he was willing to continue the series until fans felt Pike was on the same level as previous Star Trek captains James T. Kirk and Jean-Luc Picard. Paramount+ officially announced a third season in March 2023, and ordered a fourth season in April 2024 while the third was in production."
    },
    {
      "title": "Writing",
      "content": "Kurtzman felt audiences had primarily responded to the \"relentless optimism\" of Pike, Spock, and Number One on Discovery, and said Strange New Worlds would explore how Pike remains an optimistic leader despite learning about his tragic future during Discovery second season. Myers wanted to take advantage of his own experience in comedy to make the series lighter than the more dramatic Discovery and Picard, feeling that the purpose of the series was to carry on the optimistic messages of The Original Series. It was important to him to explore current social and political issues in the series, as all previous Star Trek projects had, and to ignore elements of characterization from The Original Series that were no longer appropriate, such as its portrayal of female characters, in favor of a more modern approach. Goldsman described the series' approach to depicting younger versions of characters from The Original Series as \"inductive storytelling\", explaining that the writers \"can see where somebody ended up and then try to imagine how they got there\".\n\nGoldsman said the series was more episodic than Discovery and Picard, a style closer to The Original Series, though it does take advantage of serialized storytelling to develop character arcs. Myers elaborated that the writers wanted to bring a \"modern character sensibility\" to \"Star Trek in the way Star Trek stories were always told. It's a ship and it's traveling to strange new worlds and we are going to tell big idea science fiction adventures in an episodic mode. So we have room to meet new aliens, see new ships, visit new cultures.\" Since the series has just 10 episodes a season, unlike the 20 episodes or more that past episodic Star Trek seasons had, the producers felt Strange New Worlds was not able to \"just [try] different things\" and instead wanted to show its full potential by giving each episode a dramatically different genre and tone. Goldsman said this was the only series he had worked on where he wished to have double the number of episodes, as the writers had to discard 10 good episode ideas for each 10 that were selected for a season.\n\nAfter working as a general science advisor on Discovery and the other Paramount+ Star Trek series, astrophysicist Erin Macdonald did the same for Strange New Worlds. She said each series was on a \"spectrum of science to fiction\" and her role on Strange New Worlds was mostly to help the writers remove the \"word salad\" from science explanations and tweak other dialogue to ensure the correct terms were being used."
    },
    {
      "title": "Casting",
      "content": "Anson Mount, Ethan Peck, and Rebecca Romijn star in the series, reprising their respective roles of Christopher Pike, Spock, and Una Chin-Riley / Number One from Star Trek: Discovery. Their characters were first introduced in \"The Cage\", which starred Jeffrey Hunter as Pike, Leonard Nimoy as Spock, and Majel Barrett as Number One. Babs Olusanmokun, Christina Chong, Celia Rose Gooding, Jess Bush, and Melissa Navia were announced as additional series regulars with the start of filming. Their roles were revealed in September 2021: Bush was cast in Barrett's other Original Series role of Christine Chapel, Gooding took over the role of Nyota Uhura from Nichelle Nichols, and Olusanmokun replaced Booker Bradshaw as Joseph M'Benga. Chong, Navia, and Bruce Horak were cast as new characters La'an Noonien-Singh, Erica Ortegas, and Hemmer. Horak was the first legally blind regular actor in a Star Trek series. After Hemmer's death in the first season, Horak returned as the character for a guest role in the second. James Doohan's Original Series character Montgomery Scott had an offscreen cameo appearance in the first-season finale, voiced by Matthew Wolf, before Martin Quinn was cast in the role for the second-season finale. Quinn was made a series regular for the third season."
    },
    {
      "title": "Design",
      "content": "Design work began by August 2020, with Jonathan Lee as production designer. Myers said they approached the series as if Star Trek creator Gene Roddenberry was making The Original Series with modern technology and effects, keeping elements of the 1960s designs that still worked for a contemporary project while avoiding the parts that looked \"cheap\". He compared this to the first Star Trek film, Star Trek: The Motion Picture (1979), which also used its budget and resources to expand on the original designs. Mount said the sets had a \"mid-century modern look from the 1960s. There are some pieces that you might find in a super upscale version of Macy's in 1967. It retains that cool '60s vibe, but in an updated way\". The Enterprise sets for Strange New Worlds were updated from the Discovery ones, such as the bridge set being more compact and closer to the size of the Original Series set. The sets were designed to function like a practical starship, including moving components and pre-programmed monitor graphics that reacted to the actors, and a practical viewscreen to replace the visual effects that Discovery used. Lee wanted the bridge to feel \"warmer\" than Discovery cool blue and green palette, especially using the colors of the on-set monitor graphics to achieve this. The engineering, mess hall, and cargo bay sets were augmented with virtual production technology. The props were also redesigned from the Discovery ones: phasers, tricorders, and communicators all feature \"retro\" looks closer to those from The Original Series.\n\nBernadette Croft was set as the costume designer for the series after working as an assistant on Discovery. The Starfleet uniforms were updated from the ones seen in Discovery, and Mount called them \"a world of difference from the Discovery uniforms. They're a lot more forgiving... more of a throwback.\" The uniforms retain the primary colors from the Original Series costumes: gold for command and control officers, blue for science officers, and red for communications, engineering, security, and tactical. Each division has an insignia that appears on their Starfleet badge, and these were added as a pattern on the shoulders and arms. The uniform is seen in both a standard tunic and a longer jacket that has a similar look to the miniskirt-style uniforms worn by actresses on The Original Series. Croft had wanted to avoid the \"over-sexualization\" of the miniskirt design, but Romijn encouraged her to make a more appropriate version because \"you can make it look badass, and you can fight, you can do whatever you need to do in a dress\". The series' version of the miniskirt is gender-neutral and actors decide whether they want to wear it or the tunic style. Dr. M'Benga's tunic is light blue and has a flap in the front to approximate the look of modern scrubs, while also taking inspiration from the costumes worn by DeForest Kelley's Dr. Leonard McCoy in The Original Series. Nurse Chapel wears a white jumpsuit that is similar to the medical uniforms worn in Discovery. Away team members wear a gray jacket over their uniforms which are an homage to the jackets worn in \"The Cage\". The jackets have a round patch on the shoulder that was inspired by a costume worn by William Shatner as James T. Kirk in the film Star Trek II: The Wrath of Khan (1982). The boots that the officers wear were created by shoe designer John Fluevog to be a more futuristic version of the \"Cuban-style boots\" from The Original Series. The leather boots have a metal Starfleet delta insignia on the ankle.\n\nLegacy Effects provided alien prosthetics for the series, and introduced new alien species in almost every episode. Per Goldsman's request, Legacy re-designed the prosthetics for Spock's ears and eyebrows to be closer to those used on Nimoy in \"The Cage\" than the ones from Discovery. Prosthetics department head Chris Bridges convinced Peck to shave his eyebrows, which Peck had chosen not to do on Discovery, to improve the process of applying the prosthetics and reduce the time it took from two hours to 70 minutes. The make-up and hair team worked on Spock's hairstyle and sideburns, creating a variation on Nimoy's look that suited Peck's face.\n\nIn the initial edit of the series' first episode, Goldsman added a temporary title sequence using the one from The Original Series, with the franchise's famous \"Space: the final frontier...\" monologue and images of the Enterprise in space. This inspired the actual title sequence which was designed by creative studio Picturemill. It begins with a \"start-up sequence\" where the Enterprise becomes illuminated and Mount gives the opening narration, followed by visuals of the Enterprise flying through interstellar locations and visiting the titular \"strange new worlds\". This was compared to the \"exploratory-style title sequence\" from Star Trek: Voyager (1995–2001)."
    },
    {
      "title": "Filming",
      "content": "The series is filmed at CBS Stages Canada in Mississauga, Ontario, under the working title Lily and Isaac. The directors were encouraged to bring a unique look and tone to each episode to highlight the series' episodic approach. Paramount+ constructed a video wall to allow for virtual production, based on the StageCraft technology used on the Disney+ series The Mandalorian (2019–2023). The new virtual set was built in Toronto by visual effects company Pixomondo, and features a 270-degree, 70 ft by 30 ft horseshoe-shaped LED volume with additional LED panels in the ceiling to aid with lighting. The technology uses the game engine software Unreal Engine to display computer-generated backgrounds on the LED screens in real-time during filming; additional filming to support these visual effects took place in New Mexico."
    },
    {
      "title": "Music",
      "content": "By December 2020, Discovery and Picard composer Jeff Russo had discussed Strange New Worlds with Kurtzman, including how it \"should be treated musically\", but whether Russo would be involved in the spin-off had yet to be determined. In February 2022, Russo was revealed to have written the series' main titles music while Nami Melumad was composing the rest of the score. Melumad previously composed the music for an episode of Short Treks and the animated series Star Trek: Prodigy (2021–present). Russo's main theme is a modern adaptation of Alexander Courage's original Star Trek theme, and includes a theremin to foreshadow Courage's vocal arrangement. Myers felt it was a \"perfect metaphor for what we are trying to do\" with the series, adapting elements from The Original Series \"in a bigger, more cinematic way\" than was possible in the 1960s. A soundtrack album for the first season was released digitally by Lakeshore Records on April 28, 2023. A soundtrack album for \"Subspace Rhapsody\", the second season's musical episode, was released on August 4, 2023."
    },
    {
      "title": "Release",
      "content": "Star Trek: Strange New Worlds premiered on the streaming service Paramount+ in the United States, Latin America, Australia, and the Nordics on May 5, 2022. It was released in Canada by Bell Media (broadcast on CTV Sci-Fi Channel before streaming on Crave), in New Zealand on TVNZ, in India on Voot, and in other countries as Paramount+ or SkyShowtime (a combination of Paramount+ and Peacock for some of Europe) became available there. In August 2023, Star Trek content was removed from Crave and Strange New Worlds began streaming on Paramount+ in Canada. The series continued to be broadcast on CTV Sci-Fi and be available on CTV.ca and the CTV app."
    },
    {
      "title": "Viewership",
      "content": "Parrot Analytics determines audience \"demand expressions\" based on various data sources, and the company calculated that Strange New Worlds was the fifth-most in demand US streaming series in May 2022, being 30.9 times more in demand than the average series. The only other Paramount+ series on the list for that month was the 9th-ranked second season of Picard. In August 2022, Paramount+ said Strange New Worlds was the most-watched original Star Trek series on the service over its first 90 days, and the second-most watched original series in general for the service in the United Kingdom."
    },
    {
      "title": "Critical response",
      "content": "Star Trek: Strange New Worlds has a 98% approval score on the review aggregator website Rotten Tomatoes, while Metacritic, which uses a weighted average, has assigned a score of 80 out of 100 based on reviews from 25 critics, indicating \"generally favorable\" reviews.\n\nFor the first season, Rotten Tomatoes reported that 99% of 84 critics reviews were positive and the average rating was 8.10 out of 10. The website's critics consensus reads, \"Strange New Worlds treks across familiar territory to refreshing effect, its episodic structure and soulful cast recapturing the sense of boundless discovery that defined the franchise's roots.\" Metacritic assigned a score of 76 out of 100 based on 14 reviews, indicating \"generally favorable\" reviews. Critics reviews for the season commonly praised the cast, particularly Mount, as well as the throwback production design and episodic format.\n\nThe second season was met with critical acclaim for its \"genre-bending\" episodes and for breathing new life into the franchise. Rotten Tomatoes reported that 97% of 98 critics reviews were positive and the average rating was 8.45 out of 10. The website's critics consensus reads, \"Boldly going where this hallowed franchise has gone before with effervescent execution, Strange New Worlds superb sophomore season continues to recapture classic Trek with modern verve.\" Metacritic assigned a score of 88 out of 100 based on 11 reviews, indicating \"universal acclaim\" according to the site."
    },
    {
      "title": "Accolades",
      "content": "The first season was nominated for a Primetime Creative Arts Emmy Award, two Critics' Choice Super Awards, and four Saturn Awards (winning one), among others. The second season was nominated for a Primetime Creative Arts Emmy Award, an American Society of Cinematographers Award, two Critics' Choice Television Awards and three Critics' Choice Super Awards, two Hugo Awards, six Saturn Awards (winning one),  and a Visual Effects Society Award, among others."
    },
    {
      "title": "Aftershow",
      "content": "As with previous Paramount+ Star Trek series, each episode of Strange New Worlds is followed by an episode of the official aftershow The Ready Room. Hosted by Star Trek: The Next Generation (1987–1994) actor Wil Wheaton, The Ready Room features interviews with cast and crew members as well as behind-the-scenes details from each episode."
    },
    {
      "title": "Publishing",
      "content": "The first tie-in novel for the series was announced in April 2022 as The High Country, from author John Jackson Miller. It was published by Simon & Schuster in February 2023 and tells an original story about Pike and the crew having to abandon ship during a mission. Miller, the author of many Star Trek tie-in novels, previously wrote The Enterprise War that explored Pike and the Enterprise before the second season of Discovery. Asylum, another tie-in novel for Strange New Worlds, was published in November 2024. Written by frequent Star Trek author Una McCormack, it depicts Pike's first meeting with Chin-Riley at Starfleet Academy and explores how her connections to a cultural minority group come back to haunt her during trade negotiations between the Enterprise and that group decades later after Strange New Worlds second season.\n\nThe Illyrian Enigma, the first comic book tie-in for the series, was announced in September 2022. Written by co-executive producer Kirsten Beyer and veteran Star Trek author Mike Johnson, the four-issue series features art by Megan Levens and Charlie Kirchoff. It is set between the first and second seasons, continuing from the first season's cliffhanger ending with the Enterprise crew attempting to prove Chin-Riley's innocence. A second tie-in comic, also written by Beyer and Johnson, debuted in August 2023. Titled Scorpius Run, it features art by Angel Hernandez and sees the Enterprise crew trapped in unexplored space and unable to contact Starfleet."
    },
    {
      "title": "Potential stage musical",
      "content": "When asked in July 2024 if the series would feature more musical episodes after the second-season episode \"Subspace Rhapsody\", Goldsman said the creative team were exploring a stage version of the episode."
    }
  ]
}