{
  "title": "Star Trek: Voyager",
  "parentTitle": "Star Trek",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Created By",
      "value": "Rick Berman\n\nMichael Piller\n\nJeri Taylor"
    },
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    },
    {
      "type": "number",
      "label": "No. of Seasons",
      "value": 7
    },
    {
      "type": "number",
      "label": "No. of Episodes",
      "value": 172
    }
  ],
  "content": "Star Trek: Voyager is an American science fiction series created by Rick Berman, Michael Piller and Jeri Taylor. It aired from January 16, 1995, to May 23, 2001, on UPN, with 172 episodes over seven seasons. The fifth series in the Star Trek franchise, it served as the fourth after Star Trek: The Original Series. Set in the 24th century, when Earth is part of a United Federation of Planets, it follows the adventures of the Starfleet vessel USS Voyager (Star Trek) as it attempts to return home to the Alpha Quadrant after being stranded in the Delta Quadrant on the far side of the galaxy.\n\nParamount Pictures commissioned the series after the cancellation of Star Trek: The Next Generation to accompany the ongoing Star Trek: Deep Space Nine. They wanted it to help launch UPN, their new network. Berman, Piller, and Taylor devised the series to chronologically overlap with Deep Space Nine and to maintain thematic continuity with elements that had been introduced in The Next Generation and Deep Space Nine. The complex relationship between Starfleet and ex-Federation colonists known as the Maquis was one such element and a persistent central theme. Voyager was the first Star Trek series to feature a female commanding officer, Captain Kathryn Janeway (Kate Mulgrew), as the lead character. Berman was head executive producer in charge of the overall production, assisted by a series of executive producers: Piller, Taylor, Brannon Braga, and Kenneth Biller.\n\nSet in a different part of the galaxy from preceding Star Trek shows, Voyager gave the series' writers space to introduce new alien species as recurring characters, namely the Kazon, Vidiians, Hirogen, and Species 8472. During the later seasons, the Borg—a species created for The Next Generation—were introduced as the main antagonists. During Voyager run, various episode novelizations and tie-in video games were produced; after it ended, various novels continued the series' narrative.",
  "sections": [
    {
      "title": "Development",
      "content": "As Star Trek: The Next Generation ended, Paramount Pictures wanted to continue to have a second Star Trek television series to accompany Star Trek: Deep Space Nine. The studio also planned to start a new television network, UPN, and wanted the new series to help it succeed.\n\nInitial work on Star Trek: Voyager began in 1993, when the seventh and final season of Star Trek: The Next Generation and the second season of Star Trek: Deep Space Nine were in production. Seeds for Voyager's backstory, including the development of the Maquis, were placed in several The Next Generation and Deep Space Nine episodes. Voyager was shot on the stages The Next Generation had used, and where the Voyager pilot \"Caretaker\" was shot in September 1994. Costume designer Robert Blackman decided that the uniforms of Voyager's crew would be the same as those on Deep Space Nine.\n\nStar Trek: Voyager was the first Star Trek series to use computer-generated imagery (CGI), rather than models, for exterior space shots. Babylon 5 and seaQuest DSV had previously used CGI to avoid the expense of models, but the Star Trek television department continued using models because they felt they were more realistic. Amblin Imaging won an Emmy for Voyager's opening CGI title visuals, but the weekly episode exteriors were captured with hand-built miniatures of Voyager, its shuttlecraft, and other ships. This changed when Voyager went fully CGI for certain types of shots midway through season three (late 1996). Foundation Imaging was the studio responsible for special effects during Babylon 5's first three seasons. Season three's \"The Swarm\" was the first episode to use Foundation's effects exclusively. Star Trek: Deep Space Nine began using Foundation Imaging in conjunction with Digital Muse in season six. In its later seasons, Voyager featured visual effects from Foundation Imaging and Digital Muse. The digital effects were produced at standard television resolution and some have speculated that it cannot be re-released in HD format without re-creating the special effects. However, Enterprise has been released in HD, but the special effects were rendered in 480p and upscaled."
    },
    {
      "title": "Casting",
      "content": "In the initial drafts, Captain Janeway was meant to have the name Elizabeth Janeway, and the actress Geneviève Bujold was cast for the role. Bujold had previous experience in films, but not in long TV series. Feeling uncomfortable with the demanding production, she left after only two days of filming the pilot. To keep production working and meet the deadlines the role was given to Kate Mulgrew, who had already been considered an option during the casting. Mulgrew also proposed to rename the character as Kathryn Janeway. Mulgrew, with more experience in episodic TV series, soon became a fan favorite. Robert Beltran knew nothing about the Star Trek franchise or the significance within it of the role he was auditioning for. He just got the \"Caretaker\" script from his agent, liked the story and the character, and successfully auditioned for it. He was aware, because of being familiar with the industry, that a pilot episode may eventually lead to an ongoing series. Robert Duncan McNeill had played the character of Nicholas Locarno in The Next Generation's The First Duty. Initially, Locarno would have returned in the Voyager series, but was later changed to a new character, Tom Paris. The casting notes mentioned that the producers wanted \"a Robert Duncan McNeill type\", which was noticed by McNeill's agent. He was eager to play the new character. He explained that \"I get a call. My agent says, 'Hey, remember that Star Trek episode you did a few years ago?' He goes, 'They’re making a new show called Voyager and they literally put out a casting notice saying 'a Robbie Duncan McNeill type.' They put my name. Kinda like the character on TNG. Like, my name was in [it]. And I’m like, 'I’m right here! That’s me!' And so [my agent says], 'I think you should… you can do this.'\"\n\nRobert Picardo auditioned for the role of Neelix, but his friend Ethan Phillips got it. Philips had already been cast in several minor roles in earlier Star Trek productions. Reflecting on that, Picardo said, \"And in that moment, I saved myself 6,000 hours of my life spent in a makeup chair.\" However, after failing in the audition he was suggested to try for the character of the Doctor, which he got. He was initially unsure of his way to manage the character because of his limited participation in the pilot, and feared that he would be compared unfavorably with Brent Spiner. Spiner played the fan-favorite Data in The Next Generation, another non-human being. \"I was afraid I would be compared to him endlessly and unfavorably because he was so lovable and kind of childlike in his role and I was kind of, you know, crusty and curmudgeonly, and ... pissed off. And not a very cuddly character\". He secured the job by improvising a line in the pilot. When he's left alone in sickbay and all scripted lines were said, he added \"I believe someone has failed to terminate my program\". He concluded saying \"I'm a doctor, not a nightlight\", imitating the catchphrase of Leonard McCoy (DeForest Kelley), the doctor of the original Star Trek series. The people laughed, and he was hired some hours later.\n\nThe series added a new main character during the mid-run, Seven of Nine, by Jeri Ryan. So far in the Star Trek franchise, this had only happened in Deep Space 9 with Worf, which was a preexisting character and not a new one. Rick Berman explained that \"I think after our first three years, the feeling was we wanted to add a bit of pizzazz to the show. We all agreed that we needed something to bring something fresh to the fourth season\". Berman was interested in the character of Data, a machine that wants to be human, but inverted the formula with a human that was turned into a machine and faces humanity as a new thing. For this purpose they used the Borg, villains from The Next Generation that had a positive reception. Ryan liked both the premise of the character and the optimist view of the future of the Star Trek franchise, which she preferred over the darker series she could audition for at the time, and got the job with little problem."
    },
    {
      "title": "Music",
      "content": "Unlike The Next Generation, where composer Jerry Goldsmith's theme from Star Trek: The Motion Picture was reused, Goldsmith composed and conducted an entirely new main theme for Voyager. As done with The Next Generation and Deep Space Nine, a soundtrack album of the series' pilot episode \"Caretaker\" and a CD single containing three variations of the main theme were released by Crescendo Records in 1995 between seasons one and two. In 1996, the theme was also released as a piano solo songbook.\n\nIn 2017, La-La Land Records issued Star Trek: Voyager Collection, Volume 1, a four-disc limited-edition release containing Goldsmith's theme music and tracks from Jay Chattaway's \"Rise\", \"Night\", the two-parter \"Equinox\", \"Pathfinder\", \"Spirit Folk\", \"The Haunting of Deck Twelve\", \"Shattered\", \"The Void\", and the two-parter \"Scorpion\"; Dennis McCarthy's \"The 37's\", the two-parter \"Basics\", \"The Q and the Gray\", \"Concerning Flight\", \"Tinker Tenor Doctor Spy\", and the two-parters \"Workforce\" and \"Year of Hell\"; David Bell's \"Dark Frontier\"; and Paul Baillargeon's \"Lifesigns\".\n\nIn 2020, Newsweek magazine said that the Voyager theme by Goldsmith was the best of all Star Trek television series' themes. The article elaborates, \"...Voyager recaptures some of the spacey ethereality of Courage's original vocal melody, while adding a deep space resonance that evoked the series' lost explorers, far from home among uncharted stars.\""
    },
    {
      "title": "Reunions",
      "content": "In August 2015, the main cast members (except Jennifer Lien, who had retired from acting in 2002) appeared together onstage in Las Vegas for the 20th anniversary of Star Trek: Voyager at the 2015 Las Vegas Star Trek convention.\n\nFollowing a path set by Leonard Nimoy, the first Star Trek actor to also direct in the franchise, Robert Duncan McNeill (Paris) and Roxann Dawson (Torres) went on to direct episodes of Star Trek: Enterprise, while Jonathan Frakes, LeVar Burton, and Andrew Robinson (Garak of Deep Space Nine) all directed episodes of Star Trek: Voyager.\n\nThe sets used for USS Voyager were reused for the Deep Space Nine episode \"Inter Arma Enim Silent Leges\" for her sister Intrepid-class ship USS Bellerophon (NCC-74705). The sickbay set of USS Voyager was also used as the Enterprise-E sickbay in the films Star Trek: First Contact and Star Trek: Insurrection. The Voyager ready room and the engineering set were also used as rooms aboard the Enterprise-E in Insurrection.\n\nProduction of episodes ran from June or July to March or April each year, with each episode typically taking about seven days to shoot. Shooting started at 7 a.m. each weekday and continued until finished for the day. The pilot episode \"Caretaker\" took 31 days to shoot and was one of the most expensive television pilots shot to that date."
    },
    {
      "title": "Plot",
      "content": "In the pilot episode, \"Caretaker\", USS Voyager (Star Trek), under the command of Captain Kathryn Janeway, departs the Deep Space Nine space station on a mission into the treacherous Badlands. They are searching for a missing ship piloted by a team of Maquis rebels, which Voyager's security officer, the Vulcan Lieutenant Tuvok, has secretly infiltrated. Tom Paris, a disgraced former Starfleet officer who joined the Maquis and was subsequently arrested, agrees to help find the Maquis ship in exchange for his freedom. While in the Badlands, Voyager is enveloped by a powerful energy wave that kills several of its crew, damages the ship, and strands it in the galaxy's Delta Quadrant, more than 70,000 light-years from Earth. The wave was used by an alien entity known as the Caretaker to pull first the Maquis ship, and then Voyager into the Delta Quadrant. The Caretaker is responsible for the continued care of the Ocampa, a race of aliens native to the Delta Quadrant, and has been abducting other species from around the galaxy in an effort to reproduce and have a successor.\n\nThe two crews join forces to retrieve crew members being withheld for this purpose and eventually agree to permanently join forces. After the Caretaker dies, Janeway decides to protect the Ocampa from eminent invasion by another local alien species, the Kazon, by destroying the Caretaker's transport array, also their means for returning home the way they came. To begin their now projected 75-year journey home, Chakotay, leader of the Maquis group, is made Voyager's first officer. B'Elanna Torres, a half-human/half-Klingon Maquis, becomes chief engineer, and Paris becomes Voyager's helm officer. Due to the deaths of the ship's entire medical staff, the Doctor, an emergency medical hologram designed only for short-term use, is employed as the ship's full-time chief medical officer. Delta Quadrant natives Neelix, a Talaxian scavenger, and Kes, a young Ocampa, are welcomed aboard. Neelix eventually becomes the ship's chef/morale officer and Kes becomes the Doctor's medical assistant.\n\nDue to its great distance from Federation space, the Delta Quadrant is unexplored by Starfleet. As they continue their long journey home, the crew passes through regions belonging to various species: the barbaric and belligerent Kazon; the organ-harvesting, disease-ravaged Vidiians; the nomadic hunter race the Hirogen; the fearsome Species 8472 from fluidic space; and most notably the Borg, who control large areas of space that Voyager has to move through in later seasons. They also encounter perilous natural phenomena, a nebulous area called the Nekrit Expanse (\"Fair Trade\", third season), a large area of empty space called The Void, toxic dumping grounds (\"Night\", fifth season), wormholes, dangerous nebulae and other anomalies.\n\nVoyager is the third Star Trek series to feature Q, an omnipotent alien—and the second on a recurring basis, as Q made only one appearance on Star Trek: Deep Space Nine. Starfleet Command learns of Voyager's survival when the crew discovers an ancient interstellar communications network, claimed by the Hirogen, into which they can tap. This relay network is later disabled, but due to the efforts of Earth-based Lieutenant Reginald Barclay, Starfleet eventually establishes regular contact in the season-six episode \"Pathfinder\", using a communications array and micro-wormhole technology.\n\nIn the first two episodes of the show's fourth season, Kes leaves the ship in the wake of an extreme transformation of her mental abilities, while Seven of Nine (known colloquially as Seven), a Borg drone who was assimilated as a six-year-old human girl, is liberated from the collective and joins the Voyager crew. As the series progresses, Seven begins to regain her humanity with the ongoing help of Captain Janeway, who shows her that emotions, friendship, love, and caring are more important than the sterile \"perfection\" the Borg espouse. The Doctor also becomes more human-like, due in part to a mobile holo-emitter the crew obtains in the third season which allows the Doctor to leave the confines of sickbay and even the ship itself. He discovers his love of music and art, which he demonstrates in the episode \"Virtuoso\". In the sixth season, the crew discovers a group of adolescent aliens assimilated by the Borg, but prematurely released from their maturation chambers due to a malfunction on their Borg cube. As he did with Seven of Nine, the Doctor rehumanizes the children; Azan, Rebi and Mezoti, three of them eventually find a new adoptive home while the fourth, Icheb, chooses to stay aboard Voyager.\n\nLife for the Voyager crew evolves during their long journey. Traitors Seska and Michael Jonas are uncovered in the early months (\"State of Flux\", \"Investigations\"); loyal crew members are lost late in the journey; and other wayward Starfleet officers are integrated into the crew. In the second season, the first child is born aboard the ship to Ensign Samantha Wildman; as she quickly grows up due to alien biology, Naomi Wildman becomes great friends with her godfather, Neelix, and develops an unexpected and close relationship with Seven of Nine. Early in the seventh season, Tom Paris and B'Elanna Torres marry after a long courtship, and Torres gives birth to their child, Miral Paris, in the series finale. Late in the seventh season, the crew finds a colony of Talaxians on a makeshift settlement in an asteroid field, and Neelix chooses to bid Voyager farewell and live once again among his people.\n\nOver the course of the series, the Voyager crew finds various ways to reduce their 75-year journey by up to five decades (barring any other delays they may encounter): shortcuts, in the episodes \"Year of Hell\", \"Night\" and \"Q2\"; technology boosts in \"The Voyager Conspiracy\", \"Dark Frontier\", \"Timeless\" and \"Hope and Fear\"; a subspace corridor in \"Dragon's Teeth\"; and a mind-powered push from a powerful former shipmate in \"The Gift\". Several other trip-shortening attempts are unsuccessful, as seen in the episodes \"Eye of the Needle\", \"Prime Factors\", \"Future's End\", and \"Inside Man\". After traveling for seven years, a current (yet returning) shipmate helps instigate a series of complex efforts which shortens the remainder of the journey to a few minutes in the series finale, \"Endgame\"."
    },
    {
      "title": "Cast",
      "content": "\n * Kate Mulgrew as Kathryn Janeway: Captain Janeway took command of the Intrepid-class USS Voyager in 2371. Her first mission is to locate and capture a Maquis vessel last seen in the area of space known as the Badlands. While there, the Maquis ship and Voyager are transported against their will into the Delta Quadrant, 70,000 light-years away, by a massive displacement wave. The Maquis ship is destroyed while fighting the Kazon-Ogla, and although Voyager survives, numerous casualties are suffered. To protect an intelligent species (the Ocampa), Janeway destroys a device, the Caretaker Array, which had the potential to return her crew to Federation space, stranding her ship and crew 75 years' travel from home. The reason is to stop the array from falling into the wrong hands and to protect the people the Caretaker was caring for.\n * Robert Beltran as Chakotay: A former Starfleet officer who joined the Maquis, while Starfleet is trying to capture him in the Badlands, his Maquis crew and he are pulled into the Delta Quadrant by the Caretaker's array and are forced to merge with the crew of Voyager during its journey home. Before serving as Voyager's first officer, he had resigned from Starfleet after years of service to join the Maquis to defend his home colony against the Cardassians.\n * Roxann Dawson as B'Elanna Torres: A former Starfleet cadet who joined the Maquis, B'Elanna Torres is the sometimes combative Klingon-human hybrid who serves as chief engineer on the Federation starship Voyager. B'Elanna is pulled into the Delta Quadrant on Chakotay's ship and is forced to merge with the crew of Voyager.\n * Jennifer Lien as Kes: Kes is a female Ocampan with psionic powers who joins USS Voyager after it is catapulted into the Delta Quadrant by the Caretaker's array. Kes is Neelix's partner, who had promised to save her from the Kazon who had captured her. Kes leaves the show in the episode \"The Gift\" and returns temporarily for the episode \"Fury\".\n * Robert Duncan McNeill as Tom Paris: Thomas Eugene Paris is a human Starfleet officer who serves for seven years as flight controller of the Federation starship Voyager. The son of a prominent Starfleet admiral, he was dishonorably discharged from Starfleet and later joined the Maquis before being captured and serving time at the Federation Penal Settlement in New Zealand. After joining Voyager to retrieve Chakotay's Maquis ship from the Badlands, he is transferred with the crew of Voyager 70,000 light-years across the galaxy, deep into the Delta Quadrant.\n * Ethan Phillips as Neelix: Neelix is a Talaxian who becomes a merchant, shortly after the Haakonians launch an attack on his homeworld, using a technology called a metreon cascade, resulting in the death of his entire family. He joins the Voyager, serving as a valuable source of information about the Delta Quadrant, as well as chef, morale officer, ambassador, navigator, and holder of many other odd jobs.\n * Robert Picardo as The Doctor: \"The Doctor\" is USS Voyagers emergency medical holographic program and chief medical officer during the ship's journey. The EMH mark 1 is a computer program with a holographic interface in the form of Lewis Zimmerman, the creator of the Doctor's program. Although his program is specifically designed to function in emergency situations only, Voyagers sudden relocation to the Delta Quadrant resulting in the death of the Chief Medical Officer along with all medical staff necessitated that the Doctor run his program on a full-time basis, becoming the ship's new Chief Medical Officer. He evolves full self-awareness and even has hobbies.\n * Tim Russ as Tuvok: Tuvok is a Vulcan Starfleet officer who serves aboard Voyager while it is stranded in the Delta Quadrant. In 2371, Tuvok was assigned to infiltrate the Maquis organization aboard Chakotay's Maquis vessel, and is pulled into the Delta Quadrant. He serves as tactical officer and second officer under Captain Kathryn Janeway during Voyager's seven-year journey through this unknown part of the galaxy. He is the only Voyager crew member to be promoted in the Delta Quadrant (lieutenant to lieutenant commander).\n * Garrett Wang as Harry Kim: Ensign Harry Kim is a human Starfleet officer. He serves as USS Voyager's operations officer. When Voyager is pulled into the Delta Quadrant, Harry is fresh out of the Academy and nervous about his assignment.\n * Jeri Ryan as Seven of Nine: Seven of Nine (full Borg designation: Seven of Nine, Tertiary Adjunct of Unimatrix 01) is a human female who is a former Borg drone. She was born Annika Hansen on stardate 25479 (2350), the daughter of eccentric exobiologists Magnus and Erin Hansen. She was assimilated by the Borg in 2356 at age six, along with her parents, and is liberated by the crew of USS Voyager at the start of season four."
    },
    {
      "title": "Novels",
      "content": "A total of 26 numbered books were released during the series' original run from 1995 to 2001. They include novelizations of the first episode, \"Caretaker\", \"The Escape\", \"Violations\", \"Ragnarok\", and novelizations of the episodes \"Flashback\", \"Day of Honor\", \"Equinox\" and \"Endgame\". Also, \"unnumbered books\", which are still part of the series, were released, though not part of the official release. These novels consist of episode novelizations except for Caretaker, Mosaic (a biography of Kathryn Janeway), Pathways (a novel in which the biography of various crew members, including all of the senior staff, is given); and The Nanotech War, a novel released in 2002, one year after the series' finale."
    },
    {
      "title": "Book relaunch",
      "content": "A series of novels focusing on the continuing adventures of Voyager following the television series finale was implemented in 2003, much as Pocket Books did with the Deep Space Nine relaunch novel series, which features stories placed after the finale of that show. In the relaunch, several characters are reassigned while others are promoted but stay aboard Voyager. These changes include Janeway's promotion to admiral, Chakotay becoming captain of Voyager and breaking up with Seven of Nine, Tuvok leaving the ship to serve as tactical officer under William Riker, and Tom Paris's promotion to first officer on the Voyager. The series also introduces several new characters.\n\nThe series began with Homecoming and The Farther Shore in 2003, a direct sequel to the series' finale, \"Endgame\". These were followed in 2004 by Spirit Walk: Old Wounds and Spirit Walk: Enemy of My Enemy. Under the direction of a new author, 2009 brought forth two more additions to the series: Full Circle and Unworthy. In 2011, another book by the same author called Children of the Storm was released. Other novels—some set during the relaunch period, others during the show's broadcast run—have been published."
    },
    {
      "title": "Video games",
      "content": "Three video games based specifically on Voyager were released: Star Trek: Voyager – Elite Force for PC (2000) and PS2 (2001), the arcade game Star Trek: Voyager – The Arcade Game (2002) and Star Trek: Elite Force II (2003), a sequel to Elite Force. The PS2 game Star Trek: Encounters (2006) also features the ship and characters from the show. Voyager was a graphic adventure video game developed by Looking Glass Technologies but it was cancelled in 1997.\n\nStar Trek: Voyager – Elite Force drew revenues of $15 million and sold roughly 300,000 units worldwide by 2003."
    },
    {
      "title": "Broadcast history",
      "content": "Star Trek: Voyager launched on UPN with repeats entering into syndication. The two hour long debut \"Caretaker\" was seen by 21.3 million people in January 1995. The series is available, Sunday through Friday evenings, on the broadcast network Heroes and Icons. It is also available for streaming in the United States on Paramount+ and Amazon Prime Video.\n\nPluto TV also has three Star Trek channels which air the various series. The 'Star Trek' channel airs The Original Series and The Next Generation and has also aired Lower Decks, Picard and various specials and documentaries. The 'Star Trek: Voyager' channel airs Voyager. The ‘Star Trek: Deep Space Nine’ channel airs Deep Space Nine. Most of the time the series which is currently airing is played in order, from start to finish."
    },
    {
      "title": "Critical response",
      "content": "In 2016, in a listing that included each Star Trek film and TV series separately, Voyager was ranked 6th by the L.A. Times. In 2017, Vulture ranked Star Trek: Voyager the 4th best live-action Star Trek television show, prior to Star Trek: Discovery. In 2019, Nerdist ranked this show the 5th best Star Trek series, in between Enterprise and Star Trek: Discovery. Also in 2019, MovieFone ranked it the fifth best live-action Star Trek series.\n\nIn 2019, CBR ranked Season 5 the 4th best season of a Star Trek show, and Season 4, the 8th best. In 2019, Popular Mechanics ranked Star Trek: Voyager the 36th best science fiction television show ever. Review aggregator Rotten Tomatoes gives the show a rating of 76% overall of the seven seasons based on 56 reviews. Metacritic gives Star Trek: Voyager a score of 66 out of 100, based on 10 critics, indicating \"generally favorable reviews\". In 2021, Variety ranked it the fourth best installment of Star Trek, counting series and movies together, placing it ahead of all television series to-date except the original."
    },
    {
      "title": "Gender balance and cultural influence",
      "content": "Voyager was notable for being the most gender-balanced Star Trek series with the first female lead character and strong female supporting characters, with a review of the different series giving Voyager the highest Bechdel test rating. Critical and scholarly accounts noted the prevalence of women in leadership roles and with scientific expertise, but also the series' adherence to the gender binary and heterosexual norms.\n\nIn an article about Voyager, Ian Grey wrote: \"It was a rare heavy-hardware science fiction fantasy not built around a strong man, and more audaciously, it didn't seem to trouble itself over how fans would receive this. On Voyager, female authority was assumed and unquestioned; women conveyed sexual power without shame and anger without guilt. Even more so than Buffy, which debuted two years later, it was the most feminist show in American TV history.\"\n\nAbout her years on Voyager, Kate Mulgrew said: \"The best thing was simply the privilege and the challenge of being able to take a shot at the first female captain, transcending stereotypes that I was very familiar with. I was able to do that in front of millions of viewers. That was a remarkable experience—and it continues to resonate.\"\n\nIn 2015, astronaut Samantha Cristoforetti tweeted a Janeway quote from the episode \"The Cloud\", \"There's coffee in that nebula\", from the International Space Station. The station was getting a shipment of supplies which triggered a chance to say how coffee really was in the incoming spacecraft (a Dragon cargo spacecraft). The spacecraft was carrying the ISSpresso machine which would allow coffee beverages to be made aboard the actual Space Station. The popular tweet was accompanied by her wearing a Star Trek uniform also."
    },
    {
      "title": "Home media",
      "content": "The series was released on DVD in 2004 and again in 2017. In addition to the episodes, the DVDs also include some extra videos related to the show. There was an extra bonus video with the DVD set from the store Best Buy in 2004. Voyager had releases of episodes on VHS format, such as a collectors set with a special display box for the tapes.\n\nBy the 2010s, the episodes were made available on various streaming services including the owners CBS All Access. In 2016 Netflix made an agreement with CBS for worldwide distribution of all then existing 727 Star Trek episodes (including Voyager). Voyager has 172 episodes and has been reviewed as a binge watch, with the whole series taking about three months, as rate of two episodes per day on weekdays and three episodes per day on weekends.As of 2015 services known to carry the series include Netflix, Amazon Prime, Google Play, iTunes, and CBS.com.\n\nStar Trek: Voyager has not been remastered in high definition and there are no plans to do so, due to the costs of reassembling each episode from the film negatives and recreating visual effects."
    },
    {
      "title": "Awards and nominations",
      "content": "Voyager won 20 different awards and was nominated for 70.\n\nIn 1995 for example, Jerry Goldsmith won an Emmy award for Outstanding Individual Achievement in Main Title Theme Music and the series also won an Emmy for Outstanding Individual Achievement in Special Visual Effects.\n\nThe following episodes won Emmy awards, \"Caretaker\", \"Threshold\", \"Fair Trade\", \"Dark Frontier\", and \"Endgame\"."
    },
    {
      "title": "Cast reunion",
      "content": "In the midst of the COVID-19 pandemic in May 2020, the cast of Voyager reunited for a live virtual event. The reunion broke the Stars in the House single-episode fundraising record, drawing donations totaling $19,225 for The Actors Fund's efforts to assist entertainment professionals in need during the COVID-19 pandemic. The previous Stars in the House record was set by a Glee reunion episode that raised $13,910."
    },
    {
      "title": "Documentary",
      "content": "In 2021, plans for a Star Trek: Voyager documentary made news when it raised over $638,000 in the first two weeks of its Indiegogo crowdfunding campaign. The film is being produced by 455 Films which also produced the 2018 reunion documentary What We Left Behind about Star Trek: Deep Space Nine, as well as other documentaries. Production of the film started in 2020 and included cast member interviews prior to kicking off crowdfunding to take the film to full production. By the end of March 2021 they had raised over $1.2 million from over 11 thousand donators to make it the most funded crowdfunded documentary ever, and announced the name To The Journey: Looking Back At Star Trek: Voyager for the documentary, which will include HD remastered footage (pending approval from ViacomCBS). The fundraising campaign was noted for getting support from Nana Visitor, Kate Mulgrew, William Shatner, Jonathan Frakes, and others."
    }
  ]
}