{
  "title": "Star Wars: Episode II – Attack of the Clones",
  "parentTitle": "Star Wars",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    }
  ],
  "content": "Star Wars: Episode II – Attack of the Clones is a 2002 American epic space opera film directed by George Lucas and written by Lucas and Jonathan Hales. The sequel to The Phantom Menace (1999), it is the fifth entry in the Star Wars film series and second chronological chapter of the \"Skywalker Saga\". The film stars Ewan McGregor, Natalie Portman, Hayden Christensen, Ian McDiarmid, Samuel L. Jackson, Christopher Lee, Anthony Daniels, Kenny Baker, and Frank Oz.\n\nThe story is set ten years after The Phantom Menace, as thousands of planetary systems slowly secede from the Galactic Republic and join the newly formed Confederacy of Independent Systems, led by former Jedi Master Count Dooku. With the galaxy on the brink of civil war, Obi-Wan Kenobi investigates a mysterious assassination attempt on Senator Padmé Amidala, which leads him to uncover a clone army in service of the Republic and the truth behind the Separatist movement. Meanwhile, his apprentice Anakin Skywalker is assigned to protect Amidala and develops a secret romance with her. Soon, the trio witness the onset of a new threat to the galaxy: the Clone Wars.\n\nDevelopment of Attack of the Clones began in March 2000, some months after the release of The Phantom Menace. By June 2000, Lucas and Hales completed a draft of the script, and principal photography took place from June to September 2000. The film crew primarily shot at Fox Studios Australia in Sydney, with additional footage filmed in Tunisia, Italy and Spain. It was one of the first motion pictures shot completely on a high-definition digital 24-frame system.\n\nAttack of the Clones was released in the United States on May 16, 2002. It received mixed reviews from critics; the film's increased focus on action was praised, while the characters and dialogue were regarded more critically. It performed well at the box office, making $653.8 million worldwide. Yet, it became the first Star Wars film to get outgrossed in its year of release, becoming the fourth-highest-grossing film of 2002 worldwide. Revenge of the Sith (2005) followed Attack of the Clones, concluding the Star Wars prequel trilogy.",
  "sections": [
    {
      "title": "Plot",
      "content": "Ten years after the Battle of Naboo, the Galactic Republic is threatened by a Separatist movement organized by former Jedi Master Count Dooku. Former Queen turned Senator Padmé Amidala travels to Coruscant to vote against a motion to create an army to assist the Jedi against the growing menace. After narrowly avoiding an assassination attempt from Zam Wessell upon arrival, she is placed under the protection of Jedi Master Obi-Wan Kenobi and his Padawan apprentice Anakin Skywalker. Zam attempts to assassinate Padmé again, but is thwarted and subdued by the Jedi pair. Zam's employer, a jetpack-wearing bounty hunter, kills her before she reveals his identity. The Jedi Council instructs Obi-Wan to find the bounty hunter, while Anakin is tasked to protect Padmé and escort her to Naboo. Despite the Jedi Code forbidding attachments, the two fall in love.\n\nObi-Wan's search leads to Kamino, an ocean planet. There, he discovers a clone army is being produced for the Republic in the name of Sifo-Dyas, a deceased Jedi Master. The bounty hunter Jango Fett serves as their genetic template. Obi-Wan deduces Jango is the bounty hunter he is seeking and places a homing beacon on Jango's ship. He then follows Jango and his clone son Boba to the planet Geonosis. Meanwhile, Anakin is troubled by visions of his mother Shmi in pain, and returns to his homeworld of Tatooine with Padmé to save her. His former owner Watto reveals that he sold Shmi to a moisture farmer named Cliegg Lars, who then freed and married her. Cliegg says Tusken Raiders abducted Shmi one month earlier, and she is likely dead. Anakin finds her at the Tusken campsite, barely alive. After she dies in his arms, an enraged Anakin massacres the entire tribe. He later confesses his actions to Padmé and vows to prevent the deaths of those he loves.\n\nOn Geonosis, Obi-Wan discovers a Separatist gathering led by Count Dooku, who is developing a droid army with Trade Federation Viceroy Nute Gunray, who ordered the assassination attempts on Padmé. Obi-Wan reports to the Jedi Council but is captured by Separatist droids. Dooku meets Obi-Wan in his cell and reveals that the Republic is under the control of the Sith Lord Darth Sidious. He invites Obi-Wan to help him stop Sidious, but Obi-Wan refuses. Senate Representative Jar Jar Binks proposes a successful vote to grant emergency powers to Chancellor Palpatine, allowing the clone army to be officially mobilized as the military of the Republic.\n\nAnakin and Padmé head to Geonosis to rescue Obi-Wan, but Jango captures them. Dooku sentences the trio to be killed by alien beasts in the arena. A battalion of clone troopers led by Yoda, Mace Windu, and other Jedi suddenly arrive; Windu beheads Jango during the ensuing battle. Obi-Wan and Anakin intercept Dooku and engage in a lightsaber duel. Dooku injures Obi-Wan and severs Anakin's right arm; Yoda intervenes and defends them. To distract Yoda, Dooku uses the Force in an attempt to kill Anakin and Obi-Wan. Dooku escapes via his Solar Sailer to Coruscant and delivers the schematics for a superweapon to Sidious.\n\nAs the Jedi acknowledge the beginning of the Clone Wars, Anakin is fitted with a cybernetic arm and secretly marries Padmé on Naboo with R2-D2 and C-3PO as their only witnesses."
    },
    {
      "title": "Cast",
      "content": "Pernilla August, Ahmed Best, Oliver Ford Davies, and Andy Secombe reprise their roles from The Phantom Menace as Shmi Skywalker, Jar Jar Binks, Sio Bibble, and Watto, respectively. Silas Carson also reprises his role from that film as both Nute Gunray, the Viceroy of the Trade Federation; and Ki-Adi-Mundi, a Cerean Jedi Master sitting on the Jedi Council. Jimmy Smits portrays Bail Organa, a senator from Alderaan. Daniel Logan portrays a young Boba Fett, Jango Fett's clone and adopted son.\n * Ewan McGregor as Obi-Wan Kenobi, a Jedi Knight and mentor to his Padawan learner, Anakin Skywalker, who investigates the assassination attempt upon Padmé, leading him to discover the production of a Clone trooper for the Galactic Republic. In the 10 years since The Phantom Menace, he has grown wiser and more powerful in the use of the Force.\n * Natalie Portman as Padmé Amidala, the former Queen of Naboo, who has recently been elected the planet's Senator, and Anakin's love interest.\n * Hayden Christensen as Anakin Skywalker, a 19-year-old former slave from Tatooine and Obi-Wan's gifted Padawan apprentice who is assigned to protect Padmé with whom he falls in love. He is believed to be the \"chosen one\" of Jedi prophecy destined \"to bring balance to The Force.\" In the 10 years since The Phantom Menace, he has grown powerful but arrogant, and believes that Obi-Wan is holding him back. A large search for an actor to portray Anakin Skywalker was performed. Lucas auditioned various actors, mostly unknown, before casting Christensen. Among the many established actors who auditioned or considered were Jonathan Brandis, Chris Klein, Devon Sawa, Charlie Hunnam, Topher Grace, Nick Swardson, Rob McElhenney, Eric Christian Olsen, Joshua Jackson, Erik von Detten, James Van Der Beek, Ryan Phillippe, Colin Hanks, and Paul Walker. Leonardo DiCaprio also met with Lucas for the role, but he declined as he felt he \"wasn't ready to take that dive\".  Christensen initially thought the role was go to another actor as heard numerous of actors being considered. Co-star Natalie Portman later told Time magazine that Christensen \"gave a great reading. He could simultaneously be scary and really young.\"\n * Ian McDiarmid as Palpatine / Darth Sidious, a former senator from Naboo, as well as a secret Sith Lord, who amasses vast emergency powers as the Supreme Chancellor of the Galactic Republic upon the outbreak of the Clone Wars.\n * Samuel L. Jackson as Mace Windu, a Jedi Master sitting on the Jedi Council who warily watches the Galactic Senate's politics.\n * Anthony Daniels as C-3PO, a protocol droid built by Anakin as a child who now serves the Lars family on Tatooine.\n * Kenny Baker as R2-D2, Anakin's astromech droid who often accompanies him and Obi-Wan on missions.\n * Frank Oz as Yoda, the centuries-old Jedi Grandmaster of an unknown alien species. In addition to leading the Jedi Council, Yoda is the instructor for the young Jedi Padawans/\"Younglings\".\n * Temuera Morrison as Jango Fett, a bounty hunter who gave his DNA for use by the cloning facilities on Kamino for the creation of the clone army.\n * Christopher Lee as Count Dooku / Darth Tyranus, a former Jedi Master and the old mentor of Obi-Wan's late master Qui-Gon Jinn, who is now the puppet leader of the Separatist movement as well as Darth Sidious' new Sith apprentice and a suspect in Obi-Wan's investigation.\n\nJack Thompson, Joel Edgerton and Bonnie Piesse appear as members of the Lars family and homestead; respectively as Cliegg Lars, Shmi's husband, Owen's father and Anakin's stepfather; Owen Lars, Cliegg's son, Shmi's stepson, and Anakin's stepbrother; and Beru Whitesun, Owen's girlfriend. Leeanna Walsman appears as Zam Wesell, a shapeshifting Clawdite bounty hunter and partner of Jango Fett, who was given the task of assassinating Padmé. Jay Laga'aia appears as Gregar Typho, Padmé's newly appointed captain of security. Rose Byrne and Alethea McGrath briefly appear as Dormé, Padmé's handmaiden and as Jocasta Nu, the librarian at the Jedi Temple, respectively. Ronald Falk provides the voice of Dexter Jettster, Obi-Wan's Besalisk friend who runs a diner on Coruscant and informs him about Kamino. Daniels and Best also make cameo appearances as Dannl Faytonni and Achk Med-Beq, respectively, attendees of the Coruscant Outlander Club who witness Anakin and Obi-Wan capturing Zam Wesell. E! reported that Lucas had asked NSYNC to film a small background cameo appearance, in order to satisfy his daughters. They were subsequently cut out of the film in post-production, although briefly visible during a crowd shot from above. David Duchovny turned down an undisclosed role in Attack of the Clones so that he could star in Evolution (2001). The end credits erroneously list Alan Ruscoe as playing Neimoidian senator Lott Dod. The character was actually another Neimoidian, played by an uncredited David Healy and voiced by Christopher Truswell. Archival recordings of Liam Neeson as Qui-Gon Jinn from The Phantom Menace, appear as a disembodied ghostly voice heard by Anakin through the Force as he was slaughtering the Tusken Raiders; Qui-Gon also appears earlier in the film in the form of a statue in his likeness during a background scene when Obi-Wan visits the Jedi Archives. Fiona Johnson reprised her The Matrix (1999) role as the Woman in the Red Dress in an Easter egg cameo appearance, with her character named \"Hayde Gofai\" in later Star Wars media, briefly offering a seductive look to Anakin Skywalker at the Outlander Club."
    },
    {
      "title": "Writing",
      "content": "After the mixed critical response to The Phantom Menace, George Lucas was hesitant to return to the writing desk. In March 2000, just three months before the start of principal photography, Lucas finally completed his rough draft for Episode II. Lucas continued to iterate on his rough draft, producing a proper first and second draft. For help with the third draft, which would later become the shooting script, Lucas brought on Jonathan Hales, who had written several episodes of The Young Indiana Jones Chronicles for him, but had limited experience writing theatrical films. The final script was completed just three days before the start of principal photography.\n\nAs an in-joke, the film's working title was Jar Jar's Great Adventure, a sarcastic reference to the negative fan response to the Episode I character.\n\nIn writing The Empire Strikes Back, Lucas initially decided that Lando Calrissian was a clone and came from a planet of clones which caused the \"Clone Wars\" mentioned by Obi-Wan Kenobi in A New Hope; he later came up with an alternate concept of an army of clone shocktroopers from a remote planet which were used by the Republic as an army in the war that followed."
    },
    {
      "title": "Filming",
      "content": "Principal photography occurred between June 26, 2000, and September 20, 2000, at Fox Studios Australia in Sydney. Location shooting took place in the Tunisian desert, at the Plaza de España in Seville, London, China, Vancouver, San Diego, and Italy (Villa del Balbianello on Lake Como, and in the former royal Palace of Caserta). Reshoots were performed in March 2001. During this time, a new action sequence was developed featuring the droid factory after Lucas had decided that the film lacked a quick enough pace in the corresponding time-frame. The sequence's previsualization was rushed, and the live-action footage was shot within four and a half hours.\n\nBecause of Lucas' method of creating shots through various departments and sources that are sometimes miles and years apart from each other, Attack of the Clones became the first film ever to be produced through what Rick McCallum called \"virtual filmmaking\". Back at Fox Studios, the stages from McGregor's other film Moulin Rouge! were reused during filming. While filming his scenes, Christensen would sometimes make lightsaber noises from his mouth, which caused Lucas to stop filming and tell Christensen \"Hayden, that looks really great, but I can see your mouth moving. You don't have to do that, we add the sound effects in afterward.\" At his own personal request, Samuel L. Jackson's character Mace Windu received a lightsaber that emits a purple glow, as opposed to traditional blue or green for \"good guys\" and red for \"bad guys\".\n\nLike The Phantom Menace, Attack of the Clones furthered technological development, effectively moving Hollywood into the \"digital age\" with the use of the HDW-F900, developed by Sony and Panavision, a digital camera using an HD digital 24-frame system. This spawned controversy over the benefits and disadvantages of digital cinematography that continues as more filmmakers \"convert\" to digital filmmaking while many filmmakers oppose it. In contrast to previous installments, for which scenes were shot in the Tunisian desert in temperatures up to 125 °F (51 °C), the camera would still run without complications. Lucas had stated that he wished to film The Phantom Menace on this format but Sony was unable to build the cameras quickly enough. Sony's cameras arrived one week before principal photography on Attack of the Clones was about to start. In 2002, Attack of the Clones became the third film to be released that was shot entirely on a 24p digital camera (preceded by 2001's Jackpot and Vidocq). The cameras record in the 16:9 HDCAM format (1080p), although the image was cropped to a 2.40:1 widescreen ratio. The area above and below the 2.40 extraction area was available for Lucas to reframe the picture as necessary in post-production. Despite Lucas' efforts to persuade movie theaters to switch to digital projectors for viewing of Episode II, few theaters did."
    },
    {
      "title": "Visual effects",
      "content": "There were over 2,000 visual effects shots in the film. The film relied almost solely on digital animatics as opposed to storyboards in order to previsualize sequences for editing early on in the film's production. While Lucas had used other ways of producing motion-based storyboards in the past, after The Phantom Menace the decision was made to take advantage of the growing digital technology. The process began with Ben Burtt's creation of what the department dubbed as \"videomatics\", so called because they were shot on a household videocamera. In these videomatics, production assistants and relatives of the department workers acted out scenes in front of greenscreen. Using computer-generated imagery (CGI), the previsualization department later filled in the green screen with rough background footage. Burtt then cut together this footage and sent it off to Lucas for changes and approval. The result was a rough example of what the final product was intended to be. The previsualization department then created a finer version of the videomatic by creating an animatic, in which the videomatic actors, props, and sets were replaced by digital counterparts to give a more precise, but still rough, look at what would eventually be seen. The animatic was later brought on set and shown to the actors so that they could understand the concept of the scene they were filming in the midst of the large amount of bluescreen used. Unlike most of the action sequences, the Battle of Geonosis was not story-boarded or created through videomatics but was sent straight to animatics after the department received a small vague page on the sequence. The intent was to create a number of small events that would be edited together for pacing inside the finished film. The animatics department was given a free hand regarding events to be created within the animatic; Lucas only asked for good action shots that he could choose from and approve later. Jackson would fight invisible creatures while filming his scenes.\n\nIn addition to introducing the digital camera, Attack of the Clones emphasized \"digital doubles\" as computer-generated models that doubled for actors, in the same way that traditional stunt doubles did. It also furthered the authenticity of computer-generated characters by introducing a new, completely CGI-created version of the character Yoda. Rob Coleman and John Knoll prepared two tests featuring a CGI-animated Yoda using audio from The Empire Strikes Back. Yoda's appearance in Episode V also served as the reference point for the creation of the CGI Yoda; Lucas repeatedly stated to the animation department that \"the trick\" to the animation of the CGI Yoda was to make him like the puppet from which he was based, in order to maintain a flow of continuity. Frank Oz (voice and puppeteer for Yoda in the original trilogy and The Phantom Menace) was consulted; his main piece of advice was that Yoda should look extremely old, sore, and frigid. Although, Lucas admitted that he was \"scared to death\" about how they would pull off the scene. Coleman later explained the process of making the digital Yoda like the puppet version, by saying \"When Frank [Oz] would move the head, the ears would jiggle. If we hadn't put that in, it wouldn't look like Yoda.\" Because of the acrobatics of the lightsaber fight between Count Dooku and Yoda, the then 78-year-old Christopher Lee relied on a stunt double to perform the most demanding scenes instead. Lee's face was superimposed onto the double's body in all shots other than close-ups, which he performed himself. Lucas often called the duel crucial to the animation department, as it had the potential to be humorous rather than dramatic.\n\nLucas did not use VistaVision for the miniature effects as he wanted the film to be \"consistently digital\". Carl Miller shot test footage of models using digital cameras, but the models did not look realistic enough. More detailed models had to be made as the digital cameras lacked the film grain that would have added detail and realism. The amphitheater on Geonosis was initially a miniature made out of foam blocks, but the cameras were able to show flaws in it."
    },
    {
      "title": "Music",
      "content": "The soundtrack to the film was released on April 23, 2002, by Sony Classical Records. The music was composed and conducted by John Williams, and performed by the London Voices and London Symphony Orchestra. The soundtrack recreates \"The Imperial March\" from the film The Empire Strikes Back for its first chronological appearance in Attack of the Clones, even though a hint of it appeared in the previous movie in one of the final scenes. A music video for the main theme \"Across the Stars\" was produced specifically for the DVD.\n\nOn March 15, 2016, a limited edition vinyl version of the soundtrack was released. Only 1,000 copies were pressed initially."
    },
    {
      "title": "Themes",
      "content": "Lucas has noted that Palpatine's rise to power is very similar to that of Adolf Hitler in Nazi Germany; as Chancellor of Germany, the latter was granted emergency powers, as is Palpatine. Comparisons have been made to Octavian—who became Augustus, the first emperor of Rome—and to Napoleon Bonaparte, who rose to power in France from 1796 to 1799. Octavian was responsible for the deaths of hundreds of political opponents well before he was granted tribunician powers; Bonaparte was appointed First Consul for life (and later Emperor) by the French Consulate after a failed attempt on his life and the subsequent coup of 18 Brumaire in 1799. References to the American Civil War can also be discerned. War journalism, combat films, and footage of World War II combat influenced the documentary-style camera work of the Battle of Geonosis, even to the point that hand-held shakes were digitally added to computer-generated sequences.\n\nEnglish scholar Anne Lancashire describes Attack of the Clones as \"thoroughly political in its narrative\", to the point that interpersonal relations are made subordinate to the political drama that unfolds, and \"a critique of the increasing role played by economic and political appetite in contemporary First World international politics in general\". In this political drama, the Trade Federation, the former idealist Dooku, and Palpatine \"[represent] the economic and political greed and ambition ... of the political and business classes\", while the intuition of the Jedi has been clouded by the dark side of the Force. The cityscape of Coruscant, the location of the Jedi Temple, is a dystopian environment that refers to 1982's Blade Runner. Nevertheless, the Jedi endure as the heroes; Obi-Wan's role has been noted as similar to that of James Bond, and Zam Wesell's attempt on Padmé's life is similar to a scene in the first 007 film, Dr. No. Furthermore, the Geonosis arena fight scene is a reference to the 2000 Ridley Scott film, Gladiator.\n\nThe prequel trilogy films often refer to the original trilogy in order to help connect the films together. Lucas has often referred to the films as a long poem that rhymes. Such examples include the line \"I have a bad feeling about this\", a phrase used in each film, and lightsaber duels which almost always occur over a pit. As with Attack of the Clones, The Empire Strikes Back was the middle film in a trilogy, and of the original trilogy films, The Empire Strikes Back is the object of the most references in Attack of the Clones. In both films, an asteroid field is the backdrop of a major star battle in the middle of the film. Obi-Wan escapes Jango Fett by attaching his spacecraft to an asteroid in order to disappear from the enemy sensors; Han Solo uses a similar tactic by attaching the Millennium Falcon to a Star Destroyer in The Empire Strikes Back. John Knoll confirms on the film's DVD commentary that Boba Fett, who would later catch Solo in the act in The Empire Strikes Back, \"learned his lesson\" from the events of Attack of the Clones. The Galactic Republic's clone troopers also establish the origin of the stormtroopers that play an important role in the original trilogy. The titles of both films refer to the response of the primary galactic government to a threat of rebellion."
    },
    {
      "title": "Marketing",
      "content": "In November 2001, three teaser trailers for Attack of the Clones were released, which were shown on the Internet, as well as the DVD-ROM selection of The Phantom Menace DVD release. The first one was released on November 2 with the Disney/Pixar film Monsters, Inc. in theaters. A second teaser debuted online three days later on November 5. This was followed by a third teaser trailer, which was released globally on November 16 with the wide release of Harry Potter and the Sorcerer's Stone. Just like its predecessor, fans paid full admission at theaters to see the trailers. The next full trailer premiered on Fox Network on March 10, 2002, between airings of Malcolm in the Middle and The X-Files. It made its theatrical debut five days later on March 15 with the opening of Ice Age. The trailer was made available on the official Star Wars website the same day. The outplacement firm Challenger, Gray & Christmas from Chicago predicted before the film's release that U.S. companies could lose more than $319 million in productivity due to employees calling in sick and then heading to theaters to see the film.\n\nAttack of the Clones had fewer promotional partners compared to its predecessor, which included General Mills and Frito-Lay."
    },
    {
      "title": "Theatrical",
      "content": "The film premiered as part of the inaugural Tribeca Film Festival at the BMCC Performing Arts Center, 199 Chambers St. in New York City at a Sunday, May 12 set of screenings benefitting the Children's Aid Society, a charity supported by George Lucas. This charity would go on to help raise money for kids of the victims of the September 11 attacks. Attack of the Clones was then screened out of competition at the 2002 Cannes Film Festival, before getting a worldwide theatrical release on May 16, 2002. The film was also later released in IMAX theaters; the film had not been filmed for IMAX but was \"up converted\" with the digital remastering process. Because of the technical limitations of the IMAX projector at the time, an edited, 120-minute version of the film was presented.\n\nBefore the film's release, there was a string of controversies regarding copyright infringement. In 2000, an underground organization calling itself the Atlas Group, based in Perth, Western Australia offered a copy of the screenplay, with an asking price of US$100,000, to various fan sites and media organizations, including TheForce.Net. The scheme was subsequently reported to Lucasfilm Ltd. by the fan site.\n\nAn unauthorized copy was allegedly made at a private showing, using a digital recorder that was pointed at the screen. This copy spread over the internet, and analysts predicted up to a million fans would have seen the film before the day of its release. In addition, authorities seized thousands of bootlegs throughout Kuala Lumpur before the film opened."
    },
    {
      "title": "Home media",
      "content": "Attack of the Clones was released on DVD and VHS on November 12, 2002 by 20th Century Fox Home Entertainment. On the first day of release, over 4 million DVD copies were sold, becoming the third-highest single-day DVD sales of any film, behind Monsters, Inc. and Spider-Man. This THX certified two-disc DVD release consists of widescreen and pan and scan fullscreen versions. The set contains one disc with the film and the other one with bonus features. The first disc features three randomized selected menus, which are Coruscant, Kamino and Geonosis. There is an Easter egg located in the options menu. When the THX Optimizer is highlighted, the viewer can press 1-1-3-8. By doing this, some bloopers and DVD credits will be shown. The DVD also features an audio commentary from director George Lucas, producer Rick McCallum, editor and sound designer Ben Burtt, ILM animation director Rob Coleman, and ILM visual effects supervisors Pablo Helman, John Knoll, and Ben Snow. Eight deleted scenes are included along with multiple documentaries, which include a full-length documentary about the creation of digital characters and two others that focus on sound design and the animatics team. Three featurettes examine the storyline, action scenes, and love story, and a set of 12 short web documentaries cover the overall production of the film.\n\nThe Attack of the Clones DVD also features a trailer for a mockumentary-style short film known as R2-D2: Beneath the Dome. Some stores offered the full mockumentary as an exclusive bonus disc for a small extra charge. The film gives an alternate look at the \"life\" of the droid R2-D2. The story, which Lucas approved, was meant to be humorous.\n\nThe film was re-released in a prequel trilogy DVD box set on November 4, 2008.\n\nThe six-film Star Wars saga was released on Blu-ray Disc on September 16, 2011, in three different editions.\n\nOn April 7, 2015, Walt Disney Studios, 20th Century Fox, and Lucasfilm jointly announced the digital releases of the six released Star Wars films. Attack of the Clones was released through the iTunes Store, Amazon Video, Vudu, Google Play, and Disney Movies Anywhere on April 10, 2015.\n\nWalt Disney Studios Home Entertainment reissued Attack of the Clones on Blu-ray, DVD, and digital download on September 22, 2019. Additionally, all six films were available for 4K HDR and Dolby Atmos streaming on Disney+ upon the service's launch on November 12, 2019. This version of the film was released by Disney on 4K Ultra HD Blu-ray on March 31, 2020, whilst being re-released on Blu-ray and DVD."
    },
    {
      "title": "Cancelled 3D re-release",
      "content": "On September 28, 2010, it was announced that all six films in the series were to be stereo-converted to 3D, and re-released in chronological order beginning at The Phantom Menace which was released on February 10, 2012. Attack of the Clones was originally scheduled to be re-released in 3D on September 20, 2013, but was cancelled due to Lucasfilm's desire to focus on Star Wars: The Force Awakens. However, the 3D presentation of the film was first shown at Celebration Europe II from July 26 to 28, 2013."
    },
    {
      "title": "Critical response",
      "content": "On review aggregator Rotten Tomatoes, the film holds an approval rating of based on  reviews, with an average rating of. The site's critical consensus reads, \"Star Wars Episode II: Attack of the Clones benefits from an increased emphasis on thrilling action, although they're once again undercut by ponderous plot points and underdeveloped characters.\" On Metacritic, the film has a weighted average score of 54 out of 100, based on 39 critics, which indicates \"mixed or average reviews\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale, the same score as the previous film.\n\nNumerous critics characterized the dialogue as \"stiff\" and \"flat\". The acting was also disparaged by some critics. Conversely, other critics felt fans would be pleased to see that Jar Jar Binks has only a minor role. Additionally, Jar Jar's attempts at comic relief seen in The Phantom Menace were toned down; instead, C-3PO reprised some of his bumbling traditions in that role. McGregor referred to the swordplay in the film as \"unsatisfactory\" when comparing it to the climactic duel in Revenge of the Sith as it neared release. ReelViews.net's James Berardinelli gave a positive review, saying \"in a time when, more often than not, sequels disappoint, it's refreshing to uncover something this high-profile that fulfills the promise of its name and adds another title to a storied legacy.\" Jeffrey Westhoff of Northwest Herald gave the film a two out of four scoring, explaining that \"the battling Yoda looks ludicrous, like Kermit the Frog in a Matrix fight scene.\" Steven Rea of The Philadelphia Inquirer gave it a two-and-a-half out of four rating, stating that \"this thing will have your mind glazed over faster than a glob of dough in a Krispy Kreme plant.\"\n\nRoger Ebert, who had praised the previous Star Wars films, gave Episode II only two out of four stars, noting \"[As] someone who admired the freshness and energy of the earlier films, I was amazed, at the end of Episode II, to realize that I had not heard one line of quotable, memorable dialogue.\" About Anakin and Padmé's relationship, Ebert stated, \"There is not a romantic word they exchange that has not long since been reduced to cliché.\" In a mixed review, Kenneth Turan of the Los Angeles Times said, \"Only a teenage boy could find this kind of stuff continually diverting, and only a teenage boy would not notice flimsy emotions and underdeveloped acting. It seems George Lucas, like Peter Pan, has never really grown up.\" Leonard Maltin, who also liked all of the previous installments, awarded two stars out of four to this endeavor as well, as seen in his Movie and Video Guide from the 2002 edition onward. Maltin cited an \"overlong story\" as reason for his dissatisfaction and added \"Wooden characterizations and dialogue don't help.\""
    },
    {
      "title": "Box office",
      "content": "During its opening day, Attack of the Clones made $30.1 million, combined with $6 million from midnight screenings. At that point, it had the highest Thursday gross of any film, taking the former record held by Independence Day. It would go on to make $116.3 million within its first four days of release, making it the second-fastest film to approach the $100 million mark, behind Spider-Man. Plus, it had already grossed $80 million over the weekend, becoming the third-highest three-day opening weekend of all time, after Harry Potter and the Sorcerer's Stone and Spider-Man. Attack of the Clones had the highest opening weekend for a 20th Century Fox film until 2003 when it was taken by X2. That year, The Matrix Reloaded beat Attack of the Clones for having the biggest Thursday opening of any film. The film would stay at the top of the box office for two weeks until it was dethroned by The Sum of All Fears.\n\nAttack of the Clones grossed $310,676,740 in North America and $338,721,588 overseas for a worldwide total of $649,398,328. Though a box office success, it was nevertheless overshadowed by the even greater box office success of The Phantom Menace three years earlier. It was not the top-grossing film of the year, either in North America (where it finished in third place) or worldwide (where it was fourth), the first time that a Star Wars film did not have this distinction. In North America, it was outgrossed by Spider-Man and The Lord of the Rings: The Two Towers, both of which were more favorably received by critics. Worldwide, it was also outgrossed by Harry Potter and the Chamber of Secrets. Adjusted for inflation, Attack of the Clones is the lowest-performing live-action Star Wars film at the North American box office, though is still among the 100 highest-grossing films of all time when adjusted for inflation. The film sold an estimated 52,012,300 tickets in the US in its initial theatrical run.\n\nInternationally, Attack of the Clones made $69.1 million during its opening weekend from 71 countries, breaking Harry Potter and the Sorcerer's Stone's record for having the largest international opening weekend. The combined total gross increased to $173.9 million, making it the highest worldwide opening weekend at that time. It made a total opening weekend gross of $54 million in Europe, with $17 million from the UK, $11 million from Germany, $7.6 million from France and $4.5 million from Spain. The film also recorded the highest opening weekend in Hungary, surpassing The Lord of the Rings: The Fellowship of the Ring. In the UK, the film beat out About a Boy to reach the number one spot, ranking behind Harry Potter and the Sorcerer's Stone as the country's second-highest opening weekend. Until the release of Finding Nemo in 2003, it was one of the highest-grossing digital films at the Manchester UCI Cinemas. With a total gross of $954,000, Attack of the Clones had the second-highest opening of any film in Singapore, behind The Lost World: Jurassic Park. Meanwhile, in Japan, it earned a total of $13.8 million in its first two days of release, joining The Phantom Menace, Mission: Impossible 2 and A.I. Artificial Intelligence to rank themselves in the list of the country's top five highest opening weekends of all time. Outside the United States and Canada, the film grossed over $10 million in Australia ($18.9 million), France and Algeria ($30.6 million), Germany ($35 million), Italy ($12.9 million), Japan ($78.1 million), Spain ($16.1 million), and the United Kingdom and Ireland ($58.7 million)."
    },
    {
      "title": "Accolades",
      "content": "Following suit with the series' previous installments, the Academy Awards nominated Attack of the Clones ' Rob Coleman, Pablo Helman, John Knoll, and Ben Snow for Best Visual Effects at the 2003 Academy Awards. Natalie Portman was also honored at the Teen Choice Awards, and the film received an award for Best Fight at the MTV Movie Awards. In contrast, the film also received seven nominations from the Golden Raspberry Awards for Worst Picture, Worst Director (George Lucas), Worst Screenplay (George Lucas), Worst Supporting Actor (Hayden Christensen), Worst Supporting Actress (Natalie Portman), Worst Screen Couple (Hayden Christensen and Natalie Portman) and Worst Remake or Sequel. It took home two awards for Worst Screenplay (George Lucas) and Worst Supporting Actor (Hayden Christensen)."
    },
    {
      "title": "Legacy and influence",
      "content": "In a 2023 interview, cartoonist and animation producer ND Stevenson said that he was compelled by the shapeshifting character, Zam Wesell, causing him to think more about shapeshifting, and said the film was where his \"love of shapeshifters specifically started. In other interviews, Stevenson expressed his affinity for Wesell, even stating that Double Trouble in She-Ra and the Princesses of Power is meant as an homage to Wesell. Stevenson also said that at an early age, Wesell created a huge impression on him, noting he latched onto Zam because she was a shapeshifter, causing him to come up with a version of the story when Zam lived, \"became the main character\" in a \"whole parallel world\" that Stevenson constructed.\n\nIn the archivist field, the film has been critically approached for its depiction of a librarian stereotype in the character Jocasta Nu, the Jedi archivist/librarian of the Jedi Temple library. Some have noted that the archives depicted in the film resembles a library, while Nu wears clothing which represents her \"devotion to knowledge and learning\" and provides reference assistance to Obi-Wan Kenobi. For instance, scholar Eric Ketelaar argued that Nu is an example of an archivist that \"mediates, shares, or obstructs\" power of the archives, as dictated by the film's plot. In contrast, former Society of American Archivists president Randall C. Jimerson stated that the film provides a \"more confident view of archives\" than other media, showing the powerful and confident role of an archivist despite \"archival sabotage\". Otherwise, Richard Pearce-Moses, stated the Nu's notion, that information not within the archives doesn't exist, is a \"naïve\" and is believed by some in regard to information not on the internet.\n\nOther scholars have critically approached the film with different perspectives. Anna Lancashire stated that the film has the impact of turning the other films into an \"epic commentary on American and international politics and economics\", and on political empires based on aggressiveness, \"human greed...hatred, and fear\". Timothy P. Chartier argued how the film can be used in classrooms for topics such as linear algebra, calculus, and numerical analysis. Scholar Bradley Schauer said that the film is a unified, classical text, and argued that it has different meanings for \"both general and specialized audiences\"."
    },
    {
      "title": "Novelizations",
      "content": "Two novels based on the film were published, a tie-in junior novel by Scholastic, and a novelization written by R. A. Salvatore, which includes some unique scenes. A four-issue comic book adaptation was written by Henry Gilroy and published by Dark Horse Comics."
    },
    {
      "title": "Sequel",
      "content": "A sequel titled Revenge of the Sith was released May 19, 2005, and was written and directed by George Lucas. It concludes the Prequel Trilogy with the story of Anakin's transformation into Darth Vader as well as the death of Padmé Amidala and the destruction of all of the Jedi except for Obi-Wan and Yoda."
    }
  ]
}