{
  "title": "Star Wars: Episode III – Revenge of the Sith",
  "parentTitle": "Star Wars",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    }
  ],
  "content": "Star Wars: Episode III – Revenge of the Sith (also known as Star Wars: Revenge of the Sith) is a 2005 American epic space opera film that is the sequel to The Phantom Menace (1999) and Attack of the Clones (2002). It is the sixth film in the Star Wars film series, the third installment in the Star Wars prequel trilogy, and third chronological chapter of the \"Skywalker Saga\". It was written and directed by George Lucas, who also served as executive producer. The film stars Ewan McGregor, Natalie Portman, Hayden Christensen, Ian McDiarmid, Samuel L. Jackson, Christopher Lee, Anthony Daniels, Kenny Baker, and Frank Oz.\n\nRevenge of the Sith is set three years after the onset of the Clone Wars, as established in Attack of the Clones, which depicts the rise of Darth Sidious and the Galactic Empire as well as Anakin Skywalker turning to the dark side of the Force, which will have wide-ranging consequences in the galaxy that lead to the extermination of the Jedi.\n\nLucas began writing the script before production of Attack of the Clones ended, saying he wanted the end of the trilogy to be similar to a romantic tragedy, thus leading into Darth Vader's state at the beginning of the next film. Production of Revenge of the Sith started in June 2003, and filming took place in Australia, Thailand, Switzerland, China, Italy, and the United Kingdom.\n\nRevenge of the Sith premiered on May 16, 2005, at the Cannes Film Festival, and was theatrically released in the United States on May 19. The film received mostly positive reviews from critics, with praise for the mature themes, darker tone, emotional depth, soundtrack and action sequences, although some criticism was reserved for Lucas's screenplay and Christensen's performance; many consider it the best installment of the trilogy. It broke several box-office records during its opening week and earned $850 million worldwide during its initial run, making it the second-highest-grossing film in the Star Wars franchise at the time. It was the highest-grossing film in the U.S. and the second-highest-grossing film worldwide in 2005. It also holds the record for the highest opening-day gross on a Thursday, at $50 million. It was the last Star Wars film distributed by 20th Century Fox, although the company (and, by extension, the film) was acquired by Disney several years after it acquired Lucasfilm.",
  "sections": [
    {
      "title": "Plot",
      "content": "Orbiting above Coruscant, Jedi Master Obi-Wan Kenobi and Knight Anakin Skywalker lead a mission to rescue Supreme Chancellor Palpatine from the cyborg Separatist commander General Grievous. After infiltrating Grievous's flagship, Obi-Wan and Anakin battle the Sith Lord Count Dooku, whom Anakin decapitates at Palpatine's insistence. Grievous escapes the damaged ship before Obi-Wan and Anakin crash-land it on Coruscant. Anakin reunites with his wife, Padmé Amidala, who tells him she is pregnant. Anakin has visions of Padmé dying in childbirth.\n\nPalpatine appoints Anakin to the Jedi Council as his representative. Distrusting Palpatine, the Council agrees but refuses to make Anakin a Jedi Master. They instead instruct him to spy on Palpatine, diminishing Anakin's faith in the Jedi. Meanwhile, on Utapau, Grievous relocates the Separatist leaders to the volcanic planet Mustafar. Obi-Wan travels to Utapau, where he confronts and kills Grievous, while Yoda travels to the Wookiee planet of Kashyyyk to defend it from the Separatist droid attack on the Wookiees.\n\nMeanwhile, Palpatine tempts Anakin with the dark side of the Force, promising that it can save the life of Padmé. Anakin deduces that Palpatine is the Sith Lord behind the Clone Wars and reports his treachery to Mace Windu, who confronts and subdues Palpatine, leaving the latter disfigured. Desperate to save Padmé, Anakin prevents Windu from killing Palpatine by slicing off his right hand. Palpatine then sends Windu falling to his death. Despite being horrified by his actions, Anakin pledges himself to the Sith, and Palpatine knights him as Darth Vader. Palpatine issues Order 66, which commands the clone troopers to kill their commanding Jedi generals across the galaxy, while Vader and a battalion of clone troopers kill the remaining Jedi in the Jedi Temple. Vader then travels to Mustafar to assassinate the Separatist leaders, while Palpatine declares himself Emperor before the Galactic Senate, transforming the Republic into the Galactic Empire. He denounces the Jedi as traitors.\n\nObi-Wan and Yoda survive Order 66 and learn that Anakin has turned to the dark side. On Coruscant, Yoda instructs Obi-Wan to confront Vader while he faces Palpatine. Obi-Wan seeks out Padmé to discover Vader's whereabouts and reveals his treachery. Padmé travels to Mustafarunaware that Obi-Wan has stowed aboard her shipand pleads with Vader to abandon the dark side. When Obi-Wan emerges, an enraged Vader believes Padmé has betrayed him and strangles her. Obi-Wan and Vader engage in a lightsaber duel, which ends with Obi-Wan severing Vader's left arm and both legs. Vader is then burned alive by a nearby lava flow as Obi-Wan retrieves Vader's lightsaber and leaves him for dead.\n\nMeanwhile, Yoda battles Palpatine on Coruscant, culminating in a stalemate. Yoda flees with Senator Bail Organa and regroups with Obi-Wan and Padmé on the planetoid Polis Massa. Padmé gives birth to twins, whom she names Luke and Leia. She dies soon after, still believing there is good in Anakin. Palpatine recovers a barely alive Vader. On Coruscant, Vader's mutilated body is treated and encased in a black, armored life-support suit. When he asks about Padmé, Palpatine says Vader killed her out of rage, leaving Vader devastated.\n\nObi-Wan and Yoda conceal the twins' birth from the Sith and retreat into exile until the Empire can be challenged. As Padmé's funeral is underway on Naboo, Palpatine and Vader supervise the construction of the Death Star. Bail takes Leia to Alderaan to raise her as his daughter. Obi-Wan delivers Luke to his step-uncle and step-aunt, Owen and Beru Lars, on Tatooine. Obi-Wan settles nearby as a recluse while watching over young Luke."
    },
    {
      "title": "Cast",
      "content": "\n * Ewan McGregor as Obi-Wan Kenobi, a Jedi Master, general of the Galactic Republic and Anakin's best friend and mentor.\n * Natalie Portman as Padmé Amidala, a senator of Naboo who is secretly Anakin's wife and pregnant with their children.\n * Samuel L. Jackson as Mace Windu, a Jedi Master and senior member of the Jedi Council.\n * Jimmy Smits as Bail Organa, a senator from Alderaan.\n * Anthony Daniels as C-3PO, Anakin and Padmé's personal protocol droid that Anakin created as a child.\n * Kenny Baker as R2-D2, Anakin's astromech droid.\n * Frank Oz as Yoda, a Jedi Grandmaster and the leader of the Jedi Council.\n * Hayden Christensen as Anakin Skywalker / Darth Vader, a Jedi Knight, hero of the Clone Wars and former Padawan of Obi-Wan and Padmé's secret husband who turns to the dark side of the Force and becomes a Sith Lord. Christensen also plays Vader in his suit. James Earl Jones reprises his role as the voice of Vader from previous Star Wars media in an uncredited cameo.\n * Ian McDiarmid as Palpatine / Darth Sidious, the Supreme Chancellor of the Galactic Republic who is secretly a Sith Lord, and later the Emperor of the Galactic Empire. He takes advantage of Anakin's distrust of the Jedi and fear of Padmé dying to turn him towards the dark side, becoming Vader's master.\n * Christopher Lee as Count Dooku / Darth Tyranus, Sidious' Sith apprentice and the leader of the Separatists. He is decapitated by Anakin on the orders of his master.\n\nPeter Mayhew, Ahmed Best, and Silas Carson reprise their roles as Chewbacca, Jar Jar Binks, and Nute Gunray and Ki-Adi-Mundi, respectively, from the previous films. Joel Edgerton and Bonnie Piesse also make cameo appearances, reprising their roles as Owen and Beru Lars respectively from Attack of the Clones. Sound engineer Matthew Wood provides the voice of General Grievous, the fearsome cyborg commander of the Separatists' droid army, who had been trained in wielding a lightsaber by Count Dooku. Wood took over the role, after Gary Oldman was originally cast in the role, but had to drop out of the production due to scheduling conflicts; Oldman had completed some voice-over work. Temuera Morrison portrays Commander Cody and the rest of the clone troopers. Bruce Spence portrays Tion Medon, local administrator of Utapau. At Padmé's funeral on Naboo, Keisha Castle-Hughes briefly appears as Queen Apailana alongside Oliver Ford Davies reprising his role as Sio Bibble. Jeremy Bulloch (who played Boba Fett in The Empire Strikes Back and Return of the Jedi) appears as Captain Colton, the pilot of the CR70 corvette Tantive III. Genevieve O'Reilly portrays senator Mon Mothma, though her speaking scene was ultimately cut. Rohan Nichol portrays Captain Raymus Antilles.\n\nWayne Pygram appears as a young Wilhuff Tarkin, and stunt coordinator Nick Gillard appears as a Jedi named Cin Drallig (his name spelled backward, without the 'k'). Editor Roger Barton's son Aidan Barton portrays Luke Skywalker and Leia Organa as infants.\n\nDirector and Star Wars creator George Lucas has a cameo as Baron Papanoida, a blue-faced alien in attendance at the Coruscant opera house. Lucas' son Jett portrays Zett Jukassa, a young Jedi-in-training. One of Lucas' daughters, Amanda, appears as Terr Taneel, seen in a security hologram, while his other daughter Katie plays a blue-skinned Pantoran named Chi Eekway, visible when Palpatine arrives at the Senate after being saved by the Jedi and talking to Baron Papanoida at the opera house. Christian Simpson appeared as a stunt double for Hayden Christensen."
    },
    {
      "title": "Writing",
      "content": "George Lucas said he conceived the Star Wars saga's story in the form of a plot outline in 1973. However, he later clarified that, at the time of the saga's conception, he had not fully realized the details—only major plot points. The film's climactic duel has its basis in the Return of the Jedi novelization, in which Obi-Wan recounts his battle with Vader that ended with the latter falling \"into a molten pit\". Lucas began working on the screenplay for Episode III before the previous film, Attack of the Clones, was released, proposing to concept artists that the film would open with a montage of seven battles on seven planets. In The Secret History of Star Wars, Michael Kaminski surmises that Lucas found flaws with Anakin's fall to the dark side and radically reorganized the plot. For example, instead of opening the film with a montage of Clone War battles, Lucas decided to focus on Anakin, ending the first act with him killing Count Dooku, an action that signals his turn to the dark side.\n\nA significant number of fans speculated online about the episode title for the film with rumored titles including Rise of the Empire, The Creeping Fear (which was also named as the film's title on the official website on April Fool's 2004), and Birth of the Empire. Eventually, Revenge of the Sith also became a title guessed by fans that George Lucas would indirectly confirm. The title is a reference to Revenge of the Jedi, the original title of Return of the Jedi; Lucas changed the title scant weeks before the premiere of Return of the Jedi, declaring that a true Jedi could never seek revenge.\n\nLucas had originally planned to include significantly more ties to the original trilogy, and wrote early drafts of the script in which a 10-year-old Han Solo appeared on Kashyyyk, but the role was not cast or shot. He also wrote a scene in which Palpatine reveals to Anakin that he created him from midichlorians, and is thus his \"father\", a clear parallel to Vader's revelation to Luke in The Empire Strikes Back, but later scrapped this scene as well. Another planned scene by Lucas that was written during the early development of the film was a conversation between Master Yoda and the ghostly Qui-Gon Jinn, with Liam Neeson reprising his role as Jinn (he also hinted his possible appearance in the film). However, the scene was never filmed and Neeson was never recorded, although the scene was present in the film's novelization.\n\nAfter principal photography was complete in 2003, Lucas made significant changes to Anakin's character, rewriting his turn to the dark side. Lucas accomplished this through editing the principal footage and filming new scenes during pickups in London in 2004. In the previous versions, Anakin had several reasons for turning to the dark side, one of which was his sincere belief that the Jedi were plotting to take over the Republic. Although this is still intact in the finished film, by revising and refilming many scenes, Lucas emphasized Anakin's desire to save Padmé from death. Thus, in the version that made it to theaters, Anakin falls to the dark side primarily to save Padmé."
    },
    {
      "title": "Art design",
      "content": "For the Kashyyyk environment, the art department turned to the Star Wars Holiday Special for inspiration. Over a period of months, Lucas would approve hundreds of designs that would eventually appear in the film. He would later rewrite entire scenes and action sequences to correspond to certain designs he had chosen. The designs were then shipped to the pre-visualization department to create moving CGI versions known as animatics. Ben Burtt would edit these scenes with Lucas in order to pre-visualize what the film would look like before the scenes were filmed. The pre-visualization footage featured a basic raw CGI environment with equally unprocessed character models performing a scene, typically for action sequences. Steven Spielberg was brought in as a \"guest director\" for the film's climax, overseeing the pre-visualization of an unused version of the Utapau chase scene and making art-design suggestions for the Order 66 assassinations as well as the Mustafar duel. The pre-visualization and art department designs were sent to the production department to begin building sets, props and costumes."
    },
    {
      "title": "Filming",
      "content": "Although the first scene filmed was the final scene to appear in the film (shot during the filming of Attack of the Clones in 2000), the first bulk of principal photography on the film occurred from June 30, 2003, to September 17, 2003, with additional photography at Shepperton Studios in Surrey and Elstree Studios in Hertfordshire from August 2004 to January 31, 2005. The initial filming took place on sound stages at Fox Studios Australia in Sydney, although practical environments were shot as background footage later to be composited into the film. These included the limestone mountains depicting Kashyyyk, which were filmed in Phuket, Thailand. The production company was also fortunate enough to be shooting at the same time that Mount Etna erupted in Italy. Camera crews were sent to the location to shoot several angles of the volcano that were later spliced into the background of the animatics and the final film version of the planet Mustafar.\n\nWhile shooting key dramatic scenes, Lucas would often use an \"A camera\" and \"B camera\", or the \"V technique\", a process that involves shooting with two or more cameras at the same time in order to gain several angles of the same performance. Using the HD technology developed for the film, the filmmakers were able to send footage to the editors the same day it was shot, a process that would require a full 24 hours had it been shot on film. Footage featuring the planet Mustafar was given to editor Roger Barton, who was on location in Sydney cutting the climactic duel.\n\nHayden Christensen said Lucas asked him \"to bulk up and physically show the maturity that had taken place between the two films.\" The actor explained that he worked out with a trainer in Sydney for three months and ate \"six meals a day and on every protein, weight gain supplement that man has created\" to go from 160 lb to 185 lb.\n\nChristensen and Ewan McGregor began rehearsing their climactic lightsaber duel long before Lucas would shoot it. They trained extensively with stunt coordinator Nick Gillard to memorize and perform their duel together. As in the previous prequel film, McGregor and Christensen performed their own lightsaber fighting scenes without the use of stunt doubles. The speed at which Vader and Obi-Wan engage in their duel is mostly the speed at which it was filmed, although there are instances where single frames were removed to increase the velocity of particular strikes. An example of this occurs as Obi-Wan strikes down on Vader after applying an armlock in the duel's first half.\n\nRevenge of the Sith was the first Star Wars film in which Anakin Skywalker and the suited Darth Vader were played by the same actor in the same film. As Christensen recounted, it was originally intended to simply have a \"tall guy\" in the Darth Vader costume, but, after \"begging and pleading\", Christensen persuaded Lucas to have the Vader costume used in the film created specifically to fit him. The new costume featured shoe lifts and a muscle suit. It also required Christensen (who is 6 ft tall) to look through the helmet's mouthpiece.\n\nIn 2004, Gary Oldman was originally approached to provide the voice of General Grievous; however, complications arose during contract negotiations after Oldman learned the film was to be made outside of the Screen Actors Guild, of which he is a member. He decided to drop out of the role rather than violate the union's rules. Matthew Wood, who voiced Grievous, disputed this story at Celebration III, held in Indianapolis. According to him, Oldman is a friend of producer Rick McCallum, and thus recorded an audition as a favor to him, but was not chosen. Wood, who was also the supervising sound editor, was in charge of the auditions and submitted his audition anonymously in the midst of 30 others, under the initials \"A.S.\" for Alan Smithee. Days later, he received a phone call asking for the full name to the initials \"A.S.\""
    },
    {
      "title": "Visual effects",
      "content": "The post-production department (handled by Industrial Light & Magic) began work during filming and continued until weeks before the film was released in 2005. Special effects were created using almost all formats, including model work, CGI and practical effects. The same department later composited all such work into the filmed scenes—both processes taking nearly two years to complete. Revenge of the Sith has 2,151 shots that use special effects, a world record. There was a miniature model of Mustafar that measured a length of 33 ft, a width of 18 ft and a height of 7 ft, making it the largest scale model ever built for any film at the time.\n\nThe film required 910 artists and 70,441 man-hours to create 49 seconds of footage for the Mustafar duel alone. Members of Hyperspace, the Official Star Wars Fan Club, received a special look into the production. Benefits included not only special articles, but they also received access to a webcam that transmitted a new image every 20 seconds during the time it was operating in Fox Studios Australia. Many times the stars, and Lucas himself, were spotted on the webcam."
    },
    {
      "title": "Deleted scenes",
      "content": "Lucas excised all scenes of a group of Senators, including Padmé, Bail Organa, and Mon Mothma (Genevieve O'Reilly), organizing an alliance to prevent Palpatine from usurping any more emergency powers. Though this is essentially the birth of the Rebel Alliance, the scenes were discarded to achieve more focus on Anakin's story. The scene where Yoda arrives on Dagobah to begin his self-imposed exile was also removed, but is featured as an extended scene in the DVD release, although McCallum stated he hoped Lucas would have added it to the new cut as part of a six-episode DVD box set.\n\nBai Ling filmed minor scenes for the film playing a senator, but her role was cut during editing. She claimed this was because she appeared in a nude pictorial for the June 2005 issue of Playboy, whose appearance on newsstands coincided with the film's May release. Lucas denied this, stating that the cut had been made more than a year earlier, and that he had cut his own daughter's scenes as well. The bonus features show an additional removed scene in which Jedi Master Shaak Ti is killed by General Grievous in front of Obi-Wan and Anakin. The bonus features also show Obi-Wan and Anakin running through Grievous' ship, escaping droids through a fuel tunnel, and arguing over what R2-D2 is saying."
    },
    {
      "title": "Music",
      "content": "The music was composed and conducted by John Williams, who has composed and conducted the score for every episode in the Star Wars saga, and performed by the London Symphony Orchestra and London Voices in February 2005. The film's soundtrack was released by Sony Pictures Classical Records on May 3, 2005, more than two weeks before the film's release. A music video titled A Hero Falls was created for the film's theme, \"Battle of the Heroes\", featuring footage from the film and was also available on the DVD.\n\nThe soundtrack also came with a collectors' DVD hosted by McDiarmid, titled Star Wars: A Musical Journey, which features 16 music videos set to remastered selections of music from all six film scores, set chronologically through the saga."
    },
    {
      "title": "Themes",
      "content": "Throughout Revenge of the Sith, Lucas refers to a wide range of films and other sources, drawing on political, military, and mythological motifs to enhance his story's impact. The most media coverage was likely given to an exchange between Anakin and Obi-Wan, leading to the aforementioned conflict: \"If you're not with me, then you're my enemy\", Anakin declares. Despite Lucas' insistence to the contrary, The Seattle Times concluded, \"Without naming Bush or the Patriot Act, it's all unmistakable no matter what your own politics may be.\" Anakin's \"If you are not with me, then you are my enemy\" line is a reference to Bush's post-9/11 quote, \"You are either with us, or against us\".\n\nMcDiarmid, Lucas, and others have also called Anakin's journey to the dark side Faustian in the sense of making a \"pact with the devil\" for short-term gain, with the fiery volcano planet Mustafar representing hell. Midway through the film, Lucas intercuts between Anakin and Padmé by themselves, thinking about one another in the Jedi Temple and their apartment, respectively, during sunset. The sequence is without dialogue and complemented by a moody, synthesized soundtrack. Lucas' coverage of the exterior cityscapes, skylines and interior isolation in the so-called \"Ruminations\" sequence is similar to the cinematography and mise-en-scène of Rosemary's Baby, a film in which a husband makes a literal pact with the devil."
    },
    {
      "title": "Marketing",
      "content": "The first trailer for Revenge of the Sith was released in theaters on November 5, 2004, with the premiere of The Incredibles. It was also attached to the screenings of The Polar Express, National Treasure, Alexander, Ocean's Twelve, Meet the Fockers and Flight of the Phoenix, among other films. At the same time, the trailer became available on the Internet. Just four months later, another Revenge of the Sith trailer was unveiled on March 10, 2005, debuting on Fox Network with The O.C.'s \"The Mallpisode\" during the second season (Lucas himself would appear in a later episode). The next day on March 11, the trailer then premiered in theaters with the theatrical release of Robots. On March 14, it would be released on the official Star Wars website. Prior to this, bootleg copies of the trailer were leaked everywhere, as the official trailer was in the subscriber section. The trailers were even attached to the DVD releases of Star Wars: Clone Wars. Three days later on March 17, 2005, George Lucas revealed a preview of the film at the ShoWest Convention in Las Vegas, saying \"It's not like the old Star Wars. This one's a little bit emotional. We like to describe it as Titanic in space. It's a tearjerker.\"\n\nTo promote the release of Revenge of the Sith, Burger King began selling cups and toys themed to the film for their kids meals at their restaurants. However, just like what McDonald's did to the Happy Meal promotion for Batman Returns in 1992, officials urged to recall the kids meal toys due to the film's PG-13 rating. While Cingular Wireless released commercials showing Chewbacca growling into a microphone for ringtones, Hasbro released a Darth Vader variation of Mr. Potato Head called \"Darth Tater\" across retail stores. Kellogg's would promote the film by premiering a new Star Wars cereal, which featured marshmallows shaped like droids and lightsabers. Also released were Lava Berry Explosion Pop-Tarts, as well as Keebler Lava Stripes cookies, a variation of the Fudge Stripes cookies. M&M's debuted a new chocolate flavor that came in either the Darth Mix and Jedi Mix, both of which contained multi-colored candies. Meanwhile, 7-Eleven rolled out a new Slurpee flavor to help coincide with the release of Revenge of the Sith. Known as the Darth Dew Slurpee, it featured grape-flavored Mountain Dew and was served in cups with Darth Vader's helmet and 3D images. Additionally, Pepsi would serve as a promotional partner for the film. Frito-Lay even released twisted Cheetos that had Darth Vader Dark and Yoda Green colors."
    },
    {
      "title": "Theatrical",
      "content": "Star Wars: Episode III – Revenge of the Sith charity premieres took place in Seattle, Los Angeles, Chicago, Washington D.C., Boston, Denver, Atlanta, San Francisco, and Miami on Thursday, May 12, 2005; and on May 13, 2005, there were two additional charity premiere screenings in George Lucas's hometown of Modesto, California. The official premiere was at the 2005 Cannes Film Festival (out of competition) on May 16. Its theatrical release in most other countries took place on May 19 to coincide with the 1999 release of The Phantom Menace (the 1977 release of A New Hope and the 1983 release of Return of the Jedi were also released on the same day and month, six years apart). The global outplacement firm Challenger, Gray & Christmas claimed one week before the premiere that it may have cost the U.S. economy approximately US$627 million in lost productivity because of employees who took a day off or reported in sick. Grauman's Chinese Theatre, a traditional venue for the Star Wars films, did not show it. However, a line of people stood there for more than a month hoping to convince someone to change this. Most of them took advantage of an offer to see the film at a nearby cinema, ArcLight Cinemas (formerly the \"Cinerama Dome\"). On May 16, the Empire Cinema in London's Leicester Square hosted a day-long Star Wars marathon showing of all six films; an army of Imperial stormtroopers \"guarded\" the area, and the Royal Philharmonic Orchestra gave a free concert of Star Wars music."
    },
    {
      "title": "Leaked workprint",
      "content": "A copy of the film leaked onto peer-to-peer file sharing networks just hours after opening in theaters. The film was a time-stamped workprint, suggesting it may have come from within the industry rather than from someone who videotaped an advance screening. Eight people were later charged with copyright infringement and distributing material illegally. Documents filed by the Los Angeles District Attorney allege that a copy of the film was taken from an unnamed Californian post-production office by an employee, who later pleaded guilty to his charges. The illegal copy was passed among seven people until reaching an eighth party, who also pleaded guilty to uploading to an unnamed P2P network."
    },
    {
      "title": "Rating",
      "content": "Revenge of the Sith is the first Star Wars film to receive a PG-13 rating from the Motion Picture Association of America (MPAA), officially for \"sci-fi violence and some intense images\", namely for the scene in which Darth Vader is set aflame by lava. Lucas had stated months before the MPAA's decision that he felt the film should receive a PG-13 rating, because of Anakin's final moments and the film's content being the darkest and most intense of all six films. Roger Ebert and Richard Roeper later opined that children would be able to handle the film as long as they had parental guidance. All previously released films in the series were rated PG."
    },
    {
      "title": "Home media",
      "content": "Revenge of the Sith was released on DVD and VHS on October 31, 2005, in the United Kingdom and Ireland; on November 1, 2005, it was released in the United States and Canada on DVD; and on November 3, 2005, it was released in Australia. It was also released in most major territories on or near the same day. The DVD release consists of separate widescreen and pan and scan full-screen versions. This THX certified two-disc set contains one disc with the film and the other one with bonus features. The first disc features three randomized selected menus, which are Coruscant, Utapau and Mustafar. There is an Easter egg in the options menu. When the THX Optimizer is highlighted, the viewer can press 1-1-3-8. By doing this, a hip-hop music video with Yoda and some clone troopers will play.\n\nThe DVD includes a number of documentaries including a new full-length documentary as well as two featurettes, one which explores the prophecy of Anakin Skywalker as the Chosen One, the other looking at the film's stunts and a of web-documentaries from the official web site. Like the other DVD releases, included is an audio commentary track featuring Lucas, producer Rick McCallum, animation director Rob Coleman, and ILM visual effects supervisors John Knoll and Roger Guyett. were included with introductions from Lucas and McCallum.\n\nThis release is notable because, due to marketing issues, it was the first Star Wars film never to be released on VHS in the United States. However, the film was released on VHS in Australia, the United Kingdom and other countries.\n\nThe DVD was re-released in a prequel trilogy box set on November 4, 2008.\n\nThe six Star Wars films were released by 20th Century Fox Home Entertainment on Blu-ray on September 16, 2011, in three different editions.\n\nOn April 7, 2015, Walt Disney Studios, 20th Century Fox, and Lucasfilm jointly announced the digital releases of the six released Star Wars films. Revenge of the Sith was released through the iTunes Store, Amazon Video, Vudu, Google Play, and Disney Movies Anywhere on April 10, 2015.\n\nWalt Disney Studios Home Entertainment reissued Revenge of the Sith on Blu-ray, DVD, and digital download on September 22, 2019. Additionally, all six films were available for 4K HDR and Dolby Atmos streaming on Disney+ upon the service's launch on November 12, 2019. This version of the film was released by Disney on 4K Ultra HD Blu-ray on March 31, 2020, whilst being re-released on Blu-ray and DVD. All 20th Century Fox Fanfare and logo sequences on the first six films have been restored following the completion of Disney's acquisition of that studio in 2019 having been removed for the initial digital releases, except for A New Hope, which Fox had asked to retain all rights for prior to the sale of the studio to Disney."
    },
    {
      "title": "Cancelled 3D re-release",
      "content": "On September 28, 2010, it was announced that all six films in the series were to be stereo-converted to 3D. The films would be re-released in chronological order beginning with The Phantom Menace on February 10, 2012. Revenge of the Sith was originally scheduled to be re-released in 3D on October 11, 2013.\n\nHowever, on January 28, 2013, Lucasfilm announced that it was postponing the 3D release of episodes II and III in order to \"focus 100 percent of our efforts on Star Wars: The Force Awakens\" and that further information about 3D release plans would be issued at a later date. The 3D release was ultimately cancelled due to Lucasfilm's focus on the Star Wars sequel trilogy. The premiere of the 3D version was shown on April 17, 2015, at Star Wars Celebration Anaheim."
    },
    {
      "title": "2025 re-release",
      "content": "In February 2025, Lucasfilm announced a 20th-anniversary re-release of Star Wars: Revenge of the Sith. The re-release would premiere in both American and worldwide theaters on April 25, 2025 by Walt Disney Studios Motion Pictures through the 20th Century Studios label. The film was screened in 4DX for the first time. This technology includes motion-enabled seating synchronized with various environmental effects, designed to enhance the viewing experience. In the U.S., the re-release would make $3.4 million in Thursday previews. During the first weekend, the re-release would earn $25.5 million and rank #2 at the domestic box office behind Sinners, surpassing A Minecraft Movie and newly released The Accountant 2, opening to a worldwide opening of $43.2 million."
    },
    {
      "title": "Critical response",
      "content": "On review aggregator Rotten Tomatoes, the film has an approval rating of based on  reviews, with an average rating of. The site's critical consensus reads, \"With Episode III: Revenge of the Sith, George Lucas brings his second Star Wars trilogy to a suitably thrilling and often poignant – if still a bit uneven – conclusion.\" On Metacritic, the film has a weighted average score of 68 out of 100, based on 40 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale, the same score as the previous two films.\n\nMost critics have considered the film to be the best of the prequel trilogy. A. O. Scott of The New York Times concluded that it was \"the best of the four episodes Mr. Lucas has directed\", and equal to The Empire Strikes Back as \"the richest and most challenging movie in the cycle\". J.R. Jones, a Chicago Reader critic who disliked The Phantom Menace and Attack of the Clones, gave the film a positive review, saying that it had a \"relatively thoughtful story\". Peter Travers of Rolling Stone gave the film a scoring of two out of four stars, saying, \"Drink the Kool-Aid. Wear blinders. Cover your ears. Because that's the only way you can totally enjoy Revenge of the Sith\". David Sterritt of The Christian Science Monitor gave it a B and said, \"On the action-adventure level, it's a sure-fire delight for fans, a punchy entertainment for average sci-fi buffs, and a colorful rocket-ride for moviegoers who just want a good time on Saturday night\". Roger Ebert of the Chicago Sun-Times gave the film three-and-a-half out of four stars, writing \"If [Lucas] got bogged down in solemnity and theory in Episode II: Attack of the Clones, the Force is in a jollier mood this time, and Revenge of the Sith is a great entertainment\", but he noted that \"the dialogue throughout the movie is once again its weakest point\". Jonathan Rosenbaum of the Chicago Reader gave it a score of three out of four, saying, \"Lucas has woven into the action and effects a relatively thoughtful story about a young man meant for greatness but corrupted by his own fear and confusion, a story more Shakespearean than Arthurian\".\n\nThough many critics and fans viewed Revenge of the Sith as the strongest of the three prequels, some viewers thought it was more or less on par with the previous two episodes. Much of the criticism was directed towards the dialogue, particularly the film's romantic scenes; critics claimed this demonstrated Lucas's weakness as a writer of dialogue, a subject with which Lucas openly agreed when receiving the Lifetime Achievement Award from the American Film Institute. Some film critics and fans criticized Hayden Christensen's acting, calling it \"wooden\". A retrospective review by Time felt that Christensen's maligned performance was in part affected by the screenwriting."
    },
    {
      "title": "Other responses",
      "content": "Some American conservatives criticized the film, claiming it had a liberal bias and was a commentary on the George W. Bush administration and Iraq War. Some websites went so far as to propose a boycott of the film. Lucas defended the film, stating that the film's storyline was written during the Vietnam War and was influenced by that conflict rather than the war in Iraq. Lucas also said \"The parallels between Vietnam and what we're doing in Iraq now are unbelievable\".\n\nArt critic Camille Paglia praised the film as an essential example of the modern digital art movement due to its \"overwhelming operatic power and yes, seriousness\", and arguing that its finale has \"more inherent artistic value, emotional power, and global impact\" than the work of some contemporary artists.\n\nDuring the late 2010s, the film amassed a cult following on social media among some young fans who were children when the film was released, using the film's dialogue to create Internet memes."
    },
    {
      "title": "Box office",
      "content": "The film was released in 115 countries. Its worldwide gross eventually reached $849 million—making it the second-highest-grossing film of 2005, behind Harry Potter and the Goblet of Fire. The film earned an estimated $16.91 million from 2,900 midnight screenings in North America upon its release. In total, it earned a record $50 million on its opening day, marking the record for the highest opening-day gross on a Thursday. It was surpassed the following year by Pirates of the Caribbean: Dead Man's Chest, which earned $55.5 million on its opening day.\n\nWith only the May 19 earnings, the film broke four box office records: midnight screenings gross (previously held by The Lord of the Rings: The Return of the King, $8 million), opening day gross (Spider-Man 2, with $40.4 million), single day gross (Shrek 2 with $44.8 million) and Thursday gross (The Matrix Reloaded with $37.5 million). Its single day and opening day gross records were later surpassed by Pirates of the Caribbean: Dead Man's Chest on July 7, 2006, when that movie grossed $55.5 million on its opening day, and its midnight screening gross was broken by The Dark Knight on July 18, 2008, with $18.5 million. Overall, Revenge of the Sith would go on to generate a total of $108.4 million during its three-day opening weekend, making it the second-highest of all time, after Spider-Man. It held the record for having the biggest opening weekend for any 20th Century Fox film for a decade until it was taken by Deadpool in 2016. The year prior, Minions had already surpassed Revenge of the Sith for having the largest opening weekend for a prequel.\n\nAccording to box office analysis sites, the film set American records for highest gross in a given number of days for each of its first 12 days of release except for the seventh and eighth, where the record is narrowly held by Spider-Man 2. Within three days, Revenge of the Sith surpassed Spider-Man for having the highest three-day gross of any film, scoring a total of $124.7 million. Upon opening, the film would reach the number one spot at the box office, beating out Monster-in-Law and Kicking & Screaming. On its fifth day, it became the highest-grossing film of 2005, surpassing Hitch ($177.6 million). The film earned $158.5 million in its first four-day period, surpassing the previous four-day record held by The Matrix Reloaded ($134.3 million), and joining the latter film, Spider-Man, and Harry Potter and the Goblet of Fire as one of the only four films to make $100 million in their first three days. In eight days, it reached the $200 million mark (a record tied with Spider-Man 2) and by its 17th day, the film had passed $300 million (surpassing the record of 18 days of Shrek 2). It was eventually the third-fastest film (after Shrek 2 and Spider-Man) to reach $350 million. Revenge of the Sith earned a total of $55.2 million during its second weekend, making it the fourth-highest-grossing second weekend of all time, behind Harry Potter and the Sorcerer's Stone, Spider-Man and Shrek 2. The film then earned $70 million in just four days, becoming the seventh-highest Memorial Day weekend gross of any film, trailing only behind Shrek 2, The Lost World: Jurassic Park, The Day After Tomorrow, Bruce Almighty, Pearl Harbor and Mission: Impossible 2. It topped the domestic box office for a total of two consecutive weekends before being overtaken by Madagascar and The Longest Yard (which were in their second weekend) in its third weekend, but it still outgrossed Cinderella Man, The Sisterhood of the Traveling Pants and Lords of Dogtown.\n\nThe film wrapped up its run in American theaters on October 20, 2005, finishing with a total gross of $380,270,577. It ranks 29th in all-time domestic grosses and is the highest-grossing U.S. of 2005, out-grossing second-place The Chronicles of Narnia: The Lion, the Witch and the Wardrobe by nearly $90 million. The film sold an estimated 59,324,600 tickets in the US.\n\nInternational grosses that exceeded $460 million include those Australia ($27.2 million), France and Algeria ($56.9 million), Germany ($47.3 million), Italy ($11.3 million), Japan ($82.7 million), Mexico ($15.3 million), South Korea ($10.3 million), Spain ($23.8 million), and the United Kingdom and Ireland ($72.8 million). The total worldwide opening of Revenge of the Sith for each country was $254 million, combined with $304 million from its four-day weekend. It would go on to hold this record for two years before Spider-Man 3 took it in 2007."
    },
    {
      "title": "Accolades",
      "content": "Following the release of Revenge of the Sith—the completion of the original and prequel Star Wars series—on June 9, 2005, George Lucas was presented with the 33rd American Film Institute Lifetime Achievement Award. The institute honored his \"astonishing contributions to the art and technology of filmmaking, as well as the impact of the epic Star Wars series\".\n\nDespite being the prequel trilogy's best reviewed and received film, it received fewer award nominations than the previous films. It became the only Star Wars film not to be nominated for an Academy Award for Best Visual Effects; it was nominated for Best Makeup (Dave Elsey and Nikki Gooley), losing to The Chronicles of Narnia: The Lion, the Witch and the Wardrobe. It also won \"Favorite Motion Picture\" and \"Favorite Dramatic Motion Picture\" awards at the People's Choice Awards, \"Hollywood Movie of the Year\" award at the Hollywood Film Festival, Empire Awards for Sci-Fi/Fantasy Film and Scene of the Year (The birth of Vader), and the Teen Choice Award for Choice Movie – Action.\n\nAs did every film of the original trilogy, the film won the Saturn Award for Best Science Fiction Film. Williams also won Best Music. The film was nominated for ten Saturn Awards overall, including Best Director and Best Writing for Lucas, Best Actor for Christensen, Best Actress for Natalie Portman, and Best Supporting Actor for Ian McDiarmid.\n\nOf the three Star Wars prequels, the film received the fewest Golden Raspberry Awards nominations: only one, for Christensen as Worst Supporting Actor, which he won. (The Phantom Menace and Attack of the Clones received seven nominations each, with one and two wins, respectively.) It is the only Star Wars prequel not to receive a Razzie nomination for Worst Picture. Christensen further won the \"Best Villain\" award at the MTV Movie Awards. The film also received the fewest nominations (and no wins) at the 2005 Stinkers Bad Movie Awards: Worst Screenplay for a Film Grossing More Than $100M, and Worst On-Screen Couple (Christensen and Portman)."
    },
    {
      "title": "Novelization",
      "content": "The film's novelization was written by Matthew Stover. It has more dialogue than the film, and certain story elements were expanded upon in the novelization including Anakin and Palpatine's relationship and Palpatine's apprenticeship to Darth Plagueis."
    },
    {
      "title": "Video game",
      "content": "A video game based on the film was released on May 5, 2005, two weeks before the film. The game generally followed the film's storyline, integrating scenes from the film. However, many sections of the game featured scenes cut from the film, or entirely new scenes for the game. The style of the game was mostly lightsaber combat and fighting as Obi-Wan or Anakin. It also has a form of multiplayer mode, which includes both \"VS\" and \"Cooperative\" mode. In the first mode, two players fight with characters of their choice against each other in a lightsaber duel to the death. In the latter mode, two players team up to combat increasingly difficult waves of enemies."
    },
    {
      "title": "The Clone Wars",
      "content": "The 2008 animated film and subsequent television series fill the three-year gap between the events of Attack of the Clones and Revenge of the Sith. A number of plot threads initially developed for inclusion in Revenge of the Sith were instead incorporated into The Clone Wars. These include Boba Fett's revenge plot against Mace Windu for his father Jango's death, and the solving of the mystery behind deceased Jedi Master Sifo-Dyas which was introduced in Attack of the Clones. The final four episodes of the series take place concurrently with Revenge of the Sith. Several scenes from the film were recreated and expanded for these episodes in order to showcase the whereabouts of Anakin's former Padawan Ahsoka Tano during the events of the film, while also showing Anakin and Obi-Wan's whereabouts just prior to the film's opening scene. While Ahsoka was a major character in The Clone Wars, she is not referenced in Revenge of the Sith as the character had not yet been created at the time that the film was written."
    },
    {
      "title": "The Bad Batch",
      "content": "Several scenes from Revenge of the Sith were recreated in the first episode Aftermath. This episode also takes place concurrently with the film and the following episodes deal with the aftermath of Order 66 and the Clone Wars."
    },
    {
      "title": "Obi-Wan Kenobi",
      "content": "The 2022 miniseries takes place ten years after Revenge of the Sith (and approximately nine years before A New Hope), and features flashbacks taking place prior and during the events of the film, with some of the latter via archive footage. McGregor, Christensen, Earl Jones, Edgerton, Piesse, Smits, McDiarmid, and Daniels reprise their roles from the film."
    },
    {
      "title": "Backstroke of the West",
      "content": "In 2010, a fandub of Revenge of the Sith was released titled Star War [sic] the Third Gathers: Backstroke of the West. The script used in the fandub originated from the English subtitles of a Mandarin Chinese bootleg DVD of the film that had been purchased by an American in Shanghai. The subtitles, almost entirely filled with errors and mistranslations, stemmed from a bootlegger first having listened to the film in English, writing down what they believed to have heard and occasionally making things up, which was then converted into Mandarin and back into English via inaccurate machine translation, resulting in nonsensical Chinglish.\n\nThe dub became an Internet meme and a viral video and received praise from multiple news outlets. Patrick Shanley from The Hollywood Reporter described it as \"a fan-made masterpiece\", while Julia Alexander from Polygon called the dub \"hilarious\". Derrick Rossignol from Nerdist went so far as to say that the fandub was \"way better\" than the original film."
    }
  ]
}