{
  "title": "Star Wars: Episode VI – Return of the Jedi",
  "parentTitle": "Star Wars",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    }
  ],
  "content": "Return of the Jedi (also known as Star Wars: Episode VI – Return of the Jedi is a 1983 American epic space opera film directed by Richard Marquand from a screenplay by Lawrence Kasdan and George Lucas. The sequel to The Empire Strikes Back (1980), it is the third installment in the original Star Wars trilogy and the sixth chronological film in the \"Skywalker Saga\". The film follows the ongoing struggle between the malevolent Galactic Empire and the freedom fighters of the Rebel Alliance. As the rebels attempt to destroy the Empire's second Death Star, Luke Skywalker tries to bring his father, Darth Vader, back from the dark side of the Force. The film stars Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, David Prowse, Kenny Baker, Peter Mayhew, and Frank Oz.\n\nSteven Spielberg, David Lynch, and David Cronenberg were considered to direct the film before Marquand signed on as director. The production team relied on Lucas' storyboards during pre-production. While writing the shooting script, Lucas, Kasdan, Marquand, and producer Howard Kazanjian spent two weeks in conference discussing ideas to construct it. Kazanjian's schedule pushed shooting to begin a few weeks early to allow Industrial Light & Magic more time to work on the film's effects in post-production. Filming took place in England, California, and Arizona from January to May 1982.\n\nThe film was released in theaters on May 25, 1983. It grossed $374 million worldwide during its initial theatrical run, becoming the highest-grossing film of 1983. The film was well received by critics, with strong praise going to the performances of the actors, John Williams' score, the special effects and the action sequences. Several re-releases and revisions to the film have followed over the decades, which have brought its total gross to $482 million. The United States Library of Congress selected it for preservation in the National Film Registry in 2021. A prequel trilogy, released between 1999 and 2005, and a sequel trilogy, released between 2015 and 2019, followed.",
  "sections": [
    {
      "title": "Plot",
      "content": "A year after Han Solo's capture and imprisonment in carbonite, C-3PO and R2-D2 enter the palace of the crime lord Jabba the Hutt on Tatooine. They were sent as a goodwill gift by Luke Skywalker, who hopes to negotiate with Jabba for Han's release. Disguised as a bounty hunter, Princess Leia infiltrates the palace under the pretense of having captured Chewbacca. She releases Han from the carbonite but is caught by Jabba and enslaved. Luke arrives to bargain for the release of his friends, but Jabba drops him through a trapdoor to be eaten by a rancor. After Luke kills the beast, Jabba decrees that he, Han, and Chewbacca will be fed to a Sarlacc, a deadly ground-dwelling creature. Luke retrieves his new green lightsaber from R2-D2, and the group of friends battle Jabba's thugs aboard his sail barge. During the chaos, Boba Fett falls into the Sarlacc's pit and Leia strangles Jabba to death with her chains. The group escapes as Jabba's sail barge is destroyed.\n\nAs the others rendezvous with the Rebel Alliance, Luke returns to Dagobah to complete his Jedi training with Yoda, who is dying when he arrives. Before Yoda dies, he confirms that Darth Vader is Luke's father, the former Jedi Knight Anakin Skywalker, and that there is another Skywalker. Obi-Wan Kenobi's Force spirit tells Luke that Leia is his twin sister, and that he must face Vader again to finish his training and defeat the Empire.\n\nThe Alliance learns that the Empire has been constructing a second Death Star under the supervision of the Emperor. The station is protected by an energy shield on the forest moon of Endor. To destroy its generator, Han leads a strike team which includes Luke, Leia, and Chewbacca. Once on the moon, the team gains the trust of a tribe of Ewoks after an initial conflict. Later, Luke tells Leia that she is his sister, and that Vader is their father. Luke surrenders to Imperial troops and is brought before Vader, but fails to convince him to reject the dark side of the Force.\n\nLuke is brought to the Emperor, who intends to turn him to the dark side. He also reveals that Luke's friends on Endor and the rebel fleet are heading into a trap. On the forest moon, Han's team is captured by Imperial forces, but the Ewoks counterattack, allowing the rebels to infiltrate the shield generator. Meanwhile, Lando Calrissian and Admiral Ackbar lead the rebel assault on the Death Star, finding its shield still active and the Imperial fleet waiting for them.\n\nThe Emperor reveals to Luke that the Death Star is fully operational and orders the firing of its massive laser, which destroys a rebel starship. He tempts Luke to give in to his anger and embrace the dark side of the Force. Luke attacks him, but Vader intervenes, and the two engage in a lightsaber duel. Vader senses that Luke has a sister and threatens to turn her to the dark side if Luke does not join him. Enraged, Luke defeats Vader and severs his prosthetic hand. The Emperor orders Luke to kill his father, but Luke refuses. In response, the Emperor tortures Luke with Force lightning. Unwilling to let his son die, Vader throws the Emperor down a shaft to his demise. Vader is fatally wounded and asks Luke to remove his mask in a moment of reconciliation before he dies.\n\nAfter the rebel strike team destroys the shield generator, Lando leads fighter ships into the Death Star's core. While the rebel fleet destroys the Imperial command ship, Lando and X-wing pilot Wedge Antilles destroy the Death Star's main reactor and escape before the station explodes. Luke cremates Vader's body on Endor before reuniting with his friends. As the rebels celebrate their victory, Luke sees the Force spirits of Obi-Wan, Yoda, and Anakin standing nearby."
    },
    {
      "title": "Cast",
      "content": "\n * Mark Hamill as Luke Skywalker: A Jedi in training, a pilot in the Rebel Alliance, and the son of Darth Vader\n * Harrison Ford as Han Solo: A rebel general and captain of the Millennium Falcon\n * Carrie Fisher as Leia Organa: A leader of the Rebel Alliance\n * Billy Dee Williams as Lando Calrissian: The former administrator of Cloud City, Han's friend, and a rebel general\n * Anthony Daniels as C-3PO: A humanoid protocol droid\n * Peter Mayhew as Chewbacca: Han's Wookiee friend and co-pilot of the Millennium Falcon\n * Kenny Baker as\n * R2-D2: An astromech droid\n * Paploo: An Ewok who aids the rebels on Endor\n * Ian McDiarmid as the Emperor: The ruler of the Galactic Empire and Darth Vader's master\n * Frank Oz (puppeteer/voice) as Yoda: A centuries-old Jedi Master who trained Luke\n * David Prowse / James Earl Jones (voice) as Darth Vader: A former Jedi and Luke's father as well as the Emperor's disciple\n * Sebastian Shaw as Anakin Skywalker: The unmasked Vader who also appears as a Force spirit\n * Alec Guinness as Obi-Wan Kenobi: The deceased Jedi mentor of Luke who continues to guide him as a Force spirit\n * Toby Philpott, Mike Edmonds, David Barclay (puppeteers) and Larry Ward (voice) as Jabba the Hutt: A slug-like alien crime lord who purchased the carbonite-frozen Han from the bounty hunter Boba Fett\n\nThe cast also includes Michael Pennington as Moff Jerjerrod, Kenneth Colley as Admiral Piett, Michael Carter as Bib Fortuna (voiced by Erik Bauersfeld, who was uncredited), Denis Lawson as Wedge, Tim Rose as Admiral Ackbar (also voiced by Bauersfeld, again uncredited), Dermot Crowley as General Madine, Caroline Blakiston as Mon Mothma, Warwick Davis as Wicket W. Warrick, Tony Cox as Widdle 'Willy' Warrick, Jeremy Bulloch as Boba Fett, Femi Taylor as Oola, Annie Arbogast as Sy Snootles, Claire Davenport as Fat Dancer, Jack Purvis as Teebo, Mike Edmonds as Logray, Jane Busby as Chief Chirpa, Malcom Dixon and Mike Cottrell as Ewok Warriors, and Nicki Reade as Nicki. Additional Imperial officers are portrayed by Adam Bareham (Stardestroyer Controller #1), Jonathan Oliver (Stardestroyer Controller #2), Pip Miller (Stardestroyer Captain #1), and Tom Mannion (Stardestroyer Captain #2)."
    },
    {
      "title": "Development",
      "content": "Following discussions between Star Wars creator George Lucas and producer Howard Kazanjian, a sequel to The Empire Strikes Back was swiftly put into production. As with the previous film, Lucas personally financed Return of the Jedi. Lucas also chose not to direct the film himself, and started searching for a director. Irvin Kershner, who previously directed The Empire Strikes Back, declined to direct after spending two years working on the previous film, choosing to direct Never Say Never Again. Although Lucas's first choice was Steven Spielberg, their separate feuds with the Director's Guild led to him being banned from directing the film. Lucas approached David Lynch, who had recently been nominated for the Academy Award for Best Director for The Elephant Man in 1980, to helm Return of the Jedi. Lynch declined, saying that he had \"next door to zero interest\", believing Lucas should direct it since Star Wars was his creation.\n\nLucas also offered David Cronenberg the chance to direct, but he declined the offer as he did not want to work on material written by others. Lamont Johnson, director of The Last American Hero (1973), was also considered. Lucas eventually chose Richard Marquand. Lucas operated the second camera on set a few times. Lucas has admitted to being on the set frequently because of Marquand's relative inexperience with special effects. Lucas praised Marquand as a \"very nice person who worked well with actors\". Marquand did note that Lucas kept a conspicuous presence on set, joking, \"It is rather like trying to direct King Lear – with Shakespeare in the next room!\"\n\nThe screenplay was written by Lawrence Kasdan and Lucas (with uncredited contributions by David Peoples and Marquand), based on Lucas's story. Kasdan claims he told Lucas that Return of the Jedi was \"a weak title\". Kazanjian said the same, and the title was changed to Revenge of the Jedi one or two days later. The screenplay itself was not finished until rather late in pre-production, well after a production schedule and budget had been created by Kazanjian and Marquand had been hired, which was unusual for a film. Instead, the production team relied on Lucas's story and rough draft in order to commence work with the art department. When it came time to formally write a shooting script, Lucas, Kasdan, Marquand and Kazanjian spent two weeks in conference discussing ideas; Kasdan used tape transcripts of these meetings to then construct the script.\n\nThe question of whether Ford would return for the final film arose during pre-production. Unlike Hamill and Fisher, Ford had not contracted to do two sequels, and Raiders of the Lost Ark had made him an even bigger star. Kazanjian said that Han was frozen in carbonite in Empire because the filmmakers were unsure whether the character would return. He also claimed that Lucas did not expect Ford to return, and that Han was initially not in the script. However, Kazanjian—who also produced Raiders of the Lost Ark—convinced Ford to return.\n\nFord felt that Han should die through self-sacrifice in the third film. Kasdan agreed, and said it should occur near the beginning of the third act, to make the audience wonder whether the other protagonists will survive. Gary Kurtz, who produced Star Wars and Empire but was replaced by Kazanjian for Jedi, said that Han died in an early version of the script. Kurtz has suggested that one reason Lucas may have rejected the idea of Han dying was that it would not be good for merchandising. Kurtz also has claimed that an early script ended with the rebel forces in tatters, Leia grappling with her new duties as queen, and Luke walking off alone \"like Clint Eastwood in the spaghetti Westerns\".\n\nYoda was originally not meant to appear in the film, but Marquand strongly felt that returning to Dagobah was essential to resolve the dilemma raised by the previous film. The inclusion led Lucas to insert a scene in which Yoda confirms that Darth Vader is Luke's father because, after a discussion with a children's psychologist, he did not want younger moviegoers to dismiss Vader's claim as a lie. Many ideas from the original script were left out or changed. For instance, the Ewoks were going to be Wookiees and the Millennium Falcon was going to land on Endor. Following the defeat of the Emperor, the film was originally intended to end with Obi-Wan and Yoda returning to life from their spectral existence in the Force, along with Anakin Skywalker, thanks to Yoda being able to prevent him from becoming one with the Force. They would then join the rest of the characters in their celebration on Endor."
    },
    {
      "title": "Casting",
      "content": "Alan Webb was originally cast as the Emperor, but dropped out due to illness. Lindsay Anderson was offered the role, but turned it down due to scheduling conflicts. Ben Kingsley and David Suchet were also considered. Alan Rickman auditioned for the role of Moff Jerjerrod, but Michael Pennington was cast instead. Marquand initially wanted a famous actor such as Laurence Olivier or John Gielgud to play the unmasked Vader, but Lucas was concerned that such an actor would be distracting for audiences. Kenny Baker was originally cast as Wicket the Ewok, but he fell ill with food poisoning on the day of the shoot. He was replaced by Warwick Davis, who had no film acting experience."
    },
    {
      "title": "Filming",
      "content": "Filming began on January 11, 1982, and lasted through May 20, 1982, a schedule six weeks shorter than Empire. Kazanjian's schedule pushed shooting as early as possible in order to give Industrial Light & Magic (ILM) as much time as possible to work on effects, and left some crew members dubious of their ability to be fully prepared for the shoot. Working on a budget of $32.5 million, Lucas was determined to avoid going over budget as had happened with Empire. Kazanjian estimated that using ILM (owned wholly by Lucasfilm) for special effects saved the production approximately $18 million. However, the fact that Lucasfilm was a non-union company made acquiring shooting locations more difficult and more expensive, even though Star Wars and Empire had been big hits. The project was given the working title Blue Harvest with a tagline of \"Horror Beyond Imagination.\" This disguised what the production crew was really filming from fans and the press, and also prevented price gouging by service providers.\n\nThe first stage of production started with 78 days at Elstree Studios in England, where the film occupied all nine stages. The shoot commenced with a scene later deleted from the finished film where the heroes get caught in a sandstorm as they leave Tatooine. (This was the only major sequence cut from the film during editing.) For the rancor, Lucas wanted to use a stunt performer in a suit in the style of the Toho Godzilla films. The production team made several attempts, but were unable to create an adequate result. Lucas eventually relented and decided to film the rancor as a high-speed puppet.\n\nIn April, the crew moved to Arizona's Yuma Desert for two weeks of Tatooine exteriors. Production then moved to the redwood forests of northern California. Forested private land near Smith River and at the Chetham Grove section of Grizzly Creek Redwoods State Park were used for the forests of Endor. The crew spent two weeks shooting the Endor forest exteriors, and then concluded at ILM in San Rafael, California, for about ten days of bluescreen shots. One of two \"skeletal\" post-production units shooting background matte plates spent a day in Death Valley. The other was a special Steadicam unit shooting forest backgrounds from June 15 to June 17, 1982, for the speeder chase near the middle of the film. Steadicam inventor Garrett Brown personally filmed these shots at less than one frame per second. By walking at about 5 mi/h and projecting the footage at 24 frame/s, the motion seen in the film appeared as if it were moving at around 120 mi/h. Vader's funeral was filmed at Skywalker Ranch.\n\nMarquand and Anthony Daniels clashed somewhat, leading to the latter recording his ADR (dialogue overdubs) with Lucas instead. Carrie Fisher disliked working with Marquand, too; he often yelled at her, which caused her to burst into tears on one occasion, which ruined her makeup and required an hour-long redo."
    },
    {
      "title": "Post-production",
      "content": "Lucasfilm encountered problems when it tested the film in a commercial theater. Lucas and his employees could not hear many of the sound effects they had mixed. To make matters worse, the background noise in the theater muffled the majority of the film's sound, which played through the theater's normal commercial sound system. Many theaters at the time had poor room acoustics with mono sound. Lucas would solve the problem by creating a new cinema audio company, THX, and ensuring that all theaters playing his movies would use the new system.\n\nMeanwhile, special effects work at ILM quickly stretched the company to its operational limits. While the R&D work and experience gained from the previous two films in the trilogy allowed for increased efficiency, this was offset by the desire to have the closing film raise the bar set by each of these films. A compounding factor was the intention of several departments of ILM to either take on other film work or decrease staff during slow cycles. Instead, as soon as production began, the entire company found it necessary to remain running 20 hours a day on six-day weeks in order to meet their goals by April 1, 1983. Of about 900 special effects shots, all VistaVision optical effects remained in-house, since ILM was the only company capable of using the format, while about 400 4-perf opticals were subcontracted to outside effects houses. Progress on the opticals was severely delayed for a time when ILM rejected about 100000 ft of film when the film perforations failed image registration and steadiness tests."
    },
    {
      "title": "Music",
      "content": "John Williams composed the film's musical score and performed it with the London Symphony Orchestra. Orchestration credits also include Thomas Newman. The initial release of the film's soundtrack was on the RSO Records label in the United States. Sony Classical Records acquired the rights to the original trilogy scores in 2004 after gaining the rights to release the prequel trilogy soundtracks (The Phantom Menace and Attack of the Clones). In the same year, Sony Classical re-pressed the 1997 RCA Victor release of Return of the Jedi along with the other two films in the trilogy. The set was released with the new artwork mirroring the first DVD release of the film. Despite the Sony digital re-mastering, which minimally improved the sound heard only on high-end stereos, this 2004 release is essentially the same as the 1997 RCA Victor release."
    },
    {
      "title": "Release",
      "content": "Return of the Jedi was released on May 25, 1983. It was originally slated to open on May 27, but was subsequently changed to coincide with the date of the 1977 release of the original Star Wars film. With a massive worldwide marketing campaign, illustrator Tim Reamer created the image for the movie poster and other advertising. At the time of its release, the film was advertised on posters and merchandise as simply Star Wars: Return of the Jedi, despite its on-screen \"Episode VI\" distinction. The film was re-released in 1985."
    },
    {
      "title": "Title change",
      "content": "The original teaser trailer for the film carried the name Revenge of the Jedi. In December 1982, Lucas decided that \"Revenge\" was not appropriate as a 'true Jedi should never seek revenge' and returned to his original title. By that time thousands of \"Revenge\" teaser posters (with artwork by Drew Struzan) had been printed and distributed. Lucasfilm stopped the shipping of the posters and sold the remaining stock of 6,800 posters to Star Wars fan club members for $9.50. In 2005, Star Wars: Episode III – Revenge of the Sith, released as part of the prequel trilogy, alluded to the dismissed title Revenge of the Jedi."
    },
    {
      "title": "Box office",
      "content": "Return of the Jedi grossed $314.3 million in the United States and Canada, and $166 million in other territories, for a worldwide total of $480 million, against a production budget of about $32.5 million.\n\nReturn of the Jedi collected a total of $6.2 million on its opening day, beating out Star Trek II: The Wrath of Khan to have the highest single day gross. It would hold the record for having the highest pre-Memorial Day Wednesday gross until 1996 when Mission: Impossible surpassed it. The film made $23 million from 1,002 theaters in its opening weekend and grossed a record $45.3 million in its opening week. It set a new domestic opening weekend record, surpassing the $14 million opening of Star Trek II: The Wrath of Khan. Its $22,973 per theatre average would stand as a record for a nationwide release on an inflation-adjusted basis for 36 years until it was surpassed by Avengers: Endgame in 2019. It finished first at the box office for six of its first seven weeks of release, only coming in second once behind Superman III in its fourth weekend. Box Office Mojo estimates that the film sold over 80 million tickets in the US in its initial theatrical run. When it was re-released in 1985, it made $11.2 million, which totaled its initial theatrical gross to $385.8 million worldwide. During its re-release in 1997, the film grossed $16.29 million in its opening weekend. When it was re-released in 2023, for its 40th anniversary, the film grossed $5.1 million to place #4 in the weekend box office."
    },
    {
      "title": "Critical response",
      "content": "Film critic Roger Ebert gave Return of the Jedi four out of four stars, calling it \"a complete entertainment, a feast for the eyes and a delight for the fancy. It's a little amazing how Lucas and his associates keep topping themselves.\" Gene Siskel of the Chicago Tribune also gave the film four stars out of four and wrote, \"From the moment that the familiar Star Wars introductory words begin to crawl up the screen, Return of the Jedi is a childlike delight. It's the best video game around. And for the professional moviegoers, it is particularly enjoyable to watch every facet of filmmaking at its best.\"\n\nJames Harwood of Variety called the film \"a visual treat throughout,\" but thought that \"Hamill is not enough of a dramatic actor to carry the plot load here\" and Harrison Ford \"is present more in body than in spirit this time, given little to do but react to special effects. And it can't be said that either Carrie Fisher or Billy Dee Williams rise to previous efforts. But Lucas and director Richard Marquand have overwhelmed these performer flaws with a truly amazing array of creatures, old and new, plus the familiar space hardware.\" Sheila Benson of the Los Angeles Times wrote that the film \"is fully satisfying, it gives honest value to all the hopes of its believers. With this last of the central Star Wars cycle, there is the sense of the closing of a circle, of leaving behind real friends. It is accomplished with a weight and a new maturity that seem entirely fitting, yet the movie has lost none of its sense of fun; it bursts with new inventiveness.\"\n\nGary Arnold of The Washington Post said, \"Return of the Jedi, a feat of mass enchantment, puts the happy finishing touches on George Lucas' Star Wars saga. It was worth the wait, and the work is now an imposing landmark in contemporary popular culture—a three-part, 6¼-hour science-fiction epic of unabashed heroic proclivities.\" The film was also featured on the May 23, 1983, Time magazine cover issue (where it was labeled \"Star Wars III\"), where the reviewer Gerald Clarke said that while it was not as exciting as the first Star Wars film, it was \"better and more satisfying\" than The Empire Strikes Back, now considered by many as the best of the original trilogy.\n\nVincent Canby of The New York Times called Return of the Jedi \"by far the dimmest adventure of the lot\" and stated, \"The joys of watching space battles as envisioned by wizards in studios and laboratories are not inexhaustible.\" Pauline Kael of The New Yorker stated, \"Some of the trick effects might seem miraculous if the imagery had any lustre, but Return of the Jedi is an impersonal and rather junky piece of moviemaking.\"\n\nChristopher John reviewed The Return of the Jedi in Ares magazine #15 and commented that \"Star Wars may not be dead, but Return of the Jedi is a failure, and is a cheap and tarnished crown for the series which shook the world of film when it started out . . . a long time ago, in that galaxy far, far away.\"\n\nColin Greenland reviewed Return of the Jedi for Imagine magazine, and stated that \"You would think a series like Star Wars, fuelled by public adoration, coasting along on the hyperdrive of its own hyperboles, would get inexorably worse. It is not. It is getting better.\""
    },
    {
      "title": "Accolades",
      "content": "In 2021, the film was selected for preservation in the United States National Film Registry by the Library of Congress for being \"culturally, historically, or aesthetically significant\"."
    },
    {
      "title": "Re-releases",
      "content": "In 1997, for the 20th anniversary of the release of Star Wars (re-titled Episode IV: A New Hope), Lucas released the Star Wars Trilogy: Special Edition. Along with the two other films in the original trilogy, Return of the Jedi was rereleased on March 14, 1997 (moved up one week from its original announced release date of March 7 due to the box office success of The Empire Strikes Back the month prior), with a number of changes and additions, including the insertion of several alien band members and a different song in Jabba's throne room, the modification of the sarlacc to include a beak, the replacement of music at the closing scene, and a montage of different alien worlds celebrating the fall of the Empire. The runtime of the 1997 Special Edition of the film and all subsequent releases is approximately five minutes longer than the original theatrical version.\n\nThe film was re-released theatrically by 20th Century Studios on April 28, 2023, to commemorate the film's 40th anniversary."
    },
    {
      "title": "Home media",
      "content": "The original theatrical version of Return of the Jedi was released on VHS and Laserdisc several times between 1986 and 1995, followed by releases of the Special Edition in the same formats between 1997 and 2000. Some of these releases contained featurettes; some were individual releases of just this film, while others were boxed sets of all three original films.\n\nOn September 21, 2004, the original Star Wars trilogy was released in a boxset on DVD with digital restoration and additional alterations made by Lucas. In this version of Return of the Jedi, Sebastian Shaw's portrayal of Anakin's spirit is replaced by Hayden Christensen, who portrayed Anakin in Attack of the Clones and Revenge of the Sith. All three films of the trilogy were released individually on Limited Edition DVDs on September 12, 2006, with the original unaltered versions included as bonus features. These were collected in a box set on November 4, 2008.\n\nA Blu-ray Disc version of the six-film Star Wars saga was released by 20th Century Fox Home Entertainment in September 2011, which incorporated more small changes to Return of the Jedi, including making the Ewoks blink and having Vader yell \"No!\" as he throws the Emperor down the Death Star shaft; the latter change drew sharp negative criticism. Several deleted scenes from the film were included as special features, including a completed scene in which Vader communicates with Luke via the Force as Luke assembles his new lightsaber before infiltrating Jabba's palace, a sandstorm sequence following the sarlacc pit rescue, and a scene featuring Moff Jerjerrod and Death Star officers during the Battle of Endor.\n\nOn April 7, 2015, Walt Disney Studios, 20th Century Fox, and Lucasfilm jointly announced the digital releases of the six released Star Wars films. Return of the Jedi was released through the iTunes Store, Amazon Video, Vudu, Google Play, and Disney Movies Anywhere on April 10, 2015.\n\nWalt Disney Studios Home Entertainment reissued Return of the Jedi on Blu-ray, DVD, and digital download on September 22, 2019. Additionally, all six films were available for 4K HDR and Dolby Atmos streaming on Disney+ upon the service's launch on November 12, 2019. This version of the film was released by Disney on 4K Ultra HD Blu-ray box set on March 31, 2020."
    },
    {
      "title": "Legacy",
      "content": "According to the review aggregator website Rotten Tomatoes, 83% of critics have given the film a positive review with an average rating of 7.30/10, based on reviews from critics. The site's critics consensus reads: \"Though failing to reach the cinematic heights of its predecessors, Return of the Jedi remains an entertaining sci-fi adventure and a fitting end to the classic trilogy.\" At Metacritic, the film has a weighted average score of 58 out of 100 based on 24 reviews from mainstream critics, indicating \"mixed or average reviews\". Audiences polled by CinemaScore gave the film a rare average grade of \"A+\" on an A+ to F scale.\n\nIn his review of the 1997 Special Edition re-release, the film critic James Kendrick called Return of the Jedi the weakest of the three original films, saying it depended \"too much on the slick commercialism\" of the franchise but that it was still \"a magnificent experience in its own right\". James Berardinelli described it as the least enjoyable and least innovative film of the trilogy. He opined that the Special Edition was not saved by the alterations, but that it was nevertheless a \"must-see\" for fans as the conclusion of the trilogy.\n\nFans are divided on the likelihood of Ewoks (being a primitive race of small creatures) defeating an armed ground force comprising the Empire's \"best troops\". Lucas has defended the scenario, saying that the Ewoks' purpose was to distract the Imperial troops and they did not really win. His inspiration for the Ewoks' victory came from the Vietnam War, where the Viet Cong prevailed against the technologically superior United States."
    },
    {
      "title": "Novelization",
      "content": "The novelization of Return of the Jedi was written by James Kahn and was released on May 12, 1983, thirteen days before the film's release."
    },
    {
      "title": "Radio drama",
      "content": "A three-hour radio drama adaptation of the film was written by Brian Daley with additional material contributed by John Whitman and was produced for and broadcast on National Public Radio in 1996 (over a decade after the radio adaptations of the first two Star Wars films). It was based on characters and situations created by George Lucas and on the screenplay by Kasdan and Lucas. Anthony Daniels reprised his role from the film as C-3PO, but Mark Hamill and Billy Dee Williams (who lent their voices to the previous radio adaptations) were replaced by newcomer Joshua Fardon and character actor Arye Gross, respectively. Bernard Behrens and Brock Peters reprised their roles as Obi-Wan Kenobi and Darth Vader, respectively. John Lithgow voiced Yoda, and veteran character actor Ed Begley, Jr. played Boba Fett. Ed Asner voiced Jabba the Hutt, speaking only in grunts."
    },
    {
      "title": "Comic book adaptation",
      "content": "Marvel Comics published a comic book adaptation of the film by writer Archie Goodwin and artists Al Williamson, Carlos Garzon, Tom Palmer, and Ron Frenz. The adaptation appeared in Marvel Super Special #27 and as a four-issue limited series. It was later reprinted in a mass market paperback, as well as collections of Marvel's self-titled Star Wars series. Marvel Super Special #27 was mistakenly released in April 1983, a month before the film itself, giving away spoilers to the film's plot. Hamill is a comic book fan and while he was in a comic book store, he discovered that the comic book was on sale there and alerted Lucasfilm. According to Carol Kalish who was Marvel's direct sales manager at the time, Marvel quickly recalled the book upon learning this mistake though it did not stop the premature revelation of the secrets of the film's plot. Kalish kept her job, as did everyone else in the Sales Department, as the incident was apparently considered a simple mistake."
    },
    {
      "title": "Book-and-record set",
      "content": "Lucasfilm adapted the story for a children's book-and-record set. Released in 1983, the 24-page Star Wars: Return of the Jedi read-along book was accompanied by a 33⅓ rpm 7 in gramophone record. Each page of the book contained a cropped frame from the film with an abridged and condensed version of the story. The record was produced by Buena Vista Records."
    },
    {
      "title": "Prequels and sequels",
      "content": "16 years after the release of Return of the Jedi, Lucas wrote and directed the prequel trilogy, consisting of the films The Phantom Menace, Attack of the Clones, and Revenge of the Sith. The films chronicle the history between Obi-Wan Kenobi and Anakin Skywalker, and the latter's fall to the darkside and transformation into Darth Vader. The prequel trilogy was financially successful, and polarized critics and fans on their release for the storylines and some new characters.\n\nAfter Lucas sold the Star Wars franchise to the Walt Disney Company in 2012, Disney developed a sequel trilogy, consisting of The Force Awakens, The Last Jedi, and The Rise of Skywalker. Original trilogy cast members including Ford, Hamill, and Fisher reprised their roles, alongside new characters portrayed by Daisy Ridley, John Boyega, Adam Driver, and Oscar Isaac. Standalone films and television series have also been released, exploring adventures set around the main trilogy arcs. Most relevantly, the Disney+ streaming shows The Book of Boba Fett, Ahsoka, The Mandalorian and the latter's upcoming spin-offs are set a few years after Return of the Jedi, bridging the time period between that film and The Force Awakens."
    }
  ]
}