{
  "title": "Star Wars: Episode VII – The Force Awakens",
  "parentTitle": "Star Wars",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    }
  ],
  "content": "Star Wars: The Force Awakens (also known as Star Wars: Episode VII – The Force Awakens) is a 2015 American space opera epic film co-produced, co-written, and directed by J. J. Abrams. The sequel to Return of the Jedi (1983), it is chronologically the seventh film of the \"Skywalker Saga\". Set thirty years after Return of the Jedi, The Force Awakens follows Rey, Finn, Poe Dameron, and Han Solo's search for Luke Skywalker and their fight in the Resistance, led by General Leia Organa and veterans of the Rebel Alliance, against Kylo Ren and the First Order, a successor to the Galactic Empire. The film stars Harrison Ford, Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Lupita Nyong'o, Andy Serkis, Domhnall Gleeson, Anthony Daniels, Peter Mayhew, and Max von Sydow.\n\nWork on a seventh entry in the \"Skywalker Saga\" commenced after the Walt Disney Company's acquisition of Lucasfilm in 2012. The film is the first Star Wars film to not extensively involve franchise creator George Lucas, who only served as a creative consultant in the early stages of production. The Force Awakens was produced by Abrams, his longtime collaborator Bryan Burk, and Lucasfilm president Kathleen Kennedy. Abrams and Lawrence Kasdan, co-writer of the original trilogy films The Empire Strikes Back (1980) and Return of the Jedi, rewrote an initial script by Michael Arndt. John Williams, composer for the previous episodic films, returned to compose the score. Principal photography began in April 2014 and concluded the following November. Filming took place on sets at Pinewood Studios in England, and on location mainly in Abu Dhabi, Iceland, and Ireland. On a budget of $533 million, it is the most expensive film ever made.\n\nThe Force Awakens premiered in Hollywood, Los Angeles, on December 14, 2015, and was released in the United States on December 18. It was positively received by critics, who found it an action-packed film with the mix of new and familiar actors capturing the nostalgia of the original trilogy and giving the franchise new energy. The film grossed $2.07billion worldwide, breaking various box office records and becoming the highest-grossing film in the United States and Canada, the highest-grossing film of 2015, and the third-highest-grossing film at the time of its release. It was nominated for five awards at the 88th Academy Awards and received numerous other accolades. The film was followed by The Last Jedi (2017) and The Rise of Skywalker (2019), rounding out the Star Wars sequel trilogy.",
  "sections": [
    {
      "title": "Plot",
      "content": "Thirty years after the Battle of Endor, the First Order has risen from the fallen Galactic Empire and seeks to end the New Republic. The Resistance, led by General Leia Organa, opposes the First Order. Leia also searches for her missing twin brother, Luke Skywalker.\n\nOn the desert planet Jakku, Resistance pilot Poe Dameron receives a map to Luke's location. First Order stormtroopers commanded by Kylo Ren arrive and capture Poe. His droid, BB-8, escapes with the map and encounters Rey, a lone scavenger. Kylo tortures Poe using the Force and learns of BB-8. Stormtrooper FN-2187, disillusioned with the First Order, saves Poe, and they escape in a stolen TIE fighter. Upon learning that FN-2187 has no other name, Poe names him \"Finn\". As they head to Jakku to retrieve BB-8, a First Order Star Destroyer shoots them, and they crash-land. Finn survives and assumes Poe was killed after finding his jacket in the wreck. Finn encounters Rey and BB-8, but the First Order tracks them and launches an airstrike. Rey, Finn, and BB-8 steal the Millennium Falcon and escape Jakku.\n\nThe Falcon is discovered and boarded by Han Solo and Chewbacca. Gangs seeking to settle debts with Han attack, but the group escapes in the Falcon. At the First Order's Starkiller Base, a planet converted into a superweapon, Supreme Leader Snoke approves General Hux's request to use the weapon on the New Republic. Snoke questions Kylo's ability to deal with emotions surrounding his father, Han Solo, whom Kylo states means nothing to him.\n\nAboard the Falcon, Han determines that BB-8's map is incomplete. He then explains that Luke attempted to rebuild the Jedi Order but exiled himself when an apprentice turned to the dark side, destroyed Luke's temple, and slaughtered the other apprentices. The crew travels to the planet Takodana and meets with cantina owner Maz Kanata, who offers help getting BB-8 to the Resistance. The Force draws Rey to a secluded vault, where she finds Anakin Skywalker's lightsaber. She experiences disturbing visions, including a childhood memory of a ship leaving her on Jakku. Rey denies the lightsaber at Maz's offering and flees into the woods. Maz gives Finn the lightsaber for safekeeping.\n\nStarkiller Base destroys the Hosnian star system, including the New Republic capital Hosnian Prime, leaving the Resistance without support. The First Order attacks Takodana in search of BB-8. Han, Chewbacca, and Finn are saved by Resistance X-wing fighters led by Poe, who survived the crash. Leia arrives at Takodana with C-3PO and reunites with Han. Meanwhile, Kylo captures Rey, realizing she had seen the map, and takes her to Starkiller Base, but she resists his mind-reading attempts. Snoke orders Kylo to bring Rey to him. Discovering she can use the Force, Rey escapes using a Jedi mind trick on a stormtrooper guard.\n\nAt the Resistance base, BB-8 finds R2-D2, who had been in low-power mode since Luke's disappearance. As Starkiller Base prepares to fire again, the Resistance plans to destroy it by attacking its thermal oscillator. Using the Falcon, Han, Chewbacca, and Finn infiltrate the facility, find Rey, and plant explosives. Han confronts Kylo, calling him by his birth name, Ben, and implores him to abandon the dark side. Kylo seems to consider this, but he ultimately kills Han. Chewbacca shoots Kylo, injuring him, and sets off the explosives, allowing Poe to attack and destroy the base's thermal oscillator.\n\nKylo pursues Rey and Finn into the woods and incapacitates Rey. Finn uses the lightsaber to duel Kylo but is quickly defeated. Rey awakens, takes the lightsaber, and defeats Kylo in a duel. Snoke orders Hux to evacuate and bring Kylo to him to complete his training. Chewbacca saves Rey and the injured Finn, and they escape aboard the Falcon. As the Resistance forces flee, Starkiller Base implodes and erupts into a star. R2-D2 awakens and reveals the rest of the map, which points to the oceanic planet Ahch-To.\n\nRey, Chewbacca, and R2-D2 travel to Ahch-To on the Falcon. Rey finds Luke atop a cliff on a remote island and presents him with his lightsaber."
    },
    {
      "title": "Cast",
      "content": "\n\n\n * Harrison Ford as Han Solo: A smuggler and captain of the Millennium Falcon\n * Mark Hamill as Luke Skywalker: The last Jedi, who has gone into hiding\n * Carrie Fisher as General Leia Organa: A leader of the Resistance\n * Adam Driver as Kylo Ren: A leader of the Knights of Ren and a warlord of the First Order, who is the son of Han and Leia\n * Daisy Ridley as Rey: A Force-sensitive scavenger\n * Cailey Fleming as young Rey\n * John Boyega as Finn: A reformed First Order stormtrooper\n * Oscar Isaac as Poe Dameron: A high-ranking X-wing fighter pilot of the Resistance\n * Lupita Nyong'o as Maz Kanata: A centuries-old and perceptive alien who owns a castle on the peaceful forest planet Takodana\n * Andy Serkis as Supreme Leader Snoke: An enigmatic, genetically artificial leader of the First Order\n * Domhnall Gleeson as General Hux: The commander of the First Order's Starkiller Base\n * Anthony Daniels as C-3PO: A humanoid protocol droid\n * Peter Mayhew as Chewbacca: Han's loyal Wookiee friend and co-pilot\n * Joonas Suotamo and Ian Whyte served as body doubles for Mayhew as he suffered from health problems\n * Max von Sydow as Lor San Tekka: A galactic explorer searching for Luke Skywalker\n\nTim Rose and Mike Quinn reprise their respective roles as Admiral Ackbar and Nien Nunb from Return of the Jedi, with Erik Bauersfeld and Kipsang Rotich returning their respective voices. Kenny Baker, originally announced as part of the cast, was credited as \"consultant\" for R2-D2, with Jimmy Vee performing some of the work for R2-D2. Ewan McGregor has an uncredited vocal cameo as Obi-Wan Kenobi in Rey's vision sequence, while archival audio of Frank Oz and Alec Guinness as Yoda and Kenobi, respectively, are also used in the same scene; Oz recorded new dialogue for the film, but it was replaced with preexisting audio from The Empire Strikes Back. Star Wars: The Clone Wars voice actor James Arnold Taylor, who has voiced Obi-Wan Kenobi in different Star Wars media, originally recorded Kenobi's dialogue, but his recordings were replaced with McGregor's.\n\nGwendoline Christie portrays Captain Phasma, the commander of the First Order's legions of stormtroopers. Dave Chapman and Brian Herring served as puppeteers for BB-8, with Bill Hader and Ben Schwartz credited as \"Vocal Consultants\". Ken Leung appears as Statura, an admiral in the Resistance. Simon Pegg appears as Unkar Plutt, the Junk parts dealer on Jakku. Greg Grunberg plays Temmin \"Snap\" Wexley, an X-wing pilot. Kiran Shah plays Teedo, a scavenger on Jakku who rides a semi-mechanical Luggabeast. Jessica Henwick appears as Jess \"Testor\" Pava or Jess Testor, an X-wing pilot. Brian Vernel appears as Bala-Tik, the leader of the Guavian Death Gang. Yayan Ruhian and Iko Uwais appear as Tasu Leech and Razoo Qin-Fee, members of the Kanjiklub Gang, a criminal organization. Warwick Davis appears as Wollivan, a tavern-dweller in Maz Kanata's castle. Anna Brewster appears as Bazine Netal, a First Order spy, also at Maz Kanata's castle. Hannah John-Kamen appears as a First Order officer. Thomas Brodie-Sangster and Kate Fleetwood play First Order Petty Officers, Thanisson and Unamo, respectively. Billie Lourd, daughter of Carrie Fisher, appears as Connix, a lieutenant in the Resistance. Members of the Resistance include Emun Elliott as Brance and Maisie Richardson-Sellers as Korr Sella while Harriet Walter appears as Kalonia, the doctor who tends to Chewbacca. Mark Stanley appears as a Knight of Ren. Sebastian Armesto portrays Lieutenant Mitaka and Pip Torrens portrays Colonel Kaplan, both serving the First Order.\n\nDaniel Craig, Michael Giacchino, and Nigel Godrich cameo as stormtroopers. Abrams' assistant, Morgan Dameron, appears as a Resistance officer, while his father, Gerald W. Abrams, appears as Captain Cypress. Dialect coach Andrew Jack portrays Resistance Major Caluan Ematt. Additionally, Crystal Clarke, Pip Andersen, Christina Chong, Miltos Yerolemou, Amybeth Hargreaves, Leanne Best, Judah Friedlander, and Kevin Smith appear in minor roles. Riot control stormtrooper FN-2199, who calls Finn a traitor during the battle on Takodana, was portrayed by stunt performer Liang Yang and voiced by sound editor David Acord."
    },
    {
      "title": "Development",
      "content": "Star Wars creator George Lucas discussed ideas for a sequel trilogy several times after the conclusion of the original trilogy, but denied any intent to make it. A seventh entry in the \"Skywalker Saga\", a nine-part Star Wars series, began development shortly after Lucas sold his production company Lucasfilm to the Walt Disney Company in October 2012. Speaking alongside Lucasfilm's new president, Kathleen Kennedy, Lucas said: \"I always said I wasn't going to do any more and that's true, because I'm not going to do any more, but that doesn't mean I'm unwilling to turn it over to Kathy to do more.\"\n\nAs creative consultant on the film, Lucas attended early story meetings and advised on the details of the Star Wars universe. Among the materials he turned over to the production team were his rough story treatments for Episodes VII–IX, which Lucas requested be read only by Kennedy, Bob Iger, Alan F. Horn, and Kevin A. Mayer. Lucas later said Disney had discarded his story ideas and that he had no further involvement with the film. Lucas' son Jett told The Guardian that his father was \"very torn\" about having sold the rights to the franchise and that his father was \"there to guide\" but that \"he wants to let it go and become its new generation\".\n\nThe Force Awakens' first screenplay was written by Michael Arndt. At the time of his hiring, Arndt was also tapped to pen story treatments for the following installments. Arndt took part in a writers room with Simon Kinberg, Lawrence Kasdan, Pablo Hidalgo, and Kiri Hart to discuss and plan the overall trilogy. Early drafts had Luke Skywalker appear midway through the film, but Arndt found that \"every time Luke came in and entered the movie, he just took it over. Suddenly you didn't care about your main character anymore.\" The writers decided to use Luke as the film's MacGuffin and, as something that the protagonists needed to find, would not appear in person until the final scene. Arndt also developed some backstory elements for the returning characters from the original trilogy, such as how Leia was instrumental in rebuilding the Republic after the fall of the Empire before being discredited when it was publicly revealed that her biological father was Darth Vader (this would go on to become a central plot point in the canonical novel Star Wars: Bloodline).\n\nSeveral directors were considered, including David Fincher, Brad Bird, Jon Favreau, and Guillermo del Toro. Bird was reportedly the \"top choice\" to helm the film, but his commitments to Tomorrowland forced him to withdraw. Matthew Vaughn was an early candidate for the job, even dropping out of X-Men: Days of Future Past in favor for the film. Colin Trevorrow was also under consideration by the studio, while Ben Affleck and Neill Blomkamp passed on the project. After a suggestion by Steven Spielberg to Kennedy, J. J. Abrams was named director in January 2013, with Lawrence Kasdan and Simon Kinberg as project consultants. Kasdan worked to convince Abrams to direct the film after the filmmaker initially rejected the offer. Arndt worked on the script for eight months, but said he needed 18 more, which was more time than Disney or Abrams could give him. The production announced Arndt's exit from the project on October 24, 2013. That same day, Kasdan and Abrams took over script duties, both of whom planned the story while walking in Santa Monica, California, New York City, Paris, and London. The first draft was completed in six weeks. Abrams said the key to the film was that it return to the roots of the first Star Wars films and be based more on emotion than explanation. In January 2014, Abrams confirmed that the script was complete. In April 2014, Lucasfilm clarified that Episodes VII–IX would not feature storylines from the Star Wars expanded universe, though other elements could be included, as with the TV series Star Wars Rebels.\n\nAbrams stated that he purposely withheld some plot elements from The Force Awakens, such as Rey and Finn's last names and backgrounds. Kennedy admitted that \"we haven't mapped out every single detail [of the sequel trilogy] yet\", but said that Abrams was collaborating with The Last Jedi director Rian Johnson, and that Johnson would work with The Rise of Skywalker's then-director Colin Trevorrow to ensure a smooth transition and that \"everybody's got a say in how we move forward with this\". Daisy Ridley later recounted that J. J. Abrams had written drafts for episodes 8 and 9.\n\nA fictional language was developed for use in the film by YouTube star Sara Forsberg, who created the viral video series \"What Languages Sound Like To Foreigners\"; Forsberg developed the language by studying various languages, such as Hindi and Gujarati.\n\nIn November 2015, Lucas recorded an hour-long interview with CBS News reporter Charlie Rose in which he said Disney had not been \"keen\" to involve him and conceded: \"If I get in there, I'm just going to cause trouble because they're not going to do what I want them to do, and I don't have the control to do that any more, and all it would do is just muck everything up.\" He also said, \"They wanted to do a retro movie. I don't like that. Every movie, I worked very hard to make them different [...] I made them completely different—different planets, different spaceships to make it new.\" In early December 2015, Kathleen Kennedy told The Hollywood Reporter that Lucas had seen the movie and \"liked it\". In the same month, at the Kennedy Center Honors, Lucas stated, \"I think the fans are going to love it, It's very much the kind of movie they've been looking for.\" Abrams felt that, as the first in a new trilogy, the film \"needed to take a couple of steps backwards into very familiar terrain\" and use plot elements from previous Star Wars films."
    },
    {
      "title": "Pre-production",
      "content": "In May 2013, it was confirmed that The Force Awakens would be filmed in the United Kingdom. Representatives from Lucasfilm met with Chancellor of the Exchequer George Osborne to agree to produce The Force Awakens in the UK. Osborne committed £25 million of public money towards the film, claiming it was a boost for British culture and its film industry. According to production company account filings in the United Kingdom, The Force Awakens ultimately received a total of £31.6 million ($47.4 million) from the government.\n\nBeginning in September 2013, production spaces at the Bad Robot facility were converted for shooting of The Force Awakens for the benefit of shooting a minor portion of the film in the United States. The film's costume designer was Michael Kaplan, who had previously worked with Abrams on the films Star Trek (2009) and Star Trek Into Darkness (2013). Film editors Mary Jo Markey and Maryann Brandon, long-term collaborators with Abrams, were also signed. In August 2013, it was announced that cinematographer Daniel Mindel would be shooting the film on 35 mm film (specifically Kodak 5219). In October 2013, other crew members were confirmed, including sound designer Ben Burtt, director of photography Mindel, production designers Rick Carter and Darren Gilford, costume designer Michael Kaplan, special effects supervisor Chris Corbould, re-recording mixer Gary Rydstrom, supervising sound editor Matthew Wood, visual effects supervisors Roger Guyett, and executive producer Jason McGatlin."
    },
    {
      "title": "Casting",
      "content": "Open auditions were held in the United Kingdom and the United States in November 2013 for the roles of \"Rachel\" and \"Thomas\". Casting began in earnest in January 2014, because of changes to the script by Kasdan and Abrams. Screen tests with actors continued until at least three weeks before the official announcement in April 2014, with final casting decisions made only a few weeks earlier. Actors testing had strict nondisclosure agreements, preventing them, their agents or their publicists from commenting on their involvement. Though Lucas intimated that previous cast members Carrie Fisher, Harrison Ford, and Mark Hamill would return for the new film as early as March 2013, their casting was not confirmed until over a year later. Fisher returned as she was impressed with the pitch of the new trilogy.\n\nAbrams set out to have a more diverse cast than previous installments. A very early report claimed the studio wanted Ryan Gosling, Leonardo DiCaprio and Zac Efron for roles. In September 2013, Michael B. Jordan, Saoirse Ronan, and David Oyelowo were among the first to meet with the director. In January 2014, The Hollywood Reporter revealed Benedict Cumberbatch, Jack O'Connell, Chiwetel Ejiofor, Alex Pettyfer, Jesse Plemons, Sullivan Stapleton, Tye Sheridan, Hugo Weaving, Michael Fassbender, and Adam Driver all met with Abrams for the film. The role Sheridan met for was ultimately rewritten to be played by a 40 year old actor, while Weaving was in talks for an \"Imperial commander\". Ronan, Jordan, Frida Gustavsson, and later Miles Teller would go on to confirm their auditions for the film. Industry publications speculated that Plemons could possibly be playing Luke Skywalker's son. In February, Driver was in final negotiations for an unnamed villain, while Gary Oldman revealed he was approached for an undisclosed role. Driver was initially hesitant to take on the role of Kylo Ren as he was \"leery on big movies\" and felt characters get sacrificed to speculate, but the character's complicated nature led him to take it. In March, John Boyega, Plemons, Ray Fisher, Matthew James Thomas and Ed Speleers were Abrams' top choice for the lead role. Boyega began talks after dropping out of the Jesse Owens biopic Race. That same month, Lupita Nyong'o was said to have met also met with Abrams for the female lead. In April 2014, Plemons and Thomas were no longer in contention for the film. That same month, Maisie Richardson-Sellers, an \"unknown Oxford actress\", and Dev Patel were up for unknown roles. Ronan, Richardson-Sellers, Courtney Eaton, Eiza Gonzalez, Elizabeth Olsen and Jessica Henwick auditioned for Rey. Joseph David-Jones, Tom Holland, and Daryl McCormack were later reported to have auditioned for Finn while McCormack made it to the final round of auditions for the part. Eddie Redmayne and Joel Kinnaman tested for Kylo Ren.\n\nDaisy Ridley was cast by February 2014, and by the end of that month a deal had been worked out with Driver, who was able to work around his Girls schedule. Talks with Andy Serkis and Oscar Isaac began by March and continued into April. Denis Lawson, who played Wedge Antilles in the original trilogy, declined to reprise his role, saying it would have \"bored\" him.\n\nIn April, Ridley, Boyega, Isaac, Driver, Serkis, Domhnall Gleeson, and Max von Sydow were announced as part of the cast; while Ford, Hamill, Fisher, Anthony Daniels, Peter Mayhew, and Baker reprised their roles from the original trilogy. In June, cast additions Lupita Nyong'o and Gwendoline Christie were announced. To prepare for his role, Hamill was assigned a personal trainer and a nutritionist at the request of the producers, who wanted him to resemble an older Luke. Fisher was also assigned a personal trainer and a nutritionist, but she refused to lose weight. Abrams initially considered using Daniels only in a voice role for C-3PO, but Daniels opted to reprise the role physically as well; the production team built a new C-3PO costume to accommodate him. A flashback scene was cut from Rey's vision (following her discovery of Luke's lightsaber), which would have featured Robert Boulter standing in for Luke as he appeared in his duel with Vader in The Empire Strikes Back.\n\nIn May, Abrams announced a donation contest for UNICEF from the Star Wars set in Abu Dhabi; the winner was allowed to visit the set, meet members of the cast and appear in the film. In October, Warwick Davis, who played Wicket in Return of the Jedi, as well as Wald and Weazle in The Phantom Menace (1999), announced that he would appear in The Force Awakens, but did not reveal his role. In November, Debbie Reynolds confirmed that her granddaughter (Fisher's daughter), Billie Lourd, was in the film. Lourd first auditioned for the role of Rey prior to her casting."
    },
    {
      "title": "Filming",
      "content": "In February 2014, Abrams said filming would begin in May and last about three months. The official announcement came in March, when Disney and Lucasfilm announced that principal photography would commence in May and be based at Pinewood Studios in Buckinghamshire, England. That month, it was revealed that pre-production filming would take place in Iceland prior to the start of official filming in May, consisting of landscape shots that would be used for scenery in the film. In April, Walt Disney Studios chairman Alan Horn confirmed that filming had begun, filming in secret in the United Arab Emirates around Liwa Oasis, part of the emirate of Abu Dhabi, by a second unit. Later that month, it was revealed that in addition to 35 mm film, segments of the film were being shot in the 65 mm IMAX format. In July, Bad Robot reported that the film would be at least partially shot on IMAX cameras.\n\nPrincipal photography began in Abu Dhabi on May 16, 2014. The budget was initially estimated to be between $259 million and $306 million, but in 2023 financial accounts revealed the gross spend was $533 million and the net cost after tax breaks was $447 million. Abrams and the cast members went to Abu Dhabi in early May, where large sets were built on location—including a shuttle-like spacecraft, a large tower, and a big market—and where explosives were used to create a \"blast crater\". Cast members were spotted practicing driving vehicles that would be used during filming. Production moved to Pinewood Studios in June.\n\nThat same month, Harrison Ford fractured his leg while filming at Pinewood after a hydraulic door on the Millennium Falcon set fell on him, and was taken to a hospital. According to Abrams, Ford's ankle \"went to a 90-degree angle\". Production was suspended for two weeks because of Ford's injury. Ford's son Ben said the ankle would likely need a plate and screws and that filming could be altered slightly, with the crew needing to shoot Ford from the waist up for a short time until he recovered. A month later, Jake Steinfeld, Ford's personal trainer, said Ford was recovering rapidly. Abrams also suffered a fractured vertebra in his back when he was trying to help lift the door after Ford's accident, but he kept this to himself for over a month. In February 2016, it was reported that the Health and Safety Executive brought four criminal charges against Disney subsidiary Foodles Production (UK), Ltd. for alleged health and safety breaches relating to Ford's accident. Foodles Production (UK) Ltd was subsequently fined $1.95 million in October 2016 for two health and safety breaches, after admitting the counts at an earlier hearing.\n\nOn July 28, 2014, filming took place over three days at Skellig Michael, an island off the coast of County Kerry, Ireland, with a cast including Mark Hamill and Daisy Ridley. Landscape shots for the planet Takodana were shot in July in the Lake District in the northwest of England. Production was halted for two weeks in early August 2014 so Abrams could rework shooting in Ford's absence and resumed with a fully healed Ford in mid-August. In September, the former RAF Greenham Common military base in Berkshire was used and featured set constructions of several spaceships. Puzzlewood in the Forest of Dean Gloucestershire England was used for some scenes. Principal photography ended on November 3, 2014."
    },
    {
      "title": "Post-production",
      "content": "Kennedy said The Force Awakens would use real locations and models over computer-generated imagery. Johnson reiterated that Abrams would use little CGI and more practical, traditional special effects, saying: \"I think people are coming back around to [practical effects]. It feels like there is sort of that gravity pulling us back toward it. I think that more and more people are hitting kind of a critical mass in terms of the CG-driven action scene lending itself to a very specific type of action scene, where physics go out the window and it becomes so big so quick.\" Abrams' intention in prioritizing practical special effects was to recreate the visual realism and authenticity of the original Star Wars. To that end, the droid BB-8 was a physical prop developed by Disney Research, created by special effects artist Neal Scanlan and operated live on set with the actors. The Holochess sequence was created using stop-motion, which was supervised by Tippett Studio and overseen by Phil Tippett, who also worked on the stop-motion sequence in the original Star Wars film.\n\nIn February 2014, Industrial Light & Magic (ILM) announced plans to open a facility in London, citing Disney's Star Wars films as a catalyst for the expansion. ILM's Vancouver branch also worked on the special effects for the film. Abrams supervised post-production and editing of the film at Bad Robot's headquarters in Santa Monica. In August 2015, he gave the film's estimated running time of 124 minutes. Abrams made changes to the film's plot in the editing process to simplify the film, by removing some sequences shown in trailers: \"At one point, Maz used to continue along with the characters back to the Resistance base, but we realised that she really had nothing to do there of value [...] So we ended up leaving those things out.\" The final cut of the film runs for 138 minutes.\n\nOn November 6, 2014, the film's title was announced as Star Wars: The Force Awakens. In December 2015, Pablo Hidalgo, the creative executive at the Lucasfilm Story Group which handles all the canonical continuity for the Star Wars universe, revealed that the working title for the film was Shadow of the Empire \"for the longest time\"."
    },
    {
      "title": "Music",
      "content": "In July 2013, John Williams was confirmed to return to compose the sequel trilogy, beginning with The Force Awakens. He began working on the film in December 2014, and by June 2015 had been through most of the film reels, working on a daily basis. In May 2015, Williams said he would return to themes from the previous films, such as those for Luke, Leia, and Han, in ways that \"there are a few that I think are important and will seem very much a part of the fabric of the piece in a positive and constructive way.\" He said that working with Abrams was similar to the process he went through with Lucas in the earlier films.\n\nRecording sessions for The Force Awakens began in June 2015 at the Sony Pictures Studios' Barbra Streisand Scoring Stage in Culver City, with William Ross conducting most of the music. The first day of recording was June 1, 2015. Williams attended the sessions and conducted the remainder of the recordings in Los Angeles.\n\nThe score was recorded in 12 sessions within a five-month period between June and mid-November. The 90-piece orchestra recorded 175 minutes of music; however, Abrams re-edited the film, which discarded, modified, or re-recorded the score's part for nearly an hour. Williams' theme for Snoke was recorded by a 24-voice men's chorus. Gustavo Dudamel conducted the opening and end title music for the film at Williams' behest. Recording of the score was completed on November 14, 2015. The film's soundtrack was released by Walt Disney Records on December 18, 2015. Williams' score is more than two hours long.\n\nLin-Manuel Miranda and Abrams contributed music to the film's cantina scene. Abrams met Miranda at a performance of his Broadway musical Hamilton, where Miranda jokingly offered to compose cantina music, should it be needed. Unknown to Miranda, Williams had previously told Abrams that he did not want to compose the music for that scene, wanting to focus on the orchestral score. Abrams then contacted Miranda, and the two collaborated on the music for the scene over a period of two months."
    },
    {
      "title": "Promotion",
      "content": "Disney backed The Force Awakens with extensive marketing campaigns. Deadline Hollywood estimated the media value was $175 million; its costs alongside home media revenues had later risen to $423 million by The Guardian. On November 28, 2014, Lucasfilm released an 88-second teaser trailer. It was screened in selected cinemas across the United States and Canada and in theaters worldwide in December 2014. It was also released on YouTube and the iTunes Store, generating 58.2 million views on YouTube in its first week. Critics compared the brief footage favorably to the production values of the original trilogy. The Hollywood Reporter called the trailer \"perfectly potent nostalgia\", praising its mix of old and new. Empire was impressed by the continuity with the first films—\"the feel of classic Star Wars\"—but noted the absence of Hamill, Ford, and Fisher and speculated about the significance of the new characters. The Guardian wrote that the use of the Star Wars fanfare by John Williams reinforced brand loyalty among fans.\n\nOn December 11, 2014, Abrams and Kennedy released a series of eight mock Topps trading cards revealing the names of several characters. On April 16, 2015, a second teaser trailer, this one lasting two minutes, was shown at the opening panel at the Star Wars Celebration in Anaheim, California. Lucasfilm president Kathleen Kennedy said the reaction to the trailer was \"staggering [...] the entire room of almost eight thousand people just leapt to their feet and roared, I mean I can't think of anything I've ever been to—other than a rock concert—that felt quite like that\". The trailer was viewed over 88million times within the first 24 hours of release. The trailer shows many of the new characters and the first footage of Chewbacca and Han Solo. The Huffington Post's Graham Milne wrote that the trailer \"was an affirmation of something that we'd long been told was never going to happen. This was a gift. This was faith rewarded. About damn time.\"\n\nVanity Fair was the first magazine to release an exclusive cover issue devoted to The Force Awakens. The magazine, released on May 7, 2015, featured exclusive interviews and photos of the cast photographed by Annie Leibovitz. At the 2015 San Diego Comic-Con, in addition to a panel with many of the actors, a behind-the-scenes look at the film demonstrated the film's use of practical sets and effects. It was positively received, with Nigel M. Smith of The Guardian writing: \"The featurette's angle is a strong one and connects with fans of the original trilogy in an incredibly poignant way. It also does a sly job of teasing Fisher's new look as Leia and Simon Pegg's mysterious involvement as a rumored alien in the movie, without actually showing the actors in action.\" Smith compared the marketing strategy for the film to that of a previous Abrams film, Super 8, saying \"the promos [...] are notable for what they tease, not what they give away.\"\n\nWalt Disney Studios and Lucasfilm presented a look at The Force Awakens at Disney's D23 Expo in August 2015. Drew Struzan—who designed the poster artwork for the previous Star Wars films—produced a commemorative poster given to the event's attendees. In October 2015, Lucasfilm unveiled the theatrical release poster and a third trailer. The poster omitted Luke Skywalker and revealed a Death Star-like \"orb\". The trailer debuted during the halftime break of Monday Night Football, before being released online. The reaction to the trailer by fans on social media was \"frenzied\", with Lizo Mzimba of the BBC writing that \"perhaps the most significant thing about the final trailer before the film's release is how little of the story it reveals.\" Robbie Collin of The Daily Telegraph felt the trailer was \"a perfect blend of old and new, in keeping with the old-fashioned Star Wars aesthetic\". The trailer received 128million views in 24 hours. 16 million of the views came from its airing on Monday Night Football. At the end of October, Air France announced a \"Flight and Cinema\" package, providing customers who book select flights to Paris transportation to a theater to see the film, since France was one of the first countries to release the film. On November 23, a partnership with Google was announced, in which Google users could choose to affiliate themselves with either the Dark or Light Side, which would change the appearance of their Google websites. Additionally, Disney teamed up with Verizon to create a virtual-reality experience for Google Cardboard.\n\nOn December 17, 2015, select theaters across the United States and Canada aired a Star Wars marathon, airing the six previous Star Wars episode films in 2D, followed by The Force Awakens in 3D. Attendees received a special lanyard featuring exclusive marathon art."
    },
    {
      "title": "Tie-in literature and merchandise",
      "content": "Disney Publishing Worldwide and Lucasfilm announced a series of at least 20 books and comics, \"Journey to Star Wars: The Force Awakens\", which were released by multiple publishers starting in late 2015, prior to the film's premiere. The series includes books by Del Rey and Disney-Lucasfilm publishers and comic books from Marvel Comics. All titles under the program are canonical to the Star Wars universe. Alan Dean Foster wrote a novelization of The Force Awakens which was released in e-book form on December 18. In an effort to avoid revealing plot details before the film's release, the print release of the novelization was delayed until January 2016. Marvel Comics published a six-issue comic book adaptation of The Force Awakens between June and November 2016.\n\nDisney Consumer Products and Lucasfilm announced that September 4, 2015 would be deemed \"Force Friday\" and would be the official launch of all the merchandise for The Force Awakens. Beginning at 12:01 am, fans could buy toys, books, clothing and various other products at Disney Stores and other retailers throughout the world. Disney and Maker Studios hosted an 18-hour live-streaming presentation on YouTube, showcasing multiple merchandise products beginning on September 3, 2015. Among these products were a remote-controlled BB-8 developed by Sphero. Sphero had participated in a Disney-run startup accelerator in July 2014, where they were invited into a private meeting with Disney CEO Bob Iger, in which they were shown on-set photos and imagery of BB-8 before its public unveiling. Many retailers, such as Toys \"R\" Us, were unable to meet demand for Star Wars products due to the event."
    },
    {
      "title": "Video games",
      "content": "Select characters, scenes and locations from the film became part of other Star Wars video games: Characters from the film were added to an update to the mobile game Star Wars: Galaxy of Heroes, available for iOS and Android and released by Electronic Arts; free downloadable content for Electronic Arts' Star Wars Battlefront reboot allowed players to battle on the planet Jakku; an update to the mobile game Star Wars Commander, released by Disney Mobile for iOS, Android and the Windows Store, allowed players to battle on the planet Takodana during the Galactic Civil War era; and a condensed version of the film's plot becomes an add-on \"playset\" in the toys-to-life game Disney Infinity 3.0, with Finn, Rey, Poe Dameron, and Kylo Ren as playable characters. Eventually, the film got a full Lego video game adaptation, titled Lego Star Wars: The Force Awakens, which was released by Warner Bros. Interactive Entertainment on June 28, 2016."
    },
    {
      "title": "Theatrical",
      "content": "Star Wars: The Force Awakens premiered on December 14, 2015, at the TCL Chinese Theatre, El Capitan Theatre, and Dolby Theatre in Hollywood, Los Angeles. A white tent stretched along Hollywood Boulevard from Orange Drive to Highland Avenue, covering the \"massive\" premiere event that hosted more than five thousand guests. The film was originally scheduled for a mid-2015 release, but in November 2013, it was pushed back to December 18, 2015. It was also released in 3D, RealD 3D and IMAX 3D formats.\n\nIn the United States and Canada, it had the widest release of December across 4,134 theaters, of which 3,300 were 3D locations, a record 392 IMAX screens (13 of which were 70mm), 451 premium large format screens, 146 D-Box locations, as well as releasing in the Dolby Vision format (high-dynamic range, Rec. 2020 color) in Dolby Cinema. Worldwide, it was released across 940 IMAX theaters, a new record. On December 18, 2015, the film began playing on every IMAX screen in the United States and Canada for four straight weeks up to January 14, 2016. This made it the first film since Warner Bros.' The Hobbit trilogy to receive such a release. The film finally shed some of its IMAX screens with the release of The Revenant (2015) and The Finest Hours (2016) in mid-January 2016.\n\nAdvance ticket sales for the film began on October 19, 2015, and were in strong demand, resulting in online movie ticket sites crashing. Vue Cinemas, the United Kingdom's third-largest theater chain, sold 45,000 tickets in 24 hours, 10,000 of which were sold in 90 minutes, a record for the theater. In the United States, the film pre-sold a record-breaking $6.5 million worth of IMAX ticket sales on a single day. IMAX has never previously registered more than $1 million in pre-sales on a single day. In total, it sold over $50 million in pre-sales, breaking the record. This number was raised to $100 million including $50–60 million in advance ticket sales by December 14. However, not all tickets that were pre-sold were for the film's opening weekend, with Fandango President Paul Yanover saying \"people have set aside tickets for screenings in January, weeks after the big opening [...] We have people buying Star Wars [The Force Awakens] into 2016. It's not just an opening-weekend phenomenon.\" Similarly, the film broke pre-sales records in the UK, Canada, and Germany.\n\nThe Force Awakens is the first live-action Star Wars film not to be released theatrically by 20th Century Fox; accordingly the film is not introduced with either that company's logo, or its signature fanfare composed by Alfred Newman. Instead, the film is the first in the series to be distributed by Walt Disney Studios Motion Pictures, and the film is presented with only Lucasfilm's production logo shown silently before the main titles. Disney chairman Bob Iger explained that the decision not to place Disney branding on the film was \"for the fans\".\n\nA poster from mainland China was criticized for being racist due to shrinking the size of the Black character Finn compared to non-Chinese posters."
    },
    {
      "title": "Home media",
      "content": "Walt Disney Studios Home Entertainment released Star Wars: The Force Awakens through digital download and Disney Movies Anywhere on April 1, 2016, and on Blu-ray and DVD on April 5. Physical copies include behind-the-scenes featurettes, deleted scenes, interviews, and additional footage with eight bonus features. In its first week, The Force Awakens sold 669,318 DVDs and 3.4million Blu-rays as the most sold film on both formats in the United States. That same week, The Force Awakens topped the Nielsen VideoScan First Alert chart, which tracks overall disc sales, as well as the dedicated Blu-ray sales chart with 83% of unit sales coming from Blu-ray. Overall, The Force Awakens sold 2.1million DVDs and 5.9million Blu-rays, adding them up to get a total of 8million copies, and made $191million through home media releases.\n\nA Blu-ray 3D \"collector's edition\" of the film was released on November 15, including all the features of the original home releases, as well as several new bonus features, including new deleted scenes and audio commentary by director J. J. Abrams. The package includes a Blu-ray 3D, regular Blu-ray, DVD, and digital copy of the film, as well as an additional Blu-ray disc for the bonus features.\n\nThe movie was rereleased on DVD in 2019 as part of the 9-disc \"Skywalker Saga\" boxed set. It received a 4K Ultra HD Blu-ray release on March 31, 2020. This 4K release was then included in the 27-disc Skywalker Saga box set on April 20, 2020."
    },
    {
      "title": "Broadcast syndication",
      "content": "The premium cable network Starz had U.S. broadcast syndication rights for The Force Awakens in January 2016, just before the end of Starz's output deal covering most Disney films through 2015. That September, The Force Awakens began broadcasting on all Starz networks."
    },
    {
      "title": "Box office",
      "content": "Star Wars: The Force Awakens grossed $936.7million in the United States and Canada and $1.132billion in other countries for a worldwide total of $2.07billion, making it the highest-grossing film of 2015 and the third highest-grossing film of all time. Box Office Mojo estimates that the film sold close to 110million tickets in the United States and Canada. The Force Awakens earned 8.6% of the total 2015 releases in the United States and Canada, second only to the 8.8% of the box office earned by Titanic in 1997. It was the 24th film in cinematic history to gross $1 billion worldwide, standing as the fastest film to surpass the mark at the time, doing so in 12 days. It was also the third film in history to surpass $2 billion worldwide, doing so on its 53rd day of release. Deadline Hollywood calculated the film's net profit as $780.1 million, accounting for production budgets, marketing, talent participations, and other costs; box office grosses and home media revenues placed it first on their list of 2015's \"Most Valuable Blockbusters\"."
    },
    {
      "title": "Commercial analysis",
      "content": "Analysts said that the box office receipts of the film, when compared to predecessors, must be adjusted for inflation, and that the first Star Wars film made more when this adjustment is made. It has further been observed that each of the first three films in the series was more profitable in calculating revenue against production costs.\n\nWhile The Force Awakens was very successful in the United States and Canada, the same success was not witnessed in many overseas individual markets such as India, other certain parts of Asia and Latin America. This was attributed to it being \"a retro film\" and how overseas audiences do not have the same nostalgia or affinity for the film as those in North America. The Star Wars franchise has traditionally lacked resonance with filmgoers in China, and marketing for The Force Awakens heavily focused on appealing to that market.\n\nNancy Tartaglione of Deadline Hollywood argued that, if accounting for its 40/60 domestic to international split, The Force Awakens did well overseas. While the film had special effects, analysts felt that it lacked the novelty factor; they also stated that its gross was stilted due to markets making way for new films sooner than was previously done. Dergarabedian stated, \"No matter what, [The Force Awakens] is an absolute, all-out blockbuster without peer in terms of the sheer speed at which it has crossed all of these major box-office milestones.\" Moreover, Mike Fleming Jr. of Deadline Hollywood argued that the movie was the \"most valuable movie\" of the year, with \"the net profit to Disney was an astounding $780.11M, and the Cash on Cash Return was twice that of any other film [released in 2016], at 2.00\"."
    },
    {
      "title": "United States and Canada",
      "content": "In the United States and Canada, The Force Awakens was released on December 18, 2015. It made a record-breaking $57 million from Thursday night previews, of which IMAX screenings generated a record-breaking $5.7 million from 391 screens. On its opening day, the film grossed $119.1 million, marking the biggest single- and opening-day record and the first time a film has earned more than $100 million in a single day. Without Thursday-night grosses, the film earned the second-largest opening-day gross and a record of $247.9 million for its opening weekend. The debut was 19% bigger than the previous record holders The Avengers (2012) ($207 million) and Jurassic World (2015) ($208 million). The opening weekend figure included an IMAX opening-weekend record of $30.1 million (12.65%) from 391 IMAX theaters, which nearly amounts to the $252.5 million total earned by Return of the Jedi—the second-lowest-grossing film in the series—in its original run. 2D screenings accounted for 53% of the total opening gross while 3D accounted for 47%. RealD 3D comprised $78 million of the opening gross, setting a new record. At that time, the film had the biggest December opening weekend, breaking the previous record held by The Hobbit: An Unexpected Journey (2012). It would hold this record until it was surpassed by Spider-Man: No Way Home (2021) six years later. Revenues in the film's second weekend decreased by only 39.8% in the United States and Canada, earning $149.2 million, to remain in first place at the box office and recording the biggest second weekend of all time.\n\nOn January 2, after just 16 days of release, it became the second film (following Avatar) to gross over $700 million in the United States and Canada, and on January 6 became the highest-grossing film of all time domestically, doing so in 20 days. On January 9, it became the first film in cinematic history to cross $800 million domestically unadjusted for inflation. On February 5, The Force Awakens became the first film to earn over $900 million, unadjusted for inflation, in the United States and Canada. The film fell outside of the top ten for the first time in its eleventh weekend during the weekend February 26–28, 2016, and did not achieve $1 million in ticket sales for the first time in its fourteenth weekend."
    },
    {
      "title": "Other territories",
      "content": "Internationally, the film was released in over 30,000 screens. It opened on December 16, 2015, in 12 international markets and earned $14.1 million on its opening day, debuting at first place in all of them. It expanded in an additional 42 countries on December 17, generating $58.6 million for a two-day international total of $72.7 million, reaching first place in all 44 markets. It grossed a total of $129.5 million in three days after adding $56.8 million on its third day, and set a new midnight record in the United Kingdom with $3.6 million. It broke opening-day records in the United Kingdom ($14.4 million), Germany ($7.1 million), Australia ($6.8 million), Sweden ($1.7 million), Norway ($1.1 million), and in 12 other countries. Other markets which generated large opening days were Spain ($3.5 million) and Japan ($3 million). After the five days, The Force Awakens had a total international opening gross of $281 million from 30,000 screens, a new record for December opening and the third-biggest international opening of all time. International markets generating opening-weekend tallies of at least $10 million were the United Kingdom ($50.6 million), Germany ($27.5 million), France ($22.5 million), Australia ($19.6 million), Japan ($13.4 million), and Russia ($12.3 million). The film had the biggest opening of all time in 18 countries including the United Kingdom, Germany, Australia, Russia, and Sweden.\n\nAfter five days, the film had a total worldwide opening record of $529 million from 74 territories, which was the biggest worldwide opening at that time, making it only the second time in cinematic history—after Jurassic World—that a film had opened to more than $500 million globally. This included an IMAX opening record of $48 million. Revenues from IMAX dipped slightly, generating $19 million in its second weekend, for a record total of over $70 million in 11 days. IMAX generated $17.9 million from 276 IMAX theaters. The film had a steeper decline in its second weekend, falling 51% to $136.9 million. The film had an unsuccessful opening in India where it opened third against two local blockbusters with a mere $1.51 million. As of February 2016, the highest-grossing markets outside of the United States and Canada were the United Kingdom ($180.7 million), China ($124.5 million), Germany ($109.7 million), Japan ($92.6 million), and France ($88.2 million). On January 17, 2016, it passed the $1 billion mark overseas becoming the first film of Disney, the third film of 2015 and the fifth film overall to achieve this feat. It topped the international box office chart for five consecutive weekends, becoming the first film since Avengers: Age of Ultron (2015) to have five straight wins, before being dethroned by The Revenant in its sixth weekend. In Japan, it topped the box office for six straight weekends."
    },
    {
      "title": "Critical response",
      "content": "Star Wars: The Force Awakens received overwhelmingly positive reviews from critics.<ref name=\"ReceptionBundle\">Multiple sources:\n * On the review aggregator website Rotten Tomatoes, of  critics' reviews are positive, with an average rating of . The website's consensus reads, \"Packed with action and populated by both familiar faces and fresh blood, The Force Awakens successfully recalls the series' former glory while injecting it with renewed energy\".  Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale; women, and people under the ages of 25 and 18 gave it an \"A+\", while 98% of audiences gave it either an \"A\" or a \"B\". Audiences polled by PostTrak gave the film an 88% \"definite recommend\" while 96% said it met or exceeded their expectations.\n * On the review aggregator website Rotten Tomatoes, of  critics' reviews are positive, with an average rating of . The website's consensus reads, \"Packed with action and populated by both familiar faces and fresh blood, The Force Awakens successfully recalls the series' former glory while injecting it with renewed energy\".  Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale; women, and people under the ages of 25 and 18 gave it an \"A+\", while 98% of audiences gave it either an \"A\" or a \"B\". Audiences polled by PostTrak gave the film an 88% \"definite recommend\" while 96% said it met or exceeded their expectations.\n * On the review aggregator website Rotten Tomatoes, of  critics' reviews are positive, with an average rating of . The website's consensus reads, \"Packed with action and populated by both familiar faces and fresh blood, The Force Awakens successfully recalls the series' former glory while injecting it with renewed energy\".  Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale; women, and people under the ages of 25 and 18 gave it an \"A+\", while 98% of audiences gave it either an \"A\" or a \"B\". Audiences polled by PostTrak gave the film an 88% \"definite recommend\" while 96% said it met or exceeded their expectations.\n * On the review aggregator website Rotten Tomatoes, of  critics' reviews are positive, with an average rating of . The website's consensus reads, \"Packed with action and populated by both familiar faces and fresh blood, The Force Awakens successfully recalls the series' former glory while injecting it with renewed energy\".  Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale; women, and people under the ages of 25 and 18 gave it an \"A+\", while 98% of audiences gave it either an \"A\" or a \"B\". Audiences polled by PostTrak gave the film an 88% \"definite recommend\" while 96% said it met or exceeded their expectations.\n\nRobbie Collin of The Daily Telegraph said the film \"sets out to shake Star Wars from its slumber, and reconnect the series with its much-pined-for past\", and \"it achieves this both immediately and joyously is perhaps the single greatest relief of the movie-going year.\" Peter Bradshaw of The Guardian said that it was \"both a narrative progression from the earlier three films and a shrewdly affectionate next-gen reboot\", and it was \"ridiculous and melodramatic and sentimental, but exciting and brimming with energy and its own kind of generosity.\" Variety's Justin Chang wrote that the film has \"sufficient style, momentum, love, and care to prove irresistible to any who have ever considered themselves fans.\" Richard Roeper of the Chicago Sun-Times described it as \"a beautiful, thrilling, joyous, surprising, and heart-thumping adventure\". Ann Hornaday, writing for The Washington Post, thought the film had \"enough novelty to create yet another cohort of die-hard fans\", and the film struck \"all the right chords, emotional, and narrative, to feel both familiar and exhilaratingly new.\" The Charlotte Observer's Lawrence Toppman said Abrams had \"pulled off a delicate balancing act, paying clever homage to the past.\" Mick LaSalle of the San Francisco Chronicle gave the film his highest rating and called it \"the best Star Wars sequel yet and one of the best films of 2015\". Frank Pallotta, reviewing the film for CNN Business, found it was the best Star Wars film since the original trilogy and that it \"is bound to be a film experience long remembered by fans and non-fans alike\".\n\nTom Long of The Detroit News wrote that though some may find the film too similar to the original Star Wars, it leaves \"the ungainly and unneeded clumsiness of the subsequent prequels far behind\", and \"the energy, humor, and simplicity of direction [has] been recaptured\". The Tribune-Star called it \"basically the same\" as the original film but \"isn't that what we all wanted anyway?\" Stephanie Zacharek of Time wrote that Abrams had delivered \"everything we expect, as opposed to those nebulous wonders we didn't know we wanted\". Reviewing for Forbes, Scott Mendelson cited the film's \"top-tier production values and a strong sense of scale and scope\", but felt it was so much \"an exercise in fan service [that] it is only due to the charisma and talent of our newbies and J. J. Abrams' undeniable skill as a visual storyteller that the Mad Libs narrative doesn't outright destroy the picture.\" Brian Merchant of Motherboard said that the film \"is supposed to be all about exploring the unexplored, not rehashing the well-trod\", and that \"one of the most unabashedly creative enterprises of the 20th century has been rendered another largely enjoyable, but mostly forgettable Hollywood reboot.\" RogerEbert.com's Gerardo Valero said the movie \"plagiarized\" A New Hope and resorted to nostalgia. He felt that it \"didn't [justify] a return to the universe\" from not having an original story of its own to tell in the plot, characters, and musical score, negatively comparing it to George Lucas' prequel trilogy, and that some of its climactic moments felt unearned."
    },
    {
      "title": "From George Lucas",
      "content": "In an interview with Charlie Rose that aired on December 24, 2015, Lucas likened his decision to sell Lucasfilm to Disney to a \"divorce\" and outlined the creative differences between him and the producers of The Force Awakens. Lucas described the previous Star Wars films as his \"children\" and criticized the \"retro feel\" of The Force Awakens, saying: \"I worked very hard to make [my films] completely different, with different planets, with different spaceships—you know, to make it new.\" Lucas also likened Disney to \"white slavers\", which drew some criticism; he subsequently apologized. In a 2019 memoir, Disney chairman Bob Iger said that Lucas \"couldn't even hide his disappointment\" towards Abrams' interpretation. According to Iger, Lucas said, \"there's nothing new\" after seeing the film, and that \"there weren't enough visual or technical leaps forward\". Lucas preferred Rian Johnson's sequel The Last Jedi and the anthology film Rogue One (2016)."
    },
    {
      "title": "Accolades",
      "content": "Several awards held their nominations before the December release of The Force Awakens, making the film ineligible for the 73rd Golden Globe Awards and some other awards ceremonies. However, the film was added to the 21st Critics' Choice Awards' slate of best picture nominees after a special vote by the board of directors, and the announcement of the 2015 American Film Institute Awards was delayed until after the release of The Force Awakens, where it was named one of the top-ten films of 2015.\n\nAt the 88th Academy Awards, The Force Awakens received nominations for Best Film Editing, Best Original Score, Best Sound Editing, Best Sound Mixing, and Best Visual Effects. The film's other nominations include four British Academy Film Awards (winning one) and a Critics' Choice Movie Award."
    },
    {
      "title": "Fan backlash",
      "content": "The release of the first film trailer for The Force Awakens in 2015 spurred a racial backlash against the casting of Boyega, a Black British actor, in such a prominent role. Some social media users called for a boycott of the film, which they accused of being \"anti-white\" and of promoting \"white genocide\". One such account promoted the Cultural Marxism conspiracy theory. The character of Rey was also criticized as a too-perfect \"Mary Sue\" character by a group of fans who became known as the \"Fandom Menace\", who focused their ire at Lucasfilm president Kathleen Kennedy, whom they accused of spoiling the film franchise by including \"forced diversity\" and pro-feminist politics."
    },
    {
      "title": "Sequels",
      "content": "The Force Awakens was followed by the sequels The Last Jedi and The Rise of Skywalker, which conclude the sequel trilogy. Both grossed over $1billion, ranking among the highest-grossing films of the year. The Last Jedi garnered positive reviews from critics while The Rise of Skywalker received a mixed response."
    }
  ]
}