{
  "title": "Star Wars: Episode IX – The Rise of Skywalker",
  "parentTitle": "Star Wars",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    }
  ],
  "content": "Star Wars: The Rise of Skywalker (also known as Star Wars: Episode IX – The Rise of Skywalker) is a 2019 American epic space opera film produced, co-written, and directed by J. J. Abrams. Produced by Lucasfilm and Abrams's production company Bad Robot, and distributed by Walt Disney Studios Motion Pictures, it is the third installment of the Star Wars sequel trilogy, following The Force Awakens (2015) and The Last Jedi (2017), and the final episode of the nine-part \"Skywalker saga\". Its cast includes Carrie Fisher, Mark Hamill, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Anthony Daniels, Naomi Ackie, Domhnall Gleeson, Richard E. Grant, Lupita Nyong'o, Keri Russell, Joonas Suotamo, Kelly Marie Tran, Ian McDiarmid, and Billy Dee Williams. Set after The Last Jedi, The Rise of Skywalker follows Rey, Finn, and Poe Dameron as they lead the remnants of the Resistance in a final stand against Supreme Leader Kylo Ren and the First Order, who are allied by the resurrected Sith Lord, Emperor Palpatine.\n\nFollowing initial reports that The Last Jedi director Rian Johnson would write the script for Episode IX, in August 2015, Colin Trevorrow was hired to direct and to write a script with his collaborator Derek Connolly; both ultimately retain story credit with Abrams and Chris Terrio. In September 2017, Trevorrow left the project following creative differences with producer Kathleen Kennedy, and Abrams returned as director. John Williams, composer for the previous episodic films, returned to compose the score—his final score for the franchise. Principal photography began in August 2018 at Pinewood Studios in England and wrapped in February 2019, with post-production completed in November 2019. With a budget of $416 million, it is the third most expensive film ever made.\n\nThe Rise of Skywalker premiered in Hollywood, Los Angeles, on December 16, 2019, and was released in the United States on December 20. It received mixed reviews from critics, and grossed $1.077 billion worldwide, making it the seventh-highest-grossing film of 2019, but the lowest-grossing of the trilogy. It received three nominations at the 92nd Academy Awards (Best Original Score, Best Visual Effects, and Best Sound Editing) as well as three at the 73rd British Academy Film Awards (also Best Special Visual Effects, Best Original Music, and Best Sound). It won five awards at the 46th Saturn Awards, including Best Science Fiction Film.",
  "sections": [
    {
      "title": "Plot",
      "content": "One year after the Battle of Crait, Kylo Ren obtains a Sith wayfinder on the planet Mustafar that leads him to the hidden planet Exegol. There, he finds a resurrected Emperor Palpatine, who reveals himself as the power behind Snoke and the First Order. Palpatine unveils a Sith armada of Star Destroyers and offers it to Kylo if he finds and kills Rey, who is continuing her Jedi training under Resistance leader Leia Organa. Poe Dameron and Finn deliver intelligence from a spy in the First Order that Palpatine is on Exegol; Rey reads in Luke Skywalker's notes that a Sith wayfinder can lead them there. Rey, Finn, Poe, Chewbacca, BB-8, and C-3PO depart in the Millennium Falcon to the desert planet Pasaana, where a clue to a wayfinder is hidden.\n\nKylo initiates a Force bond with Rey to discover her location. He travels to Pasaana with his warrior subordinates, the Knights of Ren. With Lando Calrissian's help, Rey and her friends find the clue—a dagger inscribed with Sith text, which C-3PO's programming forbids him from interpreting—and the remains of a Sith assassin named Ochi and his ship, which Rey recognizes. Rey senses Kylo nearby and faces him while the First Order captures the Falcon, Chewbacca, and the dagger. Attempting to save Chewbacca, Rey accidentally destroys a First Order transport with Force lightning. Believing Chewbacca is dead, the group escapes on Ochi's ship.\n\nThey travel to Kijimi, where the droidsmith Babu Frik extracts the Sith text from C-3PO's memory, revealing the wayfinder's coordinates. Rey senses Chewbacca is alive aboard a First Order Star Destroyer, so the group stages a rescue with the smuggler Zorii's help. Rey recovers the dagger and experiences repressed memories of her parents. She duels Kylo, who reveals that Palpatine is her paternal grandfather. Foreseeing her power, Palpatine had ordered Ochi to find the young Rey, but her parents hid her on Jakku, prompting Ochi to kill them with the dagger. To spite Kylo, General Hux saves Poe, Finn, and Chewbacca from execution, revealing himself as the spy. Rey and her friends escape, while Hux is executed by Allegiant General Pryde. The group flies the Falcon to the wayfinder's coordinates on a moon in the Endor system.\n\nThere, they find renegade stormtroopers led by Jannah, whom they recruit to the Resistance. Rey retrieves the wayfinder from the wreckage of the second Death Star, but she is met by Kylo, who destroys the wayfinder and duels her. In a dying act, Leia distracts Kylo through the Force, and Rey impales him. Sensing Leia's death and overcome by guilt, Rey heals Kylo and takes his TIE fighter to exile herself on Ahch-To. Meanwhile, Kylo converses with a memory of his father, Han Solo. He discards his lightsaber and reclaims his identity as Ben Solo. Palpatine deploys the Sith fleet to draw Rey out and sends a Sith Star Destroyer to destroy Kijimi. On Ahch-To, Luke's Force spirit encourages Rey to face Palpatine and gives her Leia's lightsaber. Rey leaves for Exegol in Luke's X-wing fighter, using the wayfinder from Ben's ship.\n\nRey transmits her coordinates to R2-D2, allowing the Resistance, now led by Poe and Finn, to follow her to Exegol. There, she confronts Palpatine. Debilitated, he demands that she kill him in anger so his spirit can possess her body. The Resistance attacks the Sith fleet, while Ben overpowers the Knights of Ren and joins Rey. Palpatine senses their power as \"a dyad in the Force\" and drains it to rejuvenate his body. Lando arrives with reinforcements from across the galaxy, including Babu and Zorii. Palpatine incapacitates Ben and attacks the Resistance fleet with Force lightning. Weakened, Rey hears the voices of past Jedi, who give her strength. Palpatine attacks her with lightning, but Rey deflects it using Luke and Leia's lightsabers, destroying him before dying herself. Ben uses the Force to revive Rey, sacrificing himself, and they kiss before he dies. The Resistance destroys the remaining Sith forces, while people across the galaxy rise up against the First Order.\n\nThe Resistance celebrates their victory. Rey visits Luke's abandoned homestead on Tatooine and buries Luke and Leia's lightsabers. A passerby asks her name; seeing Luke and Leia's Force spirits nearby, she responds, \"Rey Skywalker\"."
    },
    {
      "title": "Cast",
      "content": "\n * Carrie Fisher as Leia Organa, the Force-sensitive leading general of the Resistance. She is Ben Solo's mother, Luke Skywalker's twin sister, and the daughter of Anakin Skywalker and Padmé Amidala. Fisher, who died in December 2016, appears through the use of repurposed unreleased footage from The Force Awakens.\n * Mark Hamill as Luke Skywalke r, the last Jedi Master, who became one with the Force in The Last Jedi.\n * Adam Driver as Kylo Ren (Ben Solo), the Supreme Leader of the First Order, who shares a powerful Force connection with Rey. He is the son of Leia Organa and Han Solo and grandson of Darth Vader.\n * Daisy Ridley as Rey, a former scavenger from Jakku, Luke and Leia's Jedi apprentice, and the paternal granddaughter of Palpatine.\n * Cailey Fleming and Josefine Irrera Jackson as young Rey. Fleming appears through the use of archive footage from The Force Awakens.\n * John Boyega as Finn, a member of the Resistance and a former stormtrooper (FN-2187) who defected from the First Order.\n * Oscar Isaac as Poe Dameron, a high-ranking X-wing fighter pilot and commander of the Resistance who later inherits the rank of General from Leia.\n * Anthony Daniels as C-3PO, a humanoid protocol droid in the service of Leia.\n * Naomi Ackie as Jannah, a former stormtrooper of the First Order (TZ-1719) living on the planet Kef Bir, who aids the Resistance.\n * Domhnall Gleeson as General Hux, the First Order's third in-command.\n * Richard E. Grant as Allegiant General Pryde, a high-ranking general and second-in-command of the First Order and later commanding officer of a Sith armada, the Final Order, who previously served in the Galactic Empire.\n * Lupita Nyong'o as Maz Kanata, a former space pirate and ally of the Resistance.\n * Keri Russell as Zorii Bliss, an old acquaintance of Poe's from Kijimi.\n * Joonas Suotamo as Chewbacca, a Wookiee and first mate of the Millennium Falcon.\n * Kelly Marie Tran as Rose Tico, a mechanic in the Resistance and friend of Finn.\n * Ian McDiarmid as Emperor Palpatine, the resurrected Dark Lord of the Sith, shadow leader of the First Order, creator of Snoke, and Rey's paternal grandfather. He serves as the main antagonist of the Skywalker Saga and was previously thought to be conclusively dead after the Battle of Endor depicted in Return of the Jedi (1983).\n * Billy Dee Williams as Lando Calrissian, a veteran of the Rebel Alliance, a former owner of the Millennium Falcon, and an old friend of Chewbacca, Leia, Luke, and Han.\n * Liam Cook as Ochi, the Sith assassin who is responsible for killing Rey's parents to reclaim his ship and for hiding her on Jakku.\n\nBillie Lourd, Greg Grunberg, and Harrison Ford reprise their roles as Lieutenant Kaydel Ko Connix, Temmin \"Snap\" Wexley, and Han Solo, respectively. Additionally, Dominic Monaghan portrays Resistance trooper Beaumont Kin, Shirley Henderson voices Babu Frik, and Nick Kellington portrays Klaud via capture performance. Hassan Taj and Lee Towersey perform the role of R2-D2, while Dave Chapman and Brian Herring return as the puppeteers of BB-8, and director J. J. Abrams also provides the voice for D-O. Martin Wilde, Anton Simpson-Tidy, Lukaz Leong, Tom Rodgers, Joe Kennard, and Ashley Beck appear as the Knights of Ren. Amanda Lawrence reprises her role as Commander Larma D'Acy, while Vinette Robinson plays her wife, Pilot Wrobie Tyce.\n\nBilly Howle and Jodie Comer briefly appear as Rey's parents, Dathan and Miramir, while Tom Wilton and screenwriter Chris Terrio briefly appear as the performer and voice for Aftab Ackbar, the son of Admiral Ackbar, respectively; and Mike Quinn and Kipsang Rotich return as the performer and voice of Nien Nunb, respectively. Denis Lawson and Warwick Davis briefly reprise their roles as Wedge Antilles, a veteran of the Rebel Alliance; and Wicket W. Warrick, now the leader of the Ewoks, respectively. Composer John Williams cameos as Oma Tres, a Kijimi bartender, Kevin Smith cameos as a Kijimi inhabitant, and Abrams' frequent composer collaborator Michael Giacchino cameos as a Sith Trooper, while Lin-Manuel Miranda and Jeff Garlin both cameo as human and alien Resistance troopers, respectively. Actors making reprisal vocal cameos include: Hayden Christensen and James Earl Jones as Anakin Skywalker / Darth Vader, Andy Serkis as Snoke, and the voices of several past Jedi, including Ewan McGregor and Alec Guinness as Obi-Wan Kenobi (the latter via digitally altered archive audio), Ashley Eckstein as Ahsoka Tano, Freddie Prinze Jr. as Kanan Jarrus, Olivia d'Abo as Luminara Unduli, Frank Oz as Yoda, Liam Neeson as Qui-Gon Jinn, Jennifer Hale as Aayla Secura, Samuel L. Jackson as Mace Windu, and Angelique Perrin as Adi Gallia. Ed Sheeran, Karl Urban, Dhani Harrison, Nigel Godrich, J. D. Dillard, and Dave Hearn all cameo as stormtroopers."
    },
    {
      "title": "Development",
      "content": "In October 2012, Star Wars creator George Lucas sold his production company Lucasfilm to the Walt Disney Company. Disney subsequently announced the Star Wars sequel trilogy. The next month, Lawrence Kasdan and Simon Kinberg entered negotiations to write and produce either Episode VIII or Episode IX. Kinberg, Kasdan, and Michael Arndt worked in a writers room to discuss and map out the trilogy. However, these plans did not come to fruition and instead Kasdan co-wrote Episode VII - Star Wars: The Force Awakens, with Kinberg serving as a creative consultant. In June 2014, it was announced that Rian Johnson, writer and director of Star Wars: The Last Jedi, would write a story treatment for Episode IX. However in April 2017, Johnson later denied involvement in writing the film, claiming the information was outdated.\n\nIn August 2015, Colin Trevorrow was announced as the director of the film; he was to write the script with frequent collaborator Derek Connolly. Trevorrow and Connolly's script, titled Star Wars: Duel of the Fates after the theme of the same name from Star Wars: Episode I – The Phantom Menace, included elements which were utilized to some extent in the final film, such as Kylo finding a Sith holocron in Darth Vader's castle on Mustafar, the transference of Force energy, the concept of a superlaser-equipped Star Destroyer, Lando leading a galaxy-wide fleet of spaceships to save the day, and Chewbacca receiving a medal. An original idea of Trevorrow and his design team, the First Order TIE Echelon, survived in the Star Wars: Galaxy's Edge theme park, whose ship was supposed to appear in its original film.\n\nIn January 2016, Trevorrow revealed he was considering shooting on film and that he had wanted to shoot \"on location\" in outer space with IMAX cameras. Trevorrow and cinematographer John Schwartzman had planned to shoot the project entirely on 65mm film, using a new processing facility Kodak had developed in the UK. Trevorrow collaborated closely with Johnson whilst developing his script and even requested a scene featuring Rey and Poe be shot for Episode VIII -The Last Jedi. After the success of The Force Awakens, which became the highest-grossing film of 2015, Episode IX was put into production in February 2016, which Disney chief executive officer Bob Iger vaguely reported.\n\nIn late April 2017, Disney announced that the film would be released on May 24, 2019. A month later, filming was expected to begin in January 2018. In August 2017, it was announced that Jack Thorne would rewrite the script. On September 5, 2017, Lucasfilm stated that Trevorrow had left the production following creative differences. Trevorrow's place as director was supposedly on ice since June 2017. The Hollywood Reporter reported that his working relationship with Kathleen Kennedy had become unmanageable after failing to deliver a satisfactory script, despite writing several drafts, nor were either happy with Thorne's revisions. Johnson was rumored as the top choice to replace Trevorrow as director, but stated \"it was never in the plan for me to direct Episode IX.\" David Fincher had discussions with the studio but would ultimately decline from directing the film.\n\nOn September 12, it was announced that J.J. Abrams, the director of Star Wars: The Force Awakens, would return to direct the film, and that the film's release date would be moved to December 20, 2019. The story team met with George Lucas before writing the new script to discuss the nature of the Force. Abrams co-wrote the script with Chris Terrio, though Trevorrow and Connolly retain story credits. The story was rewritten to some extent before filming was completed. Terrio had written off working on larger-scale films at the time and did not socially know Abrams prior to agreeing to co-write the film with him.\n\nThe film was produced by Abrams' company Bad Robot, Kathleen Kennedy, and Michelle Rejwan. According to Terrio, the film's script had to include certain narrative beats provided by Kennedy and Rejwan, including the redemption of the character Kylo Ren. Abrams had also consulted with Johnson on making a film that both stood on its own but built upon previously established ideas and story elements.\n\nBefore filming, Episode IX was initially given the working title Black Diamond, which was then changed to TrIXie in 2018, so that the roman numeral \"IX\" would be included in the working title. The film's title, The Rise of Skywalker, was announced at April 2019's Star Wars Celebration in Chicago. Until its official reveal, only Abrams knew the title of the film."
    },
    {
      "title": "Casting",
      "content": "Carrie Fisher, who played General Leia Organa, died on December 27, 2016. Variety and Reuters reported that she had been planned for a key role in Episode IX. In January 2017, Lucasfilm stated that there were no plans to digitally generate Fisher's performance as they had for Rogue One (2016). The following April, Fisher's brother Todd revealed that Fisher's daughter, Billie Lourd, had granted Disney the rights to use recent footage of Fisher. However, a week later, Kathleen Kennedy stated that Fisher would not appear in the film. In July 2018, J. J. Abrams announced that unused footage of Fisher from The Force Awakens would be used to help complete the story. In flashback scenes, digital de-aging was used for the appearance of Luke and Leia through the use of facial shots of both characters from the Empire Strikes Back, and Return of the Jedi respectively. In November 2019, prior to the release of the film, Carrie Fisher's brother Todd Fisher, who planned before her death for her character to appear in the film, revealed that \"she was going to be the big payoff in the final film\" and \"she was going to be the last Jedi, so to speak.\"\n\nIn July 2018, Keri Russell was in talks to play a part with some \"action-heavy fight scenes\", and it was confirmed that Billy Dee Williams would return as Lando Calrissian, onscreen for the first time since 1983's Return of the Jedi — marking one of the longest intervals between portrayals of a character by the same actor in American film history. At the end of July, Russell was confirmed to have been cast, and there was an announcement of returning and additional new cast members. In late August, Deadline Hollywood announced that Dominic Monaghan and Matt Smith had been cast in unspecified roles; in 2019, Smith denied his involvement, but he later clarified that he had been in talks for an unrealized \"transformative\" part. Early rumors from Making Star Wars claimed Smith was set to portray a \"dark side acolyte\" who gets possessed by Palpatine. Greg Grunberg reprises his role as Temmin \"Snap\" Wexley.\n\nAt Star Wars Celebration in April 2019, it was revealed via the film's teaser trailer that Ian McDiarmid would return to portray Palpatine. Since the event was held after principal photography wrapped, Abrams was thrilled that news of McDiarmid on the set never leaked. Kathleen Kennedy said they decided to reveal Palpatine's return ahead of the film's release because of the characters playing a larger role in the story, having them differentiated from Grogu, the character from The Mandalorian. Abrams had initially considered Palpatine returning while developing The Force Awakens."
    },
    {
      "title": "Filming",
      "content": "Principal photography began on August 1, 2018, at Pinewood Studios in Buckinghamshire, England. Filming also took place in Wadi Rum, Jordan. Oscar Isaac stated that Abrams was allowing more improvised acting than in the previous two films. Due to the tight schedule, some editing took place on set. The crew on The Rise of Skywalker had three fewer months than they had to work on The Force Awakens leading to Maryann Brandon being sent in to cut on set a third of the way through production. Scenes detailing Palpatine's return were altered and changed during production as they were felt to \"go off topic\". The kiss between Rey and Ben was initially going to be excluded from the film, until Abrams decided against it at the last minute. Principal photography wrapped on February 15, 2019. Footage from the film was shown at The Walt Disney Company's annual shareholders meeting on March 7, 2019. Two weeks of reshoots took place at Pinewood involving Hamill, Ridley, and Isaac in July 2019. Another round of reshoots took place at Bad Robot between late September and mid-October. Abrams stated that the film had fewer reshoots and story adjustments than Episode VII."
    },
    {
      "title": "Post-production",
      "content": "The visual effects were created by Industrial Light & Magic and supervised by Roger Guyett. Last minute ADR was recorded with Adam Driver, in which he recorded his lines in a closet. The film finished post-production on November 25, 2019. After John Boyega accidentally left a copy of the script in his hotel room, it was listed on eBay for around £65. A Disney employee identified the script as authentic and purchased it from the seller for an undisclosed sum."
    },
    {
      "title": "Music",
      "content": "In January 2018, it was confirmed that John Williams would return to compose and conduct The Rise of Skywalker. The next month, Williams announced that it would be the last Star Wars film for which he would compose the score (though he would later return to compose the theme music for the Disney+ miniseries Obi-Wan Kenobi). In August 2019, it was revealed that Williams had written about 35 of an expected 135 minutes of music for the film, which according to Williams' brother Don, would incorporate all of the major themes of the Skywalker saga. Scoring began in July 2019 with Williams and William Ross conducting and orchestrating the sessions over the course of six months. The official soundtrack album was released by Walt Disney Records on December 20, 2019."
    },
    {
      "title": "Promotion",
      "content": "Despite staying silent about many details of the film, Abrams expressed his hopes that fans and general audiences would be \"satisfied\". He headed a panel dedicated to the film on April 12, 2019, during Star Wars Celebration in Chicago, where the film's title was revealed.\n\nAdditionally, the story events of the Disneyland themed area Star Wars: Galaxy's Edge precede the film, including the Millennium Falcon: Smugglers Run motion simulator, which features Chewbacca. On August 24, a new poster and \"sizzle reel\" was released at D23; the latter was released to the public two days later. The footage includes a montage of the Skywalker saga so far, as well as several new shots from the film."
    },
    {
      "title": "Tie-in literature and merchandise",
      "content": "A publishing campaign titled \"Journey to Star Wars: The Rise of Skywalker\" was announced on May 4, 2019. It includes the novel Resistance Reborn, set between The Last Jedi and The Rise of Skywalker, the young-adult novel Force Collector, the Middle Grade novel Spark of the Resistance, and various other titles. From December 18, 2019, to March 11, 2020, a prequel graphic novel titled The Rise of Kylo Ren, telling the story of how Ben Solo became Kylo Ren and elaborating upon the character's backstory, was published by Marvel Comics, written by Charles Soule and illustrated by Will Sliney.\n\nThe official novelization of The Rise of Skywalker is by Rae Carson; hardcover and audiobook versions were released on March 19, 2020. The novel details Palpatine's return in more depth: He transferred his consciousness into a clone body following his death in Return of the Jedi, and his \"son\", Rey's father, was a failed clone of Palpatine. The junior novel and corresponding audiobook are by Michael Kogge and was released on April 21, 2020. A five-issue Marvel Comics adaptation written by Jody Houser and illustrated by Will Sliney was planned to debut in mid-2020, but this was later cancelled, making the film the first in the franchise not to receive a serialized comic adaptation. However, the comic has finally been scheduled for release in February 2025. A separate graphic novel adaptation was released by IDW Publishing in 2021.\n\nA story arc of 2020's Darth Vader comic ties into The Rise of Skywalker, utilizing a creature cut from the film as well as Ochi. Further, a novel titled Shadow of the Sith, released mid-2022, explores the backstory of Luke and Lando as they investigate the dead world of Exegol."
    },
    {
      "title": "Video games",
      "content": "The video game Star Wars Battlefront II (2017) released a free level set on Ajan Kloss. In December 2019, the video game Fortnite Battle Royale released several cosmetics featuring character outfits for Rey, Finn, a Sith Trooper, Kylo Ren, and Zorii Bliss along with a TIE Fighter glider, a Millennium Falcon glider (which was given to players for free from the Winterfest Event), four emotes, and two free banners. On December 14, Fortnite publisher Epic Games released a preview of the film on an in-game theater screen as a live event. At the end of the event, a message from Palpatine (the one mentioned in the film's opening crawl) was heard. To coincide with the release of the film, a trailer for the forthcoming video game, Lego Star Wars: The Skywalker Saga was released on the same day."
    },
    {
      "title": "Theatrical",
      "content": "Star Wars: The Rise of Skywalker was originally planned to be released in the United States on May 24, 2019, before being pushed back to December 20 swapping release dates with Aladdin It had its world premiere at the Dolby Theatre in Hollywood, Los Angeles, on December 16. Unlike most studio films, Disney reportedly did not hold test screenings for The Rise of Skywalker, instead only showing it to Abrams' friends and family, as well as a terminally-ill fan. Before the film's release, Disney issued a warning that the scenes with strobe-like flashing lights may trigger photosensitive migraines and seizures."
    },
    {
      "title": "Home media",
      "content": "The Rise of Skywalker was scheduled to be released on Digital HD on March 17, 2020, but was released four days early in the light of the COVID-19 pandemic. Its DVD, Blu-ray, and 4K Ultra HD release followed on March 31 by Walt Disney Studios Home Entertainment. The 4K version of the film was also released in \"The Skywalker Saga\" Ultra HD Blu-ray box set that same date. It was released on Disney+ on May 4, which is reportedly two months ahead of its previously scheduled release date."
    },
    {
      "title": "Box office",
      "content": "The Rise of Skywalker grossed $515.2 million in the United States and Canada, and $561.8 million in other territories, for a worldwide total of $1.077 billion, making it the seventh highest-grossing film of 2019. Deadline Hollywood calculated the net profit of the film to be $300million, when factoring together all expenses and revenues.\n\nPre-sale tickets went on sale on October 21, 2019, and the film sold more tickets in their first hour of availability on Atom Tickets than the previous record-holder for ticket sales, Avengers: Endgame (2019). It became Atom Tickets' second-best first-day seller of all time behind Endgame, selling more than twice the number of tickets as The Last Jedi sold in that same timeframe, while Fandango reported it outsold all previous Star Wars films. Box office tracking had The Rise of Skywalker grossing around $205 million in its opening weekend, though some firms predicted a debut closer to $175 million. The film made $89.6 million on its first day, including $40 million from Thursday night previews, the sixth-highest opening day of all time. It went on to debut to $177.4 million, which was the third-highest opening ever for a December release and the 12th-best of all time, and it was also noted that Saturday (which saw a 47% drop from Friday's gross) was the busiest shopping day of the year, likely affecting ticket sales. However, Deadline Hollywood did write that \"we can't ignore the less than platinum B+\" audience exit scores, which could affect the film's legs (box office longevity) moving forward. The film made $32 million on Christmas Day, the second-best total ever for the holiday after The Force Awakens' $49.3 million in 2015. It went on to have a five-day total of $138.8 million, including $76 million for the weekend. In its third weekend the film made $34.5 million, remaining in first, before being dethroned in its fourth weekend by newcomer 1917 (2019). On January 14, 2020, the film crossed the $1 billion mark at the box office, becoming Disney's seventh film of 2019 to do so. At the end of its box office run, it was third highest-grossing film of 2019 in this region behind Avengers: Endgame and The Lion King.\n\nWorldwide the film was projected to gross around $450 million in its opening weekend, including $250 million from 52 international territories. It made $59.1 million from its first day of international release in 46 countries. The biggest markets were the United Kingdom ($8.3 million), Germany ($7.2 million), France ($5.3 million), and Australia ($4.3 million). In China, the film made $1.6 million (RMB11.6 million) through its first day. It went on to open to $198 million from overseas countries and $373.5 million worldwide, coming in below projections and 47% lower than The Last Jedi's total. Its biggest opening totals remained the UK ($26.8 million), Germany ($21.8 million), France ($15.2 million), Japan ($14.6 million), Australia ($12.6 million), and China ($12.1 million)."
    },
    {
      "title": "Critical response",
      "content": "The review aggregator website Rotten Tomatoes reported an approval rating of with an average score of, based on  reviews. The website's critical consensus reads, \"The Rise of Skywalker suffers from a frustrating lack of imagination, but concludes this beloved saga with fan-focused devotion.\" As such, The Rise of Skywalker received the lowest approval rating of the Skywalker Saga on Rotten Tomatoes, a post previously held by The Phantom Menace. Metacritic, which uses a weighted average, assigned the film a score of 53 out of 100 based on 61 critics, indicating \"mixed or average reviews\".\n\nRichard Roeper, reviewing for the Chicago Sun-Times, gave the film three stars out of four, writing that it \"rarely comes close to touching greatness, but it's a solid, visually dazzling and warmhearted victory [for] quality filmmaking.\" The A.V. Club's A. A. Dowd gave the film a C+, stating that the film \"is so freighted with obligation that it almost groans under the weight, flashing a weak smile as it vaguely approximates the appearance of a zippy good time.\" Michael Phillips for Chicago Tribune wrote that the film \"does the job. It wraps up the trio of trilogies begun in 1977 in a confident, soothingly predictable way, doing all that is cinematically possible to avoid [upsetting the] tradition-minded quadrants of the Star Wars fan base.\"\n\nMick LaSalle of the San Francisco Chronicle described the film as \"a disappointment\" and wrote, \"For all the movie's faults, it's likely that most people will consider The Rise of Skywalker and accept the trade: Sit through a so-so 110 minutes to get to a strong half hour.\" Owen Gleiberman of Variety called the film \"the most elegant, emotionally rounded, and gratifying Star Wars adventure since the glory days of Star Wars (1977) and The Empire Strikes Back (1980) ... but given the last eight films, the bar isn't that high.\" The BBC's Nicholas Barber praised the film's acting and wrote, \"The Rise of Skywalker has been lovingly crafted by a host of talented people, and yet the best they can do is pay tribute to everything [George Lucas] did several decades ago.\"\n\nScott Mendelson for Forbes described the film as \"possibly worse\" compared to the previous Skywalker saga films while ending the main saga and \"denying this new trilogy its artistic reason for existence\". He also criticized the film for retconning The Last Jedi and for its conventional plot twists, writing that the film is full of \"patronizing reversals in the name of mollifying the fans who merely want to be reminded of the first three movies.\" Justin Chang of the Los Angeles Times described the film as \"a Last Jedi corrective\", which is \"the more accurate way to describe it\" and represents \"an epic failure of nerve\". He further wrote it \"feels more like a retreat, a return to a zone of emotional and thematic safety from a filmmaker with a gift for packaging nostalgia as subversion.\" Writing for The New Yorker, Richard Brody wrote that the film's faults \"are those of the franchise over all\", as the film's director \"J. J. Abrams is mainly a distiller and a magnifier and brings virtually no originality to it\". Brody said that it would have been better if a \"boldly imaginative vulgarian such as Michael Bay\" had instead created a \"derisive wreckage\" of Star Wars. Brian Tallerico of RogerEbert.com criticized the film, giving it 2.5/4 stars, faulting it for \"Terrible dialogue, disinterested performances, and an unconvincing, phony CGI aesthetic\", and criticizing it for its \"misdirection\" and calling it \"A movie that so desperately wants to please a fractured fanbase that it doesn't bother with an identity of its own\", though he praised it for its \"[r]emarkable set pieces\".\n\nWhereas Asian-American actress Kelly Marie Tran had around ten minutes of screen time in The Last Jedi, she appears for about a minute in The Rise of Skywalker. The reduced role was interpreted by some critics as a concession to fans who disliked her character; Tran had been a target of racist, fatphobic and misogynistic online harassment following the release of The Last Jedi. Multiple cast members involved on the previous film defended her, such as Boyega. Critics said she was \"sidelined\" into a minor character, and commented on how she was written out \"without any explanation\" and her minor role was considered by one critic to be \"one of the film's biggest disappointments\". With regard to the criticism towards the character's reduced screen-time, screenwriter Chris Terrio said it was due to the difficulty of including the deceased Carrie Fisher archive footage in scenes planned to feature both characters."
    },
    {
      "title": "Audience response",
      "content": "Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale, the lowest among the live-action films in the franchise. On PostTrak, audiences gave the film an average of four stars out of five, with 70% of respondents rating it as a \"definite recommend\". Of the demographics polled by PostTrak, parents gave it 5 stars and children under 12 years old gave it 4.5 stars, with 80% of males and 84% of females rating it positively. RelishMix, which tracks social media posts and online presence, \"noticed a divided reaction to Skywalker online, though it leaned slightly positive\".\n\nMonths prior to the film's trailer release, the \"Want to See\" percentage was review bombed on Rotten Tomatoes, dropping the score as low as 5% within a day. Negative comments reflected a \"lingering negativity\" toward The Last Jedi according to Screen Rant. After a similar bombing campaign occurred with the 2019 film Captain Marvel, Rotten Tomatoes temporarily changed the \"Want to See\" feature to a number and eventually removed the feature altogether."
    },
    {
      "title": "Future",
      "content": "In a November 2021 interview by Empire, Kathleen Kennedy indicated that the Lucasfilm team had been having conversations regarding the future of the sequel trilogy's characters. At Star Wars Celebration Europe in 2023, a new film directed by Sharmeen Obaid-Chinoy was announced that will follow Rey as she attempts to rebuild the Jedi Order following the events of The Rise of Skywalker. Ridley is set to reprise her role as Rey. Kennedy also hinted at the possibility of other sequel trilogy characters coming back."
    }
  ]
}