{
  "title": "Rogue One: A Star Wars Story",
  "parentTitle": "Star Wars",
  "aliases": [],
  "links": [],
  "tags": [],
  "details": [
    {
      "type": "text",
      "label": "Country of Origin",
      "value": "United States"
    },
    {
      "type": "text",
      "label": "Original Language",
      "value": "English"
    }
  ],
  "content": "Rogue One: A Star Wars Story is a 2016 American epic space opera film directed by Gareth Edwards, from a screenplay by Chris Weitz and Tony Gilroy, inspired by a story idea from John Knoll and developed by Gary Whitta. The film was produced by Lucasfilm and distributed by Walt Disney Studios Motion Pictures. It is the first installment of the Star Wars anthology series, and an immediate prequel to Star Wars (1977). The main cast consists of Felicity Jones, Diego Luna, Ben Mendelsohn, Donnie Yen, Mads Mikkelsen, Alan Tudyk, Riz Ahmed, Jiang Wen, and Forest Whitaker. Set a week before the events of Star Wars: A New Hope, the plot follows a group of rebels who band together to steal plans of the Death Star, the ultimate weapon of the Galactic Empire. It details the Rebel Alliance's first effective victory against the Empire, first referenced in the Star Wars opening crawl.\n\nOmitting the opening crawl and transitional screen wipes used in the traditional Star Wars films, the film was intended to be different in tone and style and shot more like a war film. Principal photography began at Pinewood Studios, Buckinghamshire, in early August 2015 and wrapped in February 2016. The film then went through extensive reshoots in mid-2016. The film's score was composed by Michael Giacchino, rather than John Williams, who composed the score of all prior Skywalker Saga films up to that point. With an estimated production budget of $200–280.2 million, it is one of the most expensive films ever made.\n\nRogue One premiered in Los Angeles on December 10, 2016, and was theatrically released in the United States on December 16. The film received positive reviews from critics, with praise for its acting, story, visuals, musical score, cinematography, and the darker and more serious tone compared to previous Star Wars films, but criticism for its pacing, characters, and digital recreations of Grand Moff Tarkin and Princess Leia. It grossed over $1 billion worldwide, finishing its theatrical run as the second-highest-grossing film of 2016. It received two Academy Award nominations for Best Sound Mixing and Best Visual Effects. A prequel television series, titled Andor, premiered on the streaming service Disney+ on September 21, 2022.",
  "sections": [
    {
      "title": "Plot",
      "content": "Research scientist Galen Erso and his family hide on the planet Lah'mu when Imperial weapons developer Orson Krennic arrives to press him into completing the Death Star, a superweapon capable of destroying planets. Galen's wife Lyra is killed in the confrontation while their daughter Jyn escapes and is rescued by rebel extremist Saw Gerrera.\n\nFifteen years later, cargo pilot Bodhi Rook defects from the Empire, taking a holographic message from Galen to Saw on the moon Jedha. Rebel Alliance intelligence officer Cassian Andor learns of the Death Star and Bodhi's defection from an informant. Jyn is freed from an Imperial labor camp on Wobani and is brought to the rebels' base on Yavin 4, where rebel leader Mon Mothma convinces her to find Galen so the Alliance can learn more about the superweapon. Cassian is covertly ordered to aid Jyn but to kill Galen rather than extract him.\n\nJyn, Cassian, and reprogrammed former Imperial droid K-2SO travel to Jedha, where the Empire loots kyber crystals to power the Death Star. In Jedha City, Saw and his partisans are engaged in an armed insurgency against the Empire, and Jyn and Cassian get caught in the crossfire. Aided by blind spiritual warrior Chirrut Îmwe and his mercenary friend Baze Malbus, Jyn makes contact with Saw, who is holding Bodhi. Saw shows her the message in which Galen reveals he has secretly built a vulnerability into the Death Star. The schematics are located in an Imperial data vault on the planet Scarif.\n\nOnboard the Death Star, Krennic orders a test fire, which destroys Jedha City. Jyn and her group take Bodhi and flee the moon, but Saw remains there to die. Imperial governor Grand Moff Tarkin congratulates Krennic before using Bodhi's defection as a pretext to take control of the Death Star. Bodhi leads the group to Galen's Imperial research facility on the planet Eadu, where Cassian hesitates to kill Galen. Rebel bombers then attack the facility. Galen is wounded and dies in Jyn's arms before she escapes with her group on a stolen Imperial cargo shuttle. Krennic is summoned by Darth Vader to answer for the attack on Jedha City. Krennic seeks his support for an audience with the Emperor, but Vader instead Force chokes him and orders him to ensure no further problems occur.\n\nJyn proposes a mission to steal the Death Star schematics, but the Alliance Council feels there is no chance of victory. Frustrated at their inaction, Jyn's group leads a small squad of volunteers, which Bodhi dubs \"Rogue One,\" to raid the vault. Using the stolen Imperial shuttle, they gain access through the planet's shield. Jyn, Cassian, and K-2SO infiltrate the base while the others attack the Imperial garrison as a diversion.\n\nThe Alliance learns of the raid from intercepted Imperial communications and deploys their fleet in support, engaging in a space battle against the Imperial forces. K-2SO sacrifices himself so Jyn and Cassian can retrieve the data. Chirrut is killed after activating the switch to allow communication with the rebel fleet, and Baze is killed shortly afterward. Bodhi is killed by a grenade after informing the rebel fleet that it must deactivate the planetary shield to allow the transmission of the plans. Rebel Admiral Raddus uses a rebel ship to crash two Imperial Star Destroyers into each other; the wreckage destroys the shield generator. Jyn obtains the schematics but is ambushed by Krennic, who is shot and wounded by Cassian. Jyn transmits the schematics to the rebel command ship moments before the Death Star arrives above Scarif, commanded by Tarkin. He orders the Death Star to destroy the citadel, killing everyone, including Krennic, Cassian, and Jyn.\n\nThe rebel fleet prepares to jump to hyperspace, but many ships are intercepted by Darth Vader's Star Destroyer. Vader boards the rebel command ship and kills many troops in an attempt to reclaim the schematics, but a smaller ship escapes with the plans. Aboard the fleeing ship preparing to enter hyperspace, Princess Leia Organa declares that the schematics will provide hope for the Rebellion."
    },
    {
      "title": "Cast",
      "content": "\n * Felicity Jones as Jyn Erso: A young renegade who is detained for her crimes against the Empire until she is freed by the Rebel Alliance to help steal the plans for the Death Star.\n * Beau Gadsdon as eight-year-old Jyn\n * Dolly Gadsdon as four-year-old Jyn\n * Diego Luna as Cassian Andor: A rebel captain and intelligence officer.\n * Ben Mendelsohn as Orson Krennic: The director of advanced weapons research for the Imperial military.\n * Donnie Yen as Chirrut Îmwe: A blind warrior who believes in the Force but is not a Jedi or a Sith. He is said to be one of the Guardians of the Whills.\n * Mads Mikkelsen as Galen Erso: Jyn's father and a research scientist.\n * Alan Tudyk as the voice and motion-capture of K-2SO, a former Imperial enforcer droid who was reprogrammed by Cassian Andor to serve the Rebellion.\n * Riz Ahmed as Bodhi Rook: A former Imperial cargo pilot who defects to the rebels under the influence of Galen Erso.\n * Jiang Wen as Baze Malbus: A longtime companion of Chirrut Îmwe and one-time devoted Guardian of the Whills, now a rebel warrior and mercenary.\n * Forest Whitaker as Saw Gerrera: A veteran of the Clone Wars and a friend of the Erso family who had mentored Jyn in her later childhood years.\n\nJimmy Smits, Genevieve O'Reilly, Anthony Daniels, and Jimmy Vee reprise their roles from previous films as Bail Organa, Mon Mothma, C-3PO, and R2-D2, respectively; Vee is uncredited for his role. James Earl Jones also reprises his role from previous films as the voice of Darth Vader, who is physically portrayed by Spencer Wilding during the meeting with Krennic and aboard the Star Destroyer, and by Daniel Naprous at the end of the movie. Grand Moff Tarkin and Princess Leia Organa are played by Guy Henry and Ingvild Deila respectively, with the digital likenesses of Peter Cushing and Carrie Fisher superimposed. Henry also provides the voice for Tarkin, while archival audio of Fisher is used for Leia's dialogue. Angus MacInnes and Drewe Henley are featured as Gold Leader Dutch Vander and Red Leader Garven Dreis respectively, via unused footage from A New Hope; MacInnes returned to record new dialogue for Vander, while new dialogue for the deceased Henley was assembled from archival material. David Ankrum, who voiced Wedge Antilles in A New Hope, reprises his role in a vocal cameo. Ian McElhinney, Michael Smiley, Andy de la Tour, and Tim Beckmann play General Jan Dodonna, Dr. Evazan, General Hurst Romodi, and Captain Raymus Antilles, respectively. Warwick Davis plays Weeteef Cyubee, a member of Saw Gerrera's Partisans. Dave Filoni reprises his role as C1-10P from Star Wars Rebels. Stephen Stanton voices Admiral Raddus, while Paul Kasey appears in costume as the alien character on-screen.\n\nDuncan Pow plays Ruescott Melshi, a sergeant in the Rebel Alliance. Additionally, Alistair Petrie plays General Davits Draven, Ben Daniels plays General Antoc Merrick, and Valene Kane plays Lyra Erso, Jyn's mother. Jonathan Aris, Fares Fares, and Sharon Duncan-Brewster appear as Senators Nower Jebel, Vasp Vaspar, and Tynnra Pamlo, respectively. Simon Farnaby plays a member of Blue Squadron. Jordan Stephens appears as Rebel Alliance member Corporal Tonc. Nick Kellington plays Bistan, a door gunner on a U-wing during the battle on Scarif. Ian Whyte plays Moroff, a member of Saw Gerrera's Partisans. Daniel Mays appears as Tivik. Rian Johnson and Ram Bergman, director and producer of Star Wars: The Last Jedi, respectively, cameo as two Death Star technicians."
    },
    {
      "title": "Development",
      "content": "In 2003, during the production of Episode III in Sydney, John Knoll, the visual effects supervisor for all three prequels, pitched an episode for the unproduced series Star Wars: Underworld. At the time, he had written a short treatment called \"Destroyer of Worlds\". After the Disney acquisition he felt as though he had to pitch it again or forever wonder \"what might've happened if I had.\" In May 2014, Disney announced that Gareth Edwards would direct the film and that Gary Whitta would write the script. In October of the same year, cinematographer Greig Fraser revealed that he was hired to work on the film. In January 2015, it was revealed that Whitta had completed his work on the script, and would no longer be involved with the project. Simon Kinberg was considered as a replacement. Later that month, it was announced Chris Weitz had signed to continue the script's development for the film. In March 2015, the title Rogue One was officially revealed.\n\nEdwards stated the style of the film would be similar to that of a war film, stating, \"It's the reality of war. Good guys are bad. Bad guys are good. It's complicated, layered; a very rich scenario in which to set a movie.\" Assuming Disney would not allow a dark ending, Edwards had the main characters surviving in the original version of the script. However, the producers opted for a more tragic ending and never filmed the original version.\n\nIn May 2016, reports emerged the film would undergo five weeks of reshoots with Tony Gilroy writing additional scenes, as well as acting as a second-unit director under Edwards. With input from Edwards, Gilroy oversaw the edit and additional photography of the film which tackled several issues, including the ending. In August, Gilroy was given screenplay credit alongside Weitz and was paid $5 million for his work on the film. Additionally, Christopher McQuarrie, Scott Z. Burns, and Michael Arndt all contributed to the script at various stages in development.\n\nIn July 2016, discussing whether the film would feature an opening crawl, Kathleen Kennedy said, \"we're in the midst of talking about it, but I don't think these [anthology] films will have an opening crawl.\" Edwards explained that the film was \"supposed to be different than the saga films,\" and that \"This film is born out of a crawl. ... There's this feeling that if we did a crawl, then it'll create another movie.\" In November 2016, Kennedy confirmed the film would not feature an opening crawl, instead beginning in \"a way that is traditional, with just the title.\"\n\nAt the 2016 Star Wars Celebration, Edwards said that the film's title had three underlying meanings: \"a military sign,\" referring to the Red Squadron from A New Hope; \"the 'rogue' one\" of the franchise, given it is the first film to not be part of the main saga; and a description of Jyn Erso's personality."
    },
    {
      "title": "Casting",
      "content": "In January 2015, The Hollywood Reporter stated numerous actresses, including Tatiana Maslany, Rooney Mara, and Felicity Jones were being assessed for the film's lead. In February 2015, it was announced that Jones was in final talks to star in the film, while Aaron Paul and Édgar Ramírez were being eyed for the male lead role. In March 2015, Jones was officially cast as Jyn Erso. In March 2015, it was rumored that Ben Mendelsohn was being considered for a lead role. The next month, it was reported that Sam Claflin was being looked at for an unspecified role, while Riz Ahmed was in negotiations to join the film. In May, Mendelsohn, Ahmed, and Diego Luna were added to the cast in lead roles of the film. Forest Whitaker was cast in June 2015. In July 2015, Jonathan Aris was chosen to play Senator Jebel. Genevieve O'Reilly was cast as Mon Mothma, reprising her role from Star Wars: Episode III – Revenge of the Sith. James Earl Jones was confirmed to return as the voice of Darth Vader in June 2016."
    },
    {
      "title": "Filming",
      "content": "Principal photography on the film began at Pinewood Studios, Buckinghamshire, on August 8, 2015, where huge sets were built to complement scenes that were to be filmed elsewhere in the world. The movie was shot using Ultra Panavision 70 lenses with Arri Alexa 65 large format digital 6K cameras.\n\nFilming also took place in various locations around the world. In Iceland, the crew shot in Reynisfjara, and around the mountains of Hjörleifshöfði and Hafursey at Mýrdalssandur, which were used to represent the Erso homestead on Lah'mu and the Imperial research facility on Eadu respectively. Also used as filming locations were the Krafla area with its volcanic crater and around Lake Mývatn's rock formations. The islands of Gan and Baresdhoo of the Laamu Atoll in the Maldives, as well as the former RAF Bovingdon airfield, were used to represent Scarif. Wadi Rum in Jordan and the fortification of Masada was used to represent Jedha. Pymmes Park in Edmonton, London was also used for location filming, and scenes set on Yavin 4 were filmed at Cardington Airfield. Gareth Edwards selected the London Underground's Canary Wharf station as a location for a chase scene in an Imperial base; the location shoot took place overnight, when the station was closed to the public.\n\nEarly reports put the production budget of the film at $200 million. After the film was released, according to reports based on tax filing in the United Kingdom, the film had spent an estimated total of $280.2 million and was eligible for UK film production tax breaks which brought the final net cost down to $232.4 million."
    },
    {
      "title": "Post-production",
      "content": "On February 11, 2016, Disney executives stated the film was \"virtually completed.\" Several weeks of pre-scheduled reshoots began in June 2016. Tony Gilroy, who was an uncredited writer on the film at the time, was hired to direct the reshoots and rework aspects of the film, earning him a screenwriting credit. In 2023, Edwards disputed the reports that he was sidelined during the reshoots, saying that he remained heavily involved during the reshoots and worked with Gilroy. The very last scene to be shot was Darth Vader attacking the rebels. It was created by solely using digital tools.\n\nIndustrial Light & Magic (ILM) produced the film's visual effects. ILM used CGI and digitally altered archive footage to insert Peter Cushing's likeness over the body of actor Guy Henry. Lucasfilm secured permission from the late actor's estate to include him in the film. The team searched through archival footage of Cushing footage in order to find suitable reference material, and Henry provided the motion capture and voice work. A digital model of Cushing was mapped over Henry's performance like a digital body mask. Cushing's mannerisms, including his manner of speaking, were studied by the creative team and applied to the digital Tarkin model. Cushing's estate was heavily involved with the creation and had input right down to \"small, subtle adjustments.\" A similar process was used in the portrayal of Princess Leia; Carrie Fisher's appearance as Leia in the first film was superimposed over the face of Norwegian actress Ingvild Deila and archival audio of Fisher saying \"hope\" was used to voice the character.\n\nPost-production of the film wrapped on November 28, 2016."
    },
    {
      "title": "Music",
      "content": "In March 2015, it was reported that Alexandre Desplat who had worked with Edwards on Godzilla (2014), would compose the score for Rogue One, and had confirmed it in an April 2016 interview. As the film's reshooting affected the post-production process, Desplat opted out from the project due to his commitments for scoring Valerian and the City of a Thousand Planets (2017), and was replaced by Michael Giacchino in September 2016. Giacchino only had four and a half weeks to compose the music for the film, beginning almost immediately after finishing scoring Doctor Strange. In addition to composing original themes, Giacchino incorporated some of John Williams' themes from previous films into the score. The official soundtrack was released by Walt Disney Records on December 16, 2016. An extended version of the soundtrack was released on February 11, 2022, which includes additional demos composed for the film score, and cues that were not included in the album, or being un-edited. A vinyl edition was further released by Mondo in March 2022."
    },
    {
      "title": "Promotion",
      "content": "Promotion of Rogue One was initially delayed by the release of the film Mission: Impossible – Rogue Nation in July 2015, because the titles were deemed too similar. Paramount Pictures registered and cleared the title with the Motion Picture Association of America in January 2015, well before Disney announced the title of its forthcoming Star Wars spinoff. Disney and Lucasfilm had to reach an agreement with Paramount over promotion in order to avoid any confusion in the public mind. Disney agreed to embargo promotion on Rogue One until after mid-2015, with the exception of a very short teaser which was screened at Star Wars Celebration in Anaheim that year.\n\nA teaser trailer for Rogue One, released by Lucasfilm on April 7, 2016, was praised by reviewers for its portrayal of strong female characters. The Daily Telegraph described Jyn Erso's character as \"a roguish, Han Solo-style heroine,\" calling the film \"progressive,\" while noting its painstaking faithfulness to the production design style of the original Star Wars trilogy. The Hollywood Reporter also noted the visual nods to the original trilogy, and examined the film's possible narrative direction, considering that the outcome is to some extent already revealed in the opening crawl of A New Hope. The Atlantic writer David Sims stated that the trailer brought \"back some memorable pieces of architecture, from the lumbering AT-AT walkers to the Death Star itself, not to mention the glorious 70s costuming of Star Wars.\" He added that the trailer has \"the look,\" blending the old with the new. The trailer was viewed close to 30 million times in its first 29 hours, at a rate of 800,000 views per hour, from Facebook and YouTube, which is 200,000 views short of what the first teaser trailer for Star Wars: The Force Awakens was receiving in November 2014.\n\nIn June 2016, Rogue One was promoted at the Star Wars Celebration Europe III event in London. During the event, a new official poster was unveiled, which depicts a battle taking place on the tropical planet Scarif, with the Death Star looming large in a blue sky, above which is printed the tagline \"A Rebellion Built on Hope\". A second teaser trailer was screened exclusively at the event, and it was reviewed favorably by critics; The Daily Telegraph noted that the trailer revealed new locations such as the planets Jedha and Scarif, and that its most significant revelation came in the final seconds of the teaser, with the appearance of Darth Vader, reflected in a computer screen and accompanied by his classic breathing sound effect. Variety also hailed the Vader reveal, and noted that the emphasis of the production was much more on the kinetic depiction of large battle sequences and full-on warfare, comparing it to Francis Ford Coppola's 1979 Vietnam War epic Apocalypse Now. A showreel was also shown during the event, which featured footage from the film, cut with behind-the-scenes shots and interviews with the director and cast members. The second trailer was shown publicly during a broadcast of the 2016 Summer Olympics and received positive responses; Wired stated that the trailer was \"littered with nostalgic throwbacks to the original trilogy,\" while Rolling Stone described the CGI landscape shots seen in the footage as \"eye-poppingly gorgeous.\"\n\nA further trailer released in October 2016 prompted The Hollywood Reporter to comment that the newly revealed footage looked like \"a trailer to a different movie than the one advertised earlier,\" remarking that Jyn Erso appeared to be portrayed as a more vulnerable character, and highlighting the appearance of Galen Erso as a protective father figure. Vanity Fair also commented on the emphasis given to Jyn's relationship with her father, suggesting that Rogue One was drawing on \"the Star Wars franchise's greatest natural resource: daddy issues.\"\n\nThe film's publicity tour began in Mexico on November 23, 2016.\n\nIn Asia, Disney focused marketing efforts on Donnie Yen, with his individual poster being used for marketing in territories including Japan, Singapore, Indonesia, Thailand, Hong Kong, China, Vietnam, and Malaysia. The official Star Wars Facebook page of the respective Asian countries also featured clips and videos of Donnie Yen speaking various languages, greeting fans and telling them to support the film. Disney also released various versions of international trailers with more footage of Yen."
    },
    {
      "title": "Tie-in novels",
      "content": "A tie-in novel to the film, Catalyst: A Rogue One Novel, was released on November 15, 2016. Written by veteran Star Wars novelist James Luceno, the story is set some years before the events of Rogue One, and provides a backstory to the 2016 film. The novelization of the film was written by Alexander Freed, and released on December 16, 2016.\n\nMonths after the film was released, Lucasfilm Press published two further novels, titled Star Wars: Rebel Rising and Star Wars: Guardians of the Whills on May 2, 2017. Rebel Rising was written by Beth Revis, and explains what happened to Jyn Erso between the time her mother died and the day when rebel agents freed her from an Imperial labor camp, a time period that the film skips over in its opening minutes. Guardians of the Whills was written by novelist and comic writer Greg Rucka, and focuses on the characters Chirrut and Baze, telling their backstories as well as giving more context to the events that happened on Jedha prior to the Imperial occupation depicted in the film."
    },
    {
      "title": "Comics",
      "content": "Months after the film was released, Marvel Comics adapted the film into a six-part comic book miniseries, which adds extra content. In August 2017, IDW Publishing announced that it would make a one-shot graphic novel adaptation of the film, which was released one day after the Marvel miniseries' collection was released. Unlike the Marvel miniseries, this graphic novel will have slightly more cartoonish visuals.\n\nIn the same month, Marvel Comics released the Star Wars: Rogue One – Cassian & K-2SO Special, a 40-page one-shot comic focusing on the first meeting between Cassian Andor and K-2SO. The comic was written by Duane Swierczynski and pencilled by Fernando Blanco."
    },
    {
      "title": "Video games",
      "content": "A downloadable expansion pack for Star Wars Battlefront (2015), titled Rogue One: Scarif, was released in December 2016, and added content based on the film, including new game modes, a map based on the planet Scarif, and Jyn Erso and Orson Krennic as playable characters. A free virtual reality mission for PlayStation 4 was also released alongside the expansion. A free update for Star Wars Battlefront II (2017) was released in April 2020, adding a different Scarif map and other Rogue One-inspired content. Several characters and concepts from the film were also included in the mobile games Star Wars: Force Arena, Star Wars Commander, and Star Wars: Galaxy of Heroes."
    },
    {
      "title": "Release",
      "content": "Rogue One premiered at the Pantages Theatre in Los Angeles on December 10, 2016. The film was released in certain European countries on December 14, 2016, in North America on December 16, and in China on January 6, 2017.\n\nRogue One was released on Digital HD on March 24, 2017, and by Walt Disney Studios Home Entertainment on Blu-ray, Blu-ray 3D, and DVD on April 4. The film made a revenue of $81.1 million with nearly 4 million units sold, making it the third best-selling title of 2017 behind Moana and Beauty and the Beast. It was also released on Ultra HD Blu-ray on March 31, 2020, whilst also being reissued on Blu-ray and DVD.\n\nTo promote the release of Andor, Disney re-released Rogue One into over 150 IMAX theaters across the United States and Canada on August 26, 2022, featuring an exclusive preview of the Disney+ series ahead of its three-episode premiere on September 21, 2022."
    },
    {
      "title": "Box office",
      "content": "Rogue One grossed $534.9 million in the United States and Canada, and $523.9 million in other countries, for a worldwide total of $1.059 billion. Deadline Hollywood calculated the film's net profit as $319.6 million, accounting for production budgets, marketing, talent participation, and other costs; box office grosses and home media revenues placed it third on their list of 2016's \"Most Valuable Blockbusters\".\n\nIn late November 2016, box office projections for the United States and Canada had the film grossing $100–150 million during its opening weekend. Disney chairman Bob Iger noted that Disney and Lucasfilm did not expect Rogue One to match The Force Awakens' total gross of $2.1 billion, nor its $248 million opening. Pre-sale tickets for the film went on sale at 12:01 am EST on November 28, 2016. Within 10 minutes, ticket sale sites such as Fandango crashed, much like they had in advance of The Force Awakens the year prior. In its first 24 hours, the film had the second-highest number of pre-sale tickets ever sold, behind only The Force Awakens. Worldwide, the film was expected to gross $280–350 million in its opening weekend.\n\nIn the United States, the film made $29 million from its Thursday night previews, making it the highest-grossing Thursday opening of 2016. On Friday, the film grossed $71.1 million, and $46.3 million the next day, securing a total of $155.1 million in its opening weekend, the third-biggest debut of 2016. It topped the box office once again in its second weekend, grossing $64 million (down 58.7%) over the three day weekend, and $96.1 million over the four day weekend. On Christmas Day, it grossed $25.9 million. It finished first at the box office again in its third weekend, grossing $49.6 million (−22.5%) over the three-day weekend and $65.5 million over the four-day weekend. In its fourth weekend, Sunday projections had the film grossing $22 million, besting newcomer Hidden Figures' $21.8 million. However, final figures the following day revealed the film tallied a weekend total of $21.9 million, falling to second place behind Hidden Figures' $22.8 million. The IMAX re-release of the film on August 26, 2022, made $1.1 million over the weekend, bringing its running IMAX total to $105 million, 10th all-time."
    },
    {
      "title": "Critical response",
      "content": "The film has received generally favourable reviews, praising its aesthetics and narrative. On Rotten Tomatoes, the film has an approval rating of based on  reviews, with an average rating of. The site's critical consensus reads, \"Rogue One draws deep on Star Wars mythology while breaking new narrative and aesthetic ground and suggesting a bright blockbuster future for the franchise.\" On Metacritic, the film has a weighted average score 65 out of 100, based on 51 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale, while PostTrak reported film goers gave the film a 91% overall positive score.\n\nIGN reviewer Eric Goldman gave the film 9 out of 10, describing Rogue One 's storytelling being related to the plot of Star Wars (1977) as a \"tricky gambit\", but praised it for being clear and connected. He also enjoyed the visual aesthetic, which he opined helped establish its own identity, and praised the performances of Jones, Luna, and Tudyk. He disliked the film's connection to other Star Wars films, disliking the use of digital effects to recreate a character from the original trilogy, deeming it as \"uncanny valley.\" Peter Travers of Rolling Stone affirmed the film as being reminiscent of the original trilogy, and enjoyed Edward's direction and the pacing. He especially enjoyed Jones' performance and the action sequences in the third act, although he felt the film's exposition slightly undermined character interactions. Travers went on to give the film 4 stars. /Film rated Rogue One an 8 out of 10, with writer Peter Sciretta enjoying the darker tone, action sequences, Giacchino's score, and felt it retroactively improved Star Wars by providing additional context and backstory. Sciretta wished the film focused on further characterization, which he felt was neglected due to the ensemble cast and runtime.\n\nJustin Chang, writing for the Los Angeles Times, praised Fraser's cinematography and also enjoyed the action sequences, feeling its storytelling would \"immediately ascend to classic status\" and justified its existence. He particularly emphasized the cast, and commended the performances of Yen, Luna, and Jones; he defended the ensemble cast from criticism by contending it highlighted the film's anti-fascist themes. Chang also speculated that the film had faster pacing due to wanting to avoid criticisms of slow pacing from the prequel trilogy. Peter Bradshaw, a film critic of The Guardian giving a 4 star rating, enjoyed the film for providing \"muscular and adroit\" variations on familiar Star Wars elements and themes in addition to the depiction of the Death Star. He also offered general praise for cast performances, including that of Mikkelsen, Mendelsohn, Jones, Tudyk, Yen, and Luna, but felt the film did not \"go rogue at any stage\" and considered it to be released during the cultural zeitgeist of Star Wars: The Force Awakens (2015). In another 4 star review for The Guardian, Mark Kermode further praised the cast, enjoying the diversity and positively compared Jyn's character to that of Ellen Ripley from the film Aliens (1986). He also praised the cinematography of the battle scenes, which he described as being evocative of the Normandy landings and Vietnam War, and felt the standalone nature of the film allowed it to raise the dramatic stakes during the third act.\n\nIn a more critical review, The Washington Post's Ann Hornaday regarded the film as being simplistic and a \"placeholder\", comparing its imagery to Mad Max: Fury Road (2015) and Arrival (2016). She positively regarded the visual aesthetic, Giacchino's score, and darker tone, but thought the plot was unoriginal and lacked the tone of previous Star Wars films. That said, she regarded the film as superior to the prequel trilogy. Similarly, giving a C+ grade, IndieWire 's David Ehrlich similarly regarded it as \"a spirited but agonizingly safe attempt to ... to keep the wheels greased between proper installments\". He lauded the opening scene and final act, saying the latter reminded him of Star Wars \"as we remembered it\", and praised the set design and visuals as \"gorgeous.\" He also enjoyed how the film reconciled narrative elements between the original and newer Star Wars films, but felt the lack of interesting character development and requirement to adhere to pre-existing narratives was to its detriment. A. O. Scott and Richard Brody, writing for The New York Times and The New Yorker respectively, more heavily scrutinized the film and gave negative reviews. Both felt that it did not expand upon the Star Wars mythos, criticized the script, and considered the film to ultimately not justify its existence. Scott regarded the film as being \"mediocre\" and primarily critiqued the plot and thematic content, which he believed to be underdeveloped. Meanwhile, Brody, who went on to call it \"lobotomized and depersonalized,\" felt Edwards overlooked many aspects of Star Wars lore. Brody positively regarded Fraser's cinematography, and considered it his favorite element of the film, but was not affected by the death of major characters as he was not emotionally invested in their story.\n\nRogue One introduced many new characters into the Star Wars mythology, with Chirrut Îmwe, played by Donnie Yen, and K-2SO, played by Alan Tudyk, being the most popular. In a poll on the official Star Wars website in May 2017, in which more than 50,000 people voted, Chirrut Îmwe was voted as the most popular Rogue One character.\n\nGeorge Lucas was reported to have enjoyed the film more than The Force Awakens; upon hearing this, Edwards said, \"I can die happy now.\"\n\nThe film was praised for its exploration of ethics in engineering; in a reviewer's words, \"the core ethical arc of the film is one man's decision to engineer the Death Star in such a way as to prevent its use for galactic domination. One could fairly re-title the movie to 'Rogue One: an Engineering Ethics Story.'\"\n\nJames Seddon, writer for the military news website Task & Purpose lauded Rogue One as the Star Wars film that best reflects real military experience. Many details, resonate with his own military service and seem real to veterans: \"The spacecraft rattle annoyingly. Places where hands would naturally grab, or gear would rub, have the paint worn off. Cockpit windows are scratched, and, if the sunlight hits them wrong, they are hard to see through. Headphones get hung on a convenient grab rail and not on the hanger designed for them—if there even was a hanger. Apparently, designers of military vehicles in galaxies far, far, away have also never actually operated them in the field.\" He also pointed to aspects beyond the film's production design, like rebel Lt. Sefla's muzzle discipline, the \"bitter stoicism\" predominant among characters who \"spend most of their time wet, uncomfortable, afraid, and bickering\" even as they work diligently to complete their mission, and the moral ambiguity of some of the rebels' actions."
    },
    {
      "title": "Digital recreation",
      "content": "While much of the computer-generated imagery (CGI) received positive reviews, some news organizations published criticism about certain aspects, including the visual effects (VFX) that were used to revive Peter Cushing, who had died in 1994, as Grand Moff Tarkin. The Guardian's Catherine Shoard described the \"resurrection\" as a \"digital indignity.\" Joseph Walsh of The Guardian raised legal and ethical issues about bringing a long-dead actor to life. Lucasfilm had obtained permission from Cushing's estate before deciding to use his likeness. The Washington Times' Eric Althoff rejected the entire concept of using CGI to recreate a deceased actor: \"Alas, what we get is, basically, not a simulation, but an approximation of a simulation—a dead character portrayed by a living actor inhabiting not the character, but imitating the dead actor.\"\n\nSome journalists also criticized the quality of the CGI that was used to represent a younger Carrie Fisher in order to portray Princess Leia at an earlier time, as well as its suitability in movie-making. Eliana Dockterman of Time wrote that \"there was something particularly plastic about this version of the young Carrie Fisher—so smooth and so perfect it couldn't be real—that pulled me out of the moment.\" Kelly Lawler of USA Today said that \"while Tarkin is merely unnerving, the Leia cameo is so jarring as to take the audience completely out of the film at its most emotional moment. Leia's appearance was meant to help the film end on a hopeful note (quite literally, as 'hope' is her line), but instead it ends on a weird and unsettling one.\" Michael Cavna of The Washington Post described the facial effect as feeling \"distractingly artificial and nearly alien, like a plastered death mask robbed of authentic actorly effect, well beyond the usual artifice of Botox.\" For her part, Fisher was shown the CGI rendition of her younger self for the film by Kathleen Kennedy and \"loved it.\""
    },
    {
      "title": "Accolades",
      "content": "Rogue One received two Academy Award nominations for Best Sound Mixing and Best Visual Effects."
    },
    {
      "title": "Prequel",
      "content": "On November 8, 2018, it was announced that a live-action prequel series was officially in development and set to air on Disney's streaming service, Disney+. The series takes place five years before the events in Rogue One and focuses on Cassian Andor with Diego Luna reprising the role. The first season debuted on September 21, 2022, and focuses on Cassian's involvement in the Rebellion. The second season debuted on April 22, 2025."
    }
  ]
}