{
  "title": "Code of Conduct",
  "content": {
    "type": "container",
    "id": "coc-main-container",
    "backgroundColor": "#ffffff",
    "paddingTop": "40px",
    "paddingBottom": "40px",
    "marginTop": "0px",
    "marginBottom": "0px",
    "flexDirection": "column",
    "justifyContent": "flex-start",
    "alignItems": "center",
    "flexWrap": "nowrap",
    "gap": "24px",
    "items": [
      {
        "type": "markdown",
        "id": "coc-title",
        "value": "# OmniOntos Project Code of Conduct"
      },
      {
        "type": "image",
        "id": "coc-hero-image",
        "src": "https://placehold.co/800x400/b3d9ff/000000?text=Respectful+Collaboration",
        "alt": "Abstract image representing ethical collaboration and communication",
        "caption": "Fostering a constructive and inclusive environment for all.",
        "width": "80%",
        "height": "300px",
        "objectFit": "cover",
        "margin": "0 auto"
      },
      {
        "type": "container",
        "id": "coc-content-area",
        "flexDirection": "column",
        "justifyContent": "flex-start",
        "alignItems": "stretch",
        "gap": "24px",
        "padding": "0 10%",
        "width": "100%",
        "items": [
          {
            "type": "markdown",
            "id": "coc-intro",
            "value": "The OmniOntos project is dedicated to providing a harassment-free and inclusive experience for everyone, regardless of background, expertise, or personal characteristics. We believe that a diverse and welcoming community is essential for building a truly universal and logically complete ontology. This Code of Conduct outlines our expectations for participation within our discussion forums, proposed edits, and all other forms of interaction within the OmniOntos community."
          },
          {
            "type": "markdown",
            "id": "expected-behavior-section",
            "value": "## Expected Behavior\n\nWe expect all participants to adhere to the following principles:\n\n* **Be Respectful and Considerate:** Treat all community members with respect, kindness, and empathy. Disagreements should be handled constructively and professionally.\n* **Be Inclusive:** Welcome and support people of all backgrounds and perspectives. Avoid language or actions that could be perceived as exclusionary or offensive.\n* **Focus on the Ontology:** Discussions and contributions should remain focused on the technical and conceptual aspects of the ontology. Stay on topic and contribute to the logical completeness and accuracy of the system.\n* **Be Constructive:** When providing feedback or proposing changes, offer constructive criticism and actionable suggestions. Frame your input positively and with the goal of improvement.\n* **Assume Good Intent:** When interpreting others' comments or contributions, assume they are acting with good intentions unless there is clear evidence to the contrary.\n* **Be Patient:** Remember that this is a complex, ambitious project, and we are a small team (currently a one-man-show). Patience and understanding are greatly appreciated."
          },
          {
            "type": "markdown",
            "id": "unacceptable-behavior-section",
            "value": "## Unacceptable Behavior\n\nThe following behaviors are considered unacceptable and will not be tolerated:\n\n* **Harassment:** Any form of harassment, including but not limited to offensive verbal comments, intimidation, stalking, unwelcome sexual attention, or discriminatory jokes and language.\n* **Discrimination:** Any discrimination based on age, body size, disability, ethnicity, gender identity and expression, level of experience, nationality, personal appearance, race, religion, sexual identity and orientation, or other protected characteristics.\n* **Personal Attacks:** Insulting or derogatory comments, ad hominem attacks, or engaging in flame wars.\n* **Trolling or Gish Galloping:** Deliberately disrupting discussions, posting irrelevant or off-topic material, or overwhelming discussions with excessive or misleading information.\n* **Spamming:** Posting unsolicited or irrelevant advertisements, repetitive messages, or any form of commercial solicitation.\n* **Doxing:** Sharing private information of others without their explicit consent.\n* **Impersonation:** Pretending to be another person or entity.\n* **Any other conduct that is disruptive or interferes with the positive atmosphere of the community.**"
          },
          {
            "type": "markdown",
            "id": "reporting-guidelines-section",
            "value": "## Reporting Guidelines\n\nIf you experience or witness behavior that violates this Code of Conduct, please report it immediately by contacting us at:\n\n[**conduct@omni-ontos.org**](mailto:conduct@omni-ontos.org)\n\nAll reports will be handled with discretion and confidentiality. Please provide as much detail as possible, including:\n\n* Your name and contact information (optional, but helpful for follow-up).\n* The names of the individuals involved.\n* A description of the incident, including date, time, and location (if applicable).\n* Any relevant context or witnesses."
          },
          {
            "type": "markdown",
            "id": "enforcement-section",
            "value": "## Enforcement\n\nViolations of this Code of Conduct will be addressed by the OmniOntos project administrator(s) in a timely and fair manner. Consequences for violating the Code of Conduct may include, but are not limited to:\n\n* A warning.\n* Temporary suspension from discussion or editing privileges.\n* Permanent ban from the OmniOntos community.\n\nWe reserve the right to remove any content or accounts that violate this Code of Conduct or are otherwise deemed inappropriate or harmful to the community."
          },
          {
            "type": "markdown",
            "id": "coc-conclusion",
            "value": "By participating in the OmniOntos community, you agree to abide by this Code of Conduct. We appreciate your cooperation in helping us create a positive and productive environment for everyone."
          }
        ]
      }
    ]
  }
}